{
  "https://cat-bounce.com/": [
    "Oh, ð\u009f\u0091\u008b hi. Welcome to our world, we're so glad you could make it. Here's the deal. ð\u009f\u0091\u0089 Some cats are bouncier than others, so that meansmore force = more bounce. Use a gentler touch if you're losing cats. Don't like the background color? Resize or reload to change it. Remember: more force = more bounce. Please don't bounce too hard, it makes the cats cry. We â\u009d¤ï¸\u008f you.Sincerely,The Management",
    "About•Why Cats?•Contact",
    "SHARE THIS"
  ],
  "https://moodle.com/": null,
  "https://www.youtube.com/": [],
  "https://www.dr.dk/": [
    "Navigation",
    "DR's hovedindgange",
    "Nyhedssektioner",
    "Kontakt og privatliv",
    "DR's hovedindgange",
    "DR.dk forsiden",
    "Seneste nyt",
    "Udvalgte nyheder",
    "Breaking:Dårligt arbejdsmiljø hos Moderaterne",
    "Eksplosioner i Libanon",
    "Udvalgte nyheder",
    "I krig for Danmark",
    "Udvalgte nyheder",
    "Udvalgte nyheder",
    "Udvalgte nyheder",
    "Eksplosioner i Libanon",
    "Det bedste fra DR",
    "Udvalgte nyheder",
    "I krig for Danmark",
    "Det bedste fra P3",
    "Udvalgte nyheder",
    "Populære podcasts",
    "Sektionsoverblik",
    "Brugernes redaktør",
    "Kontakt redaktøren",
    "Lytternes og seernes redaktør (LSR) er brugernes uafhængige øjne og ører på DR's etik.",
    "Du kan læse om funktionenher.",
    "Du kan kontakte lytternes og seernes redaktør i DR, Jesper Termansen, pålsrred@dr.dk",
    "Om DR",
    "Fejl og fakta"
  ],
  "https://developers.google.com/youtube": [
    "Let users watch, find, and manage YouTube content",
    "Play YouTube Videos",
    "Add YouTube Data",
    "Add more YouTube features",
    "Analytics & Reporting",
    "Subscribe Buttons",
    "Live streaming",
    "Tools",
    "Issue Tracker",
    "Product Info"
  ],
  "https://www.drkoncerthuset.dk/": [
    "DR's Kor og Orkestre",
    "Mad og drikke",
    "Rundvisninger",
    "Praktisk information",
    "Lej DR Koncerthuset",
    "Sal og Studier",
    "Kontakt",
    "Stjerner og Striber",
    "Live in Concert",
    "Kom tæt på dramaet i den amerikanske valgkamp og oplev essensen af amerikansk kultur med musik fra bl.a. Succession og House of Cards. Vært: Stéphanie Surrugue.",
    "Jul i Ramasjang",
    "De kendte og elskede Ramasjang-figurer og værter byder indenfor i varmen til alle tiders musikalske rejse gennem julekalendere og julemusik.",
    "Luisi & Skrjabins 2.",
    "Mozarts formfuldendte elegance i ‘Eine kleine Nachtmusik’ åbner denne koncert sammen med to af hans virtuose og gribende arier.",
    "Nyt",
    "Efterårsferie",
    "Skyd efterårsferien i gang med sang, musik og dans",
    "Oplev bl.a. Silent Disco, affalds-duoen Trash, tv-parret Kaya og Ole, Ramasjang-programmet 'Spørg Kristian' live og meget mere.En billet koster kun 40 kr. og gælder til en hel formiddag eller eftermiddag i DR Koncerthuset.",
    "Mad og Drikke",
    "Restaurant KLANG",
    "Restaurant KLANG er et samarbejde mellem Meyers og DR Koncerthuset, hvor kvalitet, værtskab og smag spiller sammen med husets unikke kulturoplevelser og arkitektur. Hos os kan du nyde småretter i foyeren, eller en sæsonnær menu, serveret i restauranten.",
    "Gå i baren før og efter koncerten",
    "Kom i god tid og nyd stemningen i Koncerthuset med et glas vin, en af vores mange øl, en drink eller en varm kop kaffe/the. Vi har et stort udvalg, som kan friste de fleste.",
    "DR Symfoniorkestret",
    "Lyden af DR Symfoniorkestrets store, varme orkesterklang kan få taget til at løfte sig i Koncertsalen. Gå på opdagelse i koncerterne her.",
    "Besøg",
    "DR Big Band",
    "DR Big Band skaber unikke musikoplevelser i spændingsfeltet mellem klassisk bigbandjazz og vilde eksperimenter. Kom med ind i jazzens verden med DR Big Band og mange spændende gæstekunstnere.",
    "Besøg",
    "DR Pigekoret",
    "DR Pigekoret er et stærkt musikalsk fællesskab. Se korets koncerter og dyk ned i video, lyd og billeder.",
    "Besøg",
    "DR Vokalensemblet",
    "I selskab med DR Vokalensemblet kan du opleve kormusik i alle former. Læs mere om korets koncerter – og vær selv med til at synge både korværker og fællessang.",
    "Besøg",
    "DR Koncertkoret",
    "Når DR Koncertkoret tager plads på scenen i Koncertsalen, kan man opleve den store, flotte klang af 74 professionelle sangstemmer. Se korets koncerter og dyk ned i deres over 90-årige historie.",
    "Besøg",
    "DR Korskolen",
    "Talent, leg og sangglæde! DR Korskolen er en unik vej ind i musikkens og sangens verden for børn og unge i alderen 6 til 16 år. Læs om optagelsesprøver og koncerter her.",
    "Besøg",
    "DR Musikariet",
    "DR Musikariet skaber unikke musiktilbud på tværs af genrer til børn og unge i hele landet – både for skoler og familier. Kom med ind i vores univers af musik, leg og læring.",
    "Besøg",
    "Fortællinger",
    "Træd ind i musikkens verden",
    "I vores artikelunivers kan du komme et skridt nærmere DR's kor og orkestre, turnerende artister og events med artikler og videoer fra et hus i evig kreativ bevægelse. \nHer kan du møde mennesket bag musikken, komme med bag scenen og dykke ned i interessante temaer, der forener genrer og udtryksformer på tværs af huset.",
    "Få et smugkig bag scenen",
    "Kom med bag kulissen, når vi møder husets artister til en snak om deres håndværk, passion og inspirationskilder. Her dykker vi ned i alt det, der bevæger sig uden for scenen og forud for en koncert i DR Koncerthuset. Her finder du blandt andet de faste formater 'Backstage With Bohr', hvor chef for DR Koncerthuset, Kim Bohr, interviewer husets musikere og gæstekunstnere, og 'På Forreste Række', hvor vi møder turnerende kunstnere, før de går på scenen i Koncertsalen.",
    "Ind i musikken",
    "Tag med, når vi dykker ned i alt fra genrer og stilarter til de største sangskrivere, komponister, dirigenter og musikere gennem tiden.",
    "Nyheder",
    "Her finder du aktuelle historier om alt fra prisnomineringer og omtaler til indblik i nye programmer på lyd og tv, som husets kor og orkestre indgår i.",
    "Nyheder•DR Symfoniorkestret",
    "Kulturnatten 2024: Oplev Danmarks største orgel og strygere fra DR Symfoniorkestret",
    "Nyheder•DR Big Band",
    "DR Big Band og Miho Hazama fejrer jubilæum med release og ny kontrakt",
    "Nyheder•DR Symfoniorkestret",
    "Stjerner og striber sætter musik til den amerikanske valgkamp i DR Koncerthuset",
    "Nyheder•DR Musikariet",
    "DR Musikariet skyder efterårsferien i gang for hele familien",
    "Nyheder•DR Vokalensemblet",
    "DR Vokalensemblet åbner ny musikfestival",
    "Nyheder•DR Pigekoret",
    "DR Pigekoret synger efterårskoncerter under jorden og i mørke",
    "Nyheder•DR Big Band",
    "DR Big Band åbner sæsonen med svensk jazzkæmpe",
    "Nyheder•DR Symfoniorkestret",
    "DR Symfoniorkestret lancerer historisk samarbejde med Deutsche Grammophon",
    "DR Vokalensemblet",
    "En sæson fuld af farvestrålende kormusik",
    "Ind i musikken•DR Symfoniorkestret",
    "Tak for en stor, symfonisk sæson!",
    "Nyheder•DR Pigekoret",
    "DR Pigekoret sang Skoleskibet Danmark sikkert i havn",
    "Nyheder•DR Symfoniorkestret",
    "Unge Malko-talenter debuterer i Koncertsalen",
    "Nyheder•DR Pigekoret",
    "H.M. Dronning Mary fortsætter som protektor for DR Pigekoret",
    "Nyheder•DR Symfoniorkestret",
    "450 skolebørn giver koncert med DR Symfoniorkestret",
    "Nyheder•DR Symfoniorkestret",
    "DR Symfoniorkestret vinder BBC Award i London",
    "Nyheder•DR Pigekoret",
    "OL 2024 i Paris: DR Pigekoret lægger stemmer til dansk kultur og værdier",
    "Backstage|Artikel",
    "Teitur: “Musik har en helende funktion i verden … og det er der brug for”",
    "Backstage|Artikel",
    "Fra 20’erne til 20’erne: “Musik er jo en måde at fordøje verden på”",
    "Backstage|Artikel",
    "Karen Mukupa: Der mangler modne kvinder i musikbranchen",
    "Backstage|Artikel",
    "Mikael Simpson: \"Det er bare musik med musik i\"",
    "Backstage|Video•DR Big Band",
    "\"At vælge et yndlingsstykke af Carl Nielsen er som at bede en mor vælge mellem sine børn\"",
    "Backstage|Artikel",
    "Den klassiske musikquiz – bag kameraet",
    "Backstage|Artikel•DR Symfoniorkestret",
    "DR Symfoniorkestret låner noder fra eventyrernes symfoniske fakkelbærer",
    "Backstage|Artikel",
    "Hun var i lære hos legender",
    "Backstage|Artikel",
    "\"Han har betydet så utroligt meget for os danskere\"",
    "Backstage|Artikel",
    "Kira Skov: \"Ingen har jo matchet hende hverken før eller siden\"",
    "Backstage|Artikel",
    "Coco O: \"Man kan jo ikke vide, hvad andre bliver rørt af, men hvad der rører en selv\"",
    "Backstage|Video•DR Big Band",
    "Backstage with Bohr: Miho Hazama",
    "Backstage|Artikel",
    "Hun arbejder på en verden, hun måske aldrig får at se",
    "Backstage|Artikel•DR Symfoniorkestret",
    "Let’s Dance, Nielsen!: “De får den klassiske musik ind ved at bevæge sig til den”",
    "Backstage|Video•DR Big Band",
    "Hvordan lyder fremtidens danske jazz?",
    "Ind i musikken•DR Symfoniorkestret",
    "Tak for en stor, symfonisk sæson!",
    "Ind i musikken•DR Symfoniorkestret",
    "Gamere har valgt musikken til koncerter med DR Symfoniorkestret",
    "Ind i musikken|Artikel",
    "Hun er historiens første navngivne komponist",
    "Ind i musikken|Artikel",
    "Jakob Stegelmann: “Disney var ikke nået langt uden musikken”",
    "Ind i musikken|Artikel",
    "Signe Svendsen: “Kærligheden kan sagtens være et sted, hvor du tvivler”",
    "Ind i musikken|Artikel",
    "Marie Højlund udforsker lyden af vores hverdag",
    "Ind i musikken|Artikel•DR Symfoniorkestret",
    "Brødrene Capuçon besøger Koncertsalen: “For os er der brug for det menneskelige bånd”",
    "Ind i musikken|Artikel•DR Vokalensemblet",
    "Martina Batič fortalt med fem stykker musik",
    "Ind i musikken|Artikel•DR Symfoniorkestret",
    "Åh, smagen af en sonate",
    "Ind i musikken|Video•DR Symfoniorkestret",
    "Video: Han Duo peger på de fem vigtigste elementer i en adventure-film",
    "Ind i musikken|Artikel•DR Symfoniorkestret",
    "Minna Grooss: Eventyr er en måde at være i verden på",
    "Ind i musikken|Artikel•DR Symfoniorkestret",
    "Mathias Hammer: \"Jeg er spændt som en flitsbue!\"",
    "Ind i musikken|Artikel",
    "Gråd og gåsehud: Millioner har set DR Symfoniorkestret på YouTube",
    "Ind i musikken|Artikel",
    "Nikolaj Nørlund: \"Skønhed er ikke perfekt\"",
    "Ind i musikken|Artikel•DR Korskolen",
    "Gamle toner, nye stemmer: ”Der er noget over børnestemmer, som rammer en på en særlig måde”",
    "Ind i musikken|Artikel•DR Big Band",
    "DR Big Band og Palle Mikkelborg – en fælles historie",
    "Nyheder•DR Symfoniorkestret",
    "Kulturnatten 2024: Oplev Danmarks største orgel og strygere fra DR Symfoniorkestret",
    "Nyheder•DR Big Band",
    "DR Big Band og Miho Hazama fejrer jubilæum med release og ny kontrakt",
    "Nyheder•DR Symfoniorkestret",
    "Stjerner og striber sætter musik til den amerikanske valgkamp i DR Koncerthuset",
    "Nyheder•DR Musikariet",
    "DR Musikariet skyder efterårsferien i gang for hele familien",
    "Nyheder•DR Vokalensemblet",
    "DR Vokalensemblet åbner ny musikfestival",
    "Nyheder•DR Pigekoret",
    "DR Pigekoret synger efterårskoncerter under jorden og i mørke",
    "Nyheder•DR Big Band",
    "DR Big Band åbner sæsonen med svensk jazzkæmpe",
    "Nyheder•DR Symfoniorkestret",
    "DR Symfoniorkestret lancerer historisk samarbejde med Deutsche Grammophon",
    "Nyheder•DR Pigekoret",
    "DR Pigekoret sang Skoleskibet Danmark sikkert i havn",
    "Nyheder•DR Symfoniorkestret",
    "Unge Malko-talenter debuterer i Koncertsalen",
    "Nyheder•DR Pigekoret",
    "H.M. Dronning Mary fortsætter som protektor for DR Pigekoret",
    "Nyheder•DR Symfoniorkestret",
    "450 skolebørn giver koncert med DR Symfoniorkestret",
    "Nyheder•DR Symfoniorkestret",
    "DR Symfoniorkestret vinder BBC Award i London",
    "Nyheder•DR Pigekoret",
    "OL 2024 i Paris: DR Pigekoret lægger stemmer til dansk kultur og værdier",
    "Nyheder",
    "DR Pigekoret på statsbesøg med kongeparret",
    "Nyheder•DR Symfoniorkestret",
    "Koreansk dirigentkomet vinder Malko Konkurrencen 2024",
    "Nyhedsbrev",
    "Billetkontor",
    "DR Koncerthuset(Foyeren)\nØrestads Boulevard 13\n2300 København S.\nTlf.: 3520 6262drkoncerthuset@dr.dkSe Billetkontorets åbningstiderSe DR Koncerthusets smiley-rapporterLæs om persondata- og cookiepolitikLæs om salgs- og leveringsbetingelser",
    ""
  ],
  "https://www.pressenaevnet.dk/": [
    "Pressenævnets medlemmer | Pressenævnet",
    "Seneste nyt",
    "Behandler klager over medierne",
    "Pressenævnets opgave er at behandle klager over pressen. Mener du, at et medie har behandlet dig uretfærdigt, så begynd her.",
    "Se klagevejledning",
    "Medier under medieansvarsloven er underlagt Pressenævnets kompetence. Hvis du repræsenterer et medie, kan du læse mere om, hvad det indebærer her.",
    "Se vejledning for medier",
    "Kendelser",
    "Eftertryk Magasin får kritik for manglende forelæggelse",
    "Tipsbladet får kritik for ukorrekt information og manglende forelæggelse",
    "Helsingør Dagblad får ikke kritik for overskrift",
    "Fyens Stiftstidende får ikke kritik for omtale af straffesag",
    "Klage afvises på grund af manglende retlig interesse",
    "Indsigt",
    "Årsberetning for 2023",
    "Nye ansigter i Pressenævnet",
    "Årsberetning for 2022",
    "Vejledning til ofre for forbrydelser og ulykker",
    "Årsberetning for 2021",
    "Pressenævnets medlemmer",
    "Pressenævnet består af formandsskab, redaktører, journalister og repræsentanter for offentligheden. Samlet er der otte medlemmer af nævnet. Hvert medlem har en stedfortræder. Læs mere om de enkelte medlemmer ved at klikke på billederne.",
    "Jens Kruse Mikkelsen,højesteretsdommer, formand for Pressenævnet.",
    "Jørgen Steen Sørensen,højesteretsdommer, stedfortræder for formanden.",
    "Jesper Rothe,advokat og partner i Bech-Bruun, næstformand i Pressenævnet.",
    "Martin Lavesen,advokat og partner i advokatfirmaet DLA Piper, stedfortræder for næstformanden.",
    "Jørn Mikkelsen,tidl. chefredaktør på Morgenavisen Jyllands-Posten, medlem",
    "Karl Erik Stougaard,chefredaktør på Fyns Amts Avis samt for magasiner og tillæg i JFM, stedfortræder",
    "Hans Peter Blicher,etisk rådgiver på TV 2, medlem",
    "Anja Lundberg Andersen,etikchef i DR, stedfortræder",
    "Lene Sarup,journalist og tillidsmand på Jysk/fynske Medier, medlem",
    "James Kristoffer Miles,journalist på Ekstra Bladet, stedfortræder",
    "Maria Becher Trier,journalist på fagbladet Folkeskolen, medlem",
    "Astrid Søndberg,journalist på TV 2, stedfortræder",
    "Peter Munk Povlsen,efterskoleforstander, medlem",
    "Søs Lykke Sloth,kommunikationschef i Efterskolerne, stedfortræder",
    "John Meinert Jacobsen,direktør for AOF, medlem",
    "Benedikte Kaalund,sekretariatsleder i FOF, stedfortræder",
    "Kontakt",
    "Pressenævnet | Landgreven 4, 4. | 1301 København K",
    "E-mail: sekr@pressenaevnet.dk",
    "Telefon: 3315 5564",
    "Telefontider: Mandag til fredag kl. 10.00 – 14.00.",
    "Elektroniske fakturaer: EAN.NR 5798000065987",
    "Hvad er Pressenævnet?",
    "Pressenævnet er et offentligt, uafhængigt nævn, der træffer afgørelser i klager over medier. Nævnets medlemmer er fra medier og offentligheden. Formandskabet består af dommere og advokater.",
    "Nyhedsbrev",
    "Modtag nyhedsbrev samme dag som vi publicerer nyt.",
    "Tilmeld dig nyhedsbrevet her",
    "Læs mere om vores persondatapolitik i forhold til nyhedsbrevtilmeldinger via e-mailher.",
    "Årsrapport",
    "Download seneste og tidligereher.",
    "Kommende møder",
    "Se mødekalenderher.",
    "Webtilgængelighed",
    "Tilgængelighedserklæring"
  ],
  "https://www.dr.dk/om-dr": [
    "Navigation",
    "DR's hovedindgange",
    "Sektionens indgange",
    "Nyhedssektioner",
    "Kontakt og privatliv",
    "Sektionens indgange",
    "Om DR",
    "Om DR",
    "Om DR er sitet på dr.dk, der handler om DR’s egen verden. Her finder du nyheder og baggrund om DR, job- og medvirkende-opslag, serviceoplysninger, fakta om DR mv.",
    "Nyhedsbrev Om DR",
    "Nyhedsbrevet 'Om DR' udkommer hver torsdag med nyheder, baggrund og serviceoplysninger fra DR's egen verden.",
    "DR-tema om demens",
    "Genveje",
    "Sektionsoverblik",
    "Medvirkende og publikum",
    "Om DR",
    "Om DR er sitet på dr.dk, der handler om DR’s egen verden. Her finder du nyheder og baggrund om DR, job- og medvirkende-opslag, serviceoplysninger, fakta om DR mv.",
    "Nyhedsbrev Om DR",
    "Nyhedsbrevet 'Om DR' udkommer hver torsdag med nyheder, baggrund og serviceoplysninger fra DR's egen verden."
  ],
  "https://goo.gl/maps/B3fi5QGuiSt": [
    "Inden du fortsætter til Google",
    "Vi brugercookiesog data til at:",
    "Hvis du vælger \"Acceptér alle\", bruger vi også cookies og data til at:",
    "Hvis du vælger \"Afvis alle\", bruger vi ikke cookies til disse yderligere formål.",
    "Ikke-tilpasset indhold påvirkes f.eks. af det indhold, du aktuelt kigger på, aktivitet i din aktive søgesession og din lokation. Ikke-personligt tilpassede annoncer påvirkes af det indhold, du aktuelt kigger på, og din generelle lokation. Tilpasset indhold og personligt tilpassede annoncer kan også omfatte mere relevante resultater, anbefalinger og skræddersyede annoncer baseret på tidligere aktivitet i denne browser, f.eks. tidligere Google-søgninger. Vi bruger også cookies og data til at personligt tilpasse brugeroplevelsen, så den er alderssvarende, hvis det er relevant.",
    "Vælg \"Flere valgmuligheder\" for at se yderligere oplysninger, herunder oplysninger om administration af dine privatlivsindstillinger. Du kan også til enhver tid besøge g.co/privacytools/dk."
  ],
  "https://issuetracker.google.com/issues?q=componentid:186600": [],
  "https://developers.google.com/newsletter/subscribe": [
    "News from Google for Developers",
    "Keep up on Google’s developer technologies, new features, events, resources, community stories, and more. Build smarter, ship faster, and stay inspired.",
    "View the newsletter archive",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://firebase.google.com": [
    "Make your appthe best it can be with Firebase and generative AI",
    "Build AI-powered experiences into your apps and accelerate app development with managed infrastructure, powered by Google Cloud, so you can focus on what matters most.",
    "Launch, monitor, and iterate with AI-assistive tools that help you optimize your app's quality and experience.",
    "Easily integrate Firebase with Gemini and the latest AI technology from Google",
    "Easily integrate Firebase with your team's favorite tools.",
    "Install pre-packaged, open source bundles of code to automate common development tasks",
    "Easy to integrate on iOS, Android, and the Web",
    "Firebase provides detailed documentation and cross-platform app development SDKs, to help you build and ship apps for iOS, Android, the Web, Flutter, Unity, and C++.",
    "Keep up to date on everything Firebase",
    "Trusted by the largest apps and games",
    "Development teams around the world—including NPR, Halfbrick, Duolingo, and Venmo—use Firebase to build and ship their modern apps.",
    "Use Firebase products together to solve complex app development challenges and optimize your app experience. Learn how to personalize your onboarding flow, grow user engagement, or add new functionality with Firebase.",
    "Integrating it into your app is easy.",
    "All Firebase products",
    "Build",
    "Run",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://policies.google.com/privacy": [
    "",
    "Privacy & Terms",
    "",
    "Privacy & Terms",
    "Google Privacy Policy",
    "When you use our services, you’re trusting us with your information. We understand this is a big responsibility and work hard to protect your information and put you in control.",
    "This Privacy Policy is meant to help you understand what information we collect, why we collect it, and how you can update, manage, export, and delete your information.",
    "If European Union or United Kingdom data protection law applies to the processing of your information, you can review theEuropean requirements sectionbelow to learn more about your rights and Google’s compliance with these laws.",
    "Privacy Checkup",
    "Looking to change your privacy settings?",
    "Take the Privacy Checkup",
    "Contents",
    "We build a range of services that help millions of people daily to explore and interact with the world in new ways. Our services include:",
    "You can use our services in a variety of ways to manage your privacy. For example, you can sign up for a Google Account if you want to create and manage content like emails and photos, or see more relevant search results. And you can use many Google services when you’re signed out or without creating an account at all, like searching on Google or watching YouTube videos. You can also choose to browse the web in a private mode, likeChrome Incognitomode, which helps keep your browsing private from other people who use your device. And across our services, you can adjust your privacy settings to control whether we collect some types of data and how we use it.",
    "To help explain things as clearly as possible, we’ve added examples, explanatory videos, and definitions forkey terms. And if you have any questions about this Privacy Policy, you cancontact us.",
    "Information Google collects",
    "We want you to understand the types of information we collect as you use our services",
    "We collect information to provide better services to all our users — from figuring out basic stuff like which language you speak, to more complex things like whichads you’ll find most useful,the people who matter most to you online, or which YouTube videos you might like. The information Google collects, and how that information is used, depends on how you use our services and how you manage your privacy controls.",
    "When you’re not signed in to a Google Account, we store the information we collect withunique identifierstied to the browser, application, ordeviceyou’re using. This allows us to do things like maintain your preferences across browsing sessions, such as your preferred language or whether to show you more relevant search results or ads based on your activity.",
    "When you’re signed in, we also collect information that we store with your Google Account, which we treat aspersonal information.",
    "Things you create or provide to us",
    "When you create a Google Account, you provide us withpersonal informationthat includes your name and a password. You can also choose to add aphone numberorpayment informationto your account. Even if you aren’t signed in to a Google Account, you might choose to provide us with information — like an email address to communicate with Google or receive updates about our services.",
    "We also collect the content you create, upload, or receive from others when using our services.  This includes things like email you write and receive, photos and videos you save, docs and spreadsheets you create, and comments you make on YouTube videos.",
    "Information we collect as you use our services",
    "Your apps, browsers & devices",
    "We collect information about the apps, browsers, anddevicesyou use to access Google services, which helps us provide features like automatic product updates and dimming your screen if your battery runs low.",
    "The information we collect includesunique identifiers, browser type and settings, device type and settings, operating system, mobile network information including carrier name and phone number, and application version number. We also collect information about the interaction of your apps, browsers, and devices with our services, includingIP address, crash reports, system activity, and the date, time, andreferrer URLof your request.",
    "We collect this information when a Google service on your device contacts our servers — for example, when you install an app from the Play Store or when a service checks for automatic updates. If you’re using anAndroid device with Google apps, your device periodically contacts Google servers to provide information about your device and connection to our services. This information includes things like yourdevice type and carrier name, crash reports, which apps you've installed, and, depending on your device settings,other information about how you’re using your Android device.",
    "Your activity",
    "We collect information about your activity in our services, which we use to do things like recommend a YouTube video you might like. The activity information we collect may include:",
    "If you use ourservices to make and receive calls or send and receive messages, we may collect call and message log information like your phone number, calling-party number, receiving-party number, forwarding numbers, sender and recipient email address, time and date of calls and messages, duration of calls, routing information, and types and volumes of calls and messages.",
    "You can visit your Google Account to find and manage activity information that’s saved in your account.",
    "Go to Google Account",
    "Your location information",
    "We collect location information when you use our services, which helps us offer features like driving directions, search results for things near you, and ads based on your location.",
    "Depending on the products you’re using and settings you choose, Google may use different types of location information to help make some services and products you use more helpful. These include:",
    "The types of location data we collect and how long we store it depend in part on your device and account settings. For example, you canturn your Android device’s location on or offusing the device’s settings app. You can also turn onLocation Historyif you want to create a private map of where you go with your signed-in devices. And if your Web & App Activity setting is enabled, your searches and other activity from Google services, which may also include location information, is saved to your Google Account. Learn more abouthow we use location information.",
    "In some circumstances, Google also collects information about you frompublicly accessible sources. For example, if your name appears in your local newspaper, Google’s Search engine may index that article and display it to other people if they search for your name. We may also collect information about you from trusted partners, such as directory services who provide us with business information to be displayed on Google’s services, marketing partners who provide us with information about potential customers of our business services, and security partners who provide us with information toprotect against abuse. We also receive information from partners to provideadvertising and research services on their behalf.",
    "We use various technologies to collect and store information, includingcookies,pixel tags, local storage, such asbrowser web storageorapplication data caches, databases, andserver logs.",
    "Why Google collects data",
    "We use data to build better services",
    "We use the information we collect from all our services for the following purposes:",
    "Provide our services",
    "We use your information todeliver our services, like processing the terms you search for in order to return results or helping you share content by suggesting recipients from your contacts.Maintain & improve our servicesWe also use your information toensure our services are working as intended, such as tracking outages or troubleshooting issues that you report to us. And we use your information tomake improvementsto our services — for example, understanding which search terms are most frequently misspelled helps us improve spell-check features used across our services.Develop new servicesWe use the information we collect in existing services to help us develop new ones. For example, understanding how people organized their photos in Picasa, Google’s first photos app, helped us design and launch Google Photos.Provide personalized services, including content and adsWe use the information we collect to customize our services for you, including providing recommendations, personalized content, andcustomized search results. For example,Security Checkupprovides security tips adapted to how you use Google products. And, depending on your available settings, Google Play could use information like apps you’ve already installed and videos you’ve watched on YouTube to suggest new apps you might like.Depending on your settings, we may also show youpersonalized adsbased on your interests and activity across Google services. For example, if you search for “mountain bikes,” you may see ads for sports equipment on YouTube. You can control what information we use to show you ads by visiting your ad settings inMy Ad Center.We don’t show you personalized ads based onsensitive categories, such as race, religion, sexual orientation, or health.We don’t show you personalized ads based on your content from Drive, Gmail, or Photos.We don’t share information that personally identifies you with advertisers, such as your name or email, unless you ask us to. For example, if you see an ad for a nearby flower shop and select the “tap to call” button, we’ll connect your call and may share your phone number with the flower shop.Go to My Ad CenterMeasure performanceWe use data for analytics and measurement to understand how our services are used. For example, we analyze data about your visits to our sites to do things like optimize product design. And we also use data about the ads you interact with, including your related Google Search activity, to help advertisers understand the performance of their ad campaigns. We use a variety of tools to do this, including Google Analytics. When you visit sites or use apps that use Google Analytics, a Google Analytics customer may choose to enable Google tolink informationabout your activity from that site or app with activity from other sites or apps that use our ad services.Communicate with youWe use information we collect, like your email address, to interact with you directly. For example, we may send you a notification if we detect suspicious activity, like an attempt to sign in to your Google Account from an unusual location. Or we may let you know about upcoming changes or improvements to our services. And if you contact Google, we’ll keep a record of your request in order to help solve any issues you might be facing.Protect Google, our users, and the publicWe use information to help improve thesafety and reliabilityof our services. This includes detecting, preventing, and responding to fraud, abuse, security risks, and technical issues that could harm Google, our users, orthe public.We use different technologies to process your information for these purposes. We use automated systems that analyze your content to provide you with things like customized search results, personalized ads, or other features tailored to how you use our services. And we analyze your content to help usdetect abusesuch as spam, malware, and illegal content. We also usealgorithmsto recognize patterns in data. For example, Google Translate helps people communicate across languages by detecting common language patterns in phrases you ask it to translate.We mayuse the information we collectacross our services and across your devices for the purposes described above. For example, depending on your available settings, if you watch videos of guitar players on YouTube, you might see an ad for guitar lessons on a site that uses our ad products. Depending on your account settings,your activity on other sites and appsmay be associated with your personal information in order to improve Google’s services and the ads delivered by Google.If other users already have your email address or other information that identifies you, we may show them your publicly visible Google Account information, such as your name and photo. This helps people identify an email coming from you, for example.We’ll ask for your consent before using your information for a purpose that isn’t covered in this Privacy Policy.",
    "Maintain & improve our services",
    "We also use your information toensure our services are working as intended, such as tracking outages or troubleshooting issues that you report to us. And we use your information tomake improvementsto our services — for example, understanding which search terms are most frequently misspelled helps us improve spell-check features used across our services.Develop new servicesWe use the information we collect in existing services to help us develop new ones. For example, understanding how people organized their photos in Picasa, Google’s first photos app, helped us design and launch Google Photos.Provide personalized services, including content and adsWe use the information we collect to customize our services for you, including providing recommendations, personalized content, andcustomized search results. For example,Security Checkupprovides security tips adapted to how you use Google products. And, depending on your available settings, Google Play could use information like apps you’ve already installed and videos you’ve watched on YouTube to suggest new apps you might like.Depending on your settings, we may also show youpersonalized adsbased on your interests and activity across Google services. For example, if you search for “mountain bikes,” you may see ads for sports equipment on YouTube. You can control what information we use to show you ads by visiting your ad settings inMy Ad Center.We don’t show you personalized ads based onsensitive categories, such as race, religion, sexual orientation, or health.We don’t show you personalized ads based on your content from Drive, Gmail, or Photos.We don’t share information that personally identifies you with advertisers, such as your name or email, unless you ask us to. For example, if you see an ad for a nearby flower shop and select the “tap to call” button, we’ll connect your call and may share your phone number with the flower shop.Go to My Ad CenterMeasure performanceWe use data for analytics and measurement to understand how our services are used. For example, we analyze data about your visits to our sites to do things like optimize product design. And we also use data about the ads you interact with, including your related Google Search activity, to help advertisers understand the performance of their ad campaigns. We use a variety of tools to do this, including Google Analytics. When you visit sites or use apps that use Google Analytics, a Google Analytics customer may choose to enable Google tolink informationabout your activity from that site or app with activity from other sites or apps that use our ad services.Communicate with youWe use information we collect, like your email address, to interact with you directly. For example, we may send you a notification if we detect suspicious activity, like an attempt to sign in to your Google Account from an unusual location. Or we may let you know about upcoming changes or improvements to our services. And if you contact Google, we’ll keep a record of your request in order to help solve any issues you might be facing.Protect Google, our users, and the publicWe use information to help improve thesafety and reliabilityof our services. This includes detecting, preventing, and responding to fraud, abuse, security risks, and technical issues that could harm Google, our users, orthe public.We use different technologies to process your information for these purposes. We use automated systems that analyze your content to provide you with things like customized search results, personalized ads, or other features tailored to how you use our services. And we analyze your content to help usdetect abusesuch as spam, malware, and illegal content. We also usealgorithmsto recognize patterns in data. For example, Google Translate helps people communicate across languages by detecting common language patterns in phrases you ask it to translate.We mayuse the information we collectacross our services and across your devices for the purposes described above. For example, depending on your available settings, if you watch videos of guitar players on YouTube, you might see an ad for guitar lessons on a site that uses our ad products. Depending on your account settings,your activity on other sites and appsmay be associated with your personal information in order to improve Google’s services and the ads delivered by Google.If other users already have your email address or other information that identifies you, we may show them your publicly visible Google Account information, such as your name and photo. This helps people identify an email coming from you, for example.We’ll ask for your consent before using your information for a purpose that isn’t covered in this Privacy Policy.",
    "Develop new services",
    "We use the information we collect in existing services to help us develop new ones. For example, understanding how people organized their photos in Picasa, Google’s first photos app, helped us design and launch Google Photos.",
    "Provide personalized services, including content and ads",
    "We use the information we collect to customize our services for you, including providing recommendations, personalized content, andcustomized search results. For example,Security Checkupprovides security tips adapted to how you use Google products. And, depending on your available settings, Google Play could use information like apps you’ve already installed and videos you’ve watched on YouTube to suggest new apps you might like.",
    "Depending on your settings, we may also show youpersonalized adsbased on your interests and activity across Google services. For example, if you search for “mountain bikes,” you may see ads for sports equipment on YouTube. You can control what information we use to show you ads by visiting your ad settings inMy Ad Center.",
    "Go to My Ad Center",
    "Measure performance",
    "We use data for analytics and measurement to understand how our services are used. For example, we analyze data about your visits to our sites to do things like optimize product design. And we also use data about the ads you interact with, including your related Google Search activity, to help advertisers understand the performance of their ad campaigns. We use a variety of tools to do this, including Google Analytics. When you visit sites or use apps that use Google Analytics, a Google Analytics customer may choose to enable Google tolink informationabout your activity from that site or app with activity from other sites or apps that use our ad services.",
    "Communicate with you",
    "We use information we collect, like your email address, to interact with you directly. For example, we may send you a notification if we detect suspicious activity, like an attempt to sign in to your Google Account from an unusual location. Or we may let you know about upcoming changes or improvements to our services. And if you contact Google, we’ll keep a record of your request in order to help solve any issues you might be facing.",
    "Protect Google, our users, and the public",
    "We use information to help improve thesafety and reliabilityof our services. This includes detecting, preventing, and responding to fraud, abuse, security risks, and technical issues that could harm Google, our users, orthe public.",
    "We use different technologies to process your information for these purposes. We use automated systems that analyze your content to provide you with things like customized search results, personalized ads, or other features tailored to how you use our services. And we analyze your content to help usdetect abusesuch as spam, malware, and illegal content. We also usealgorithmsto recognize patterns in data. For example, Google Translate helps people communicate across languages by detecting common language patterns in phrases you ask it to translate.",
    "We mayuse the information we collectacross our services and across your devices for the purposes described above. For example, depending on your available settings, if you watch videos of guitar players on YouTube, you might see an ad for guitar lessons on a site that uses our ad products. Depending on your account settings,your activity on other sites and appsmay be associated with your personal information in order to improve Google’s services and the ads delivered by Google.",
    "If other users already have your email address or other information that identifies you, we may show them your publicly visible Google Account information, such as your name and photo. This helps people identify an email coming from you, for example.",
    "We’ll ask for your consent before using your information for a purpose that isn’t covered in this Privacy Policy.",
    "Your privacy controls",
    "You have choices regarding the information we collect and how it's used",
    "This section describes key controls for managing your privacy across our services. You can also visit thePrivacy Checkup, which provides an opportunity to review and adjust important privacy settings. In addition to these tools, we also offer specific privacy settings in our products — you can learn more in ourProduct Privacy Guide.",
    "Go to Privacy Checkup",
    "Managing, reviewing, and updating your information",
    "When you’re signed in, you can always review and update information by visiting the services you use. For example, Photos and Drive are both designed to help you manage specific types of content you’ve saved with Google.",
    "We also built a place for you to review and control information saved in your Google Account. YourGoogle Accountincludes:",
    "Privacy controls",
    "Activity Controls",
    "Decide what types of activity you’d like saved in your account. For example, if you have YouTube History turned on, the videos you watch and the things you search for are saved in your account so you can get better recommendations and remember where you left off. And if you have Web & App Activity turned on, your searches and activity from other Google services are saved in your account so you can get more personalized experiences like faster searches and more helpful app and content recommendations. Web & App Activity also has a subsetting that lets you control whetherinformation about your activity on other sites, apps, and devices that use Google services, such as apps you install and use on Android, is saved in your Google Account and used to improve Google services.",
    "Go to Activity Controls",
    "Ad settings",
    "Manage your preferences about the ads shown to you on Google and on sites and apps thatpartner with Googleto show ads. You can modify your interests, choose whether your personal information is used to make ads more relevant to you, and turn on or off certain advertising services.",
    "Go to My Ad Center",
    "About you",
    "Manage personal info in your Google Account and control who can see it across Google services.",
    "Go to About You",
    "Shared endorsements",
    "Choose whether your name and photo appear next to your activity, like reviews and recommendations, that appear in ads.",
    "Go to Shared Endorsements",
    "Sites and apps that use Google services",
    "Manage information that websites and apps using Google services, like Google Analytics, may share with Google when you visit or interact with their services.",
    "Go to How Google uses information from sites or apps that use our services",
    "Ways to review & update your information",
    "My Activity",
    "My Activity allows you to review and control data that’s saved to your Google Account when you’re signed in and using Google services, like searches you’ve done or your visits to Google Play. You can browse by date and by topic, and delete part or all of your activity.",
    "Go to My Activity",
    "Google Dashboard",
    "Google Dashboard allows you to manage information associated with specific products.",
    "Go to Dashboard",
    "Your personal information",
    "Manage your contact information, such as your name, email, and phone number.",
    "Go to Personal Info",
    "When you’re signed out, you can manage information associated with your browser or device, including:",
    "Exporting, removing & deleting your information",
    "You can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.",
    "Export your data",
    "To delete your information, you can:",
    "Delete your information",
    "Inactive Account Managerallows you to give someone else access to parts of your Google Account in case you’re unexpectedly unable to use your account.",
    "And finally, you can alsorequest to remove contentfrom specific Google services based on applicable law and our policies.",
    "There are other ways to control the information Google collects whether or not you’re signed in to a Google Account, including:",
    "Sharing your information",
    "When you share your information",
    "Many of our services let you share information with other people, and you have control over how you share. For example, you can share videos on YouTube publicly or you can decide to keep your videos private. Remember, when you share information publicly, your content may become accessible through search engines, including Google Search.",
    "When you’re signed in and interact with some Google services, like leaving comments on a YouTube video or reviewing an app in Play, your name and photo appear next to your activity. We may also display this information inads depending on your Shared endorsements setting.",
    "When Google shares your information",
    "We do not share your personal information with companies, organizations, or individuals outside of Google except in the following cases:",
    "With your consent",
    "We’ll share personal information outside of Google when we have your consent. For example, if youuse Google Home to make a reservationthrough a booking service, we’ll get your permission before sharing your name or phone number with the restaurant. We also provide you with controls toreview and manage third party apps and sitesyou have given access to data in your Google Account. We’ll ask for your explicit consent to share anysensitive personal information.",
    "With domain administrators",
    "If you’re a student or work for an organization that uses Google services, yourdomain administratorand resellers who manage your account will have access to your Google Account. They may be able to:",
    "For external processing",
    "We provide personal information to ouraffiliatesand other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures. For example, we use service providers to help operate our data centers, deliver our products and services, improve our internal business processes, and offer additional support to customers and users. We also use service providers to help review YouTube video content for public safety and analyze and listen to samples of saved user audio to help improve Google’s audio recognition technologies.",
    "For legal reasons",
    "We will share personal information outside of Google if we have a good-faith belief that disclosure of the information is reasonably necessary to:",
    "We may sharenon-personally identifiable informationpublicly and with our partners — like publishers, advertisers, developers, or rights holders. For example, we share information publicly toshow trendsabout the general use of our services. We also allowspecific partnersto collect information from your browser or device for advertising and measurement purposes using their own cookies or similar technologies.",
    "If Google is involved in a merger, acquisition, or sale of assets, we’ll continue to ensure the confidentiality of your personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.",
    "Keeping your information secure",
    "We build security into our services to protect your information",
    "All Google products are built with strong security features that continuously protect your information. The insights we gain from maintaining our services help us detect and automatically block security threats from ever reaching you. And if we do detect something risky that we think you should know about, we’ll notify you and help guide you through steps to stay better protected.",
    "We work hard to protect you and Google from unauthorized access, alteration, disclosure, or destruction of information we hold, including:",
    "Exporting & deleting your information",
    "You can export a copy of your information or delete it from your Google Account at any time",
    "You can export a copy of content in your Google Account if you want to back it up or use it with a service outside of Google.",
    "Export your data",
    "To delete your information, you can:",
    "Delete your information",
    "Retaining your information",
    "We retain the data we collect for different periods of time depending on what it is, how we use it, and how you configure your settings:",
    "When you delete data, we follow a deletion process to make sure that your data is safely and completely removed from our servers or retained only in anonymized form. We try to ensure that our services protect information from accidental or malicious deletion. Because of this, there may be delays between when you delete something and when copies are deleted from our active and backup systems.",
    "You can read more about Google’sdata retention periods, including how long it takes us to delete your information.",
    "Compliance & cooperation with regulators",
    "We regularly review this Privacy Policy and make sure that we process your information in ways that comply with it.",
    "Data transfers",
    "We maintainservers around the worldand your information may be processed on servers located outside of the country where you live. Data protection laws vary among countries, with some providing more protection than others. Regardless of where your information is processed, we apply the same protections described in this policy. We also comply with certainlegal frameworksrelating to the transfer of data.",
    "When we receive formal written complaints, we respond by contacting the person who made the complaint. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of your data that we cannot resolve with you directly.",
    "European requirements",
    "How to exercise your rights and contact Google",
    "If European Union (EU) or United Kingdom (UK) data protection law applies to the processing of your information, we provide thecontrolsdescribed in this policy so you can exercise your rights to request access to, update,remove, and restrict the processing of your information. You also have the right to object to the processing of your information or export your information to another service.",
    "If you have additional questions or requests related to your rights,you can contact Google and our data protection office. And you can contact your local data protection authority if you have concerns regarding your rights under local law.",
    "Data controller",
    "Unless otherwise stated in a service-specific privacy notice, thedata controller responsible for processing your informationdepends on where you are based:",
    "Google LLC is the data controller responsible for processing information indexed and displayed in services likeGoogle Searchand Google Maps regardless of your location. Google Ireland Limited is the data controller responsible for processing information to train Google’s AI models for the purpose of deploying them in services provided by Google Ireland Limited in the European Economic Area or Switzerland.",
    "Legal bases of processing",
    "We process your information for thepurposesdescribed in this policy, based on the following legal grounds:",
    "How you use Google services and your privacy settings will determine what data is processed, the purposes for which this data is processed, and the legal bases for processing data. The table below explains these processing purposes, the kinds of data processed, and the legal grounds for processing this data, in more detail.",
    "To provide Google services, products, and features",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "To maintain and improve Google services, products, and features",
    "To maintain the service so it works as intended, such as debugging the service, tracking issues or troubleshooting issues.",
    "Examples of processing activities:",
    "To make improvements to Google services and to help improve the safety and reliability of these services, such as to detect, prevent, and respond to fraud, abuse, security risks, and technical issues that could harm the service or users.",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "To develop new Google services, products and features",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "To provide personalized services, including content and ads",
    "To customize our services for you, including providing recommendations, personalized content, and customized search results.",
    "Examples of processing activities:",
    "Depending on your settings, to show you personalized ads based on your interests.",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "To measure performance - We use data for analytics and measurement to understand how our services are used.",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "To communicate with you - We use information we collect, like your email address, to interact with you directly.",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "To protect Google, our users, and the public",
    "To help improve the safety and reliability of our services, including detecting, preventing, and responding to fraud, abuse, security risks, and technical issues that could harm Google, our users, or the public.",
    "Examples of processing activities:",
    "To meet any applicable law, regulation, legal process or enforceable governmental request.",
    "Examples of processing activities:",
    "The information processed will depend on how you use Google services and your settings but could include the following:",
    "The legal grounds for processing this information will depend on how you use Google services and your settings but could include the following:",
    "Linking your Google services",
    "If you’re a user in the EU, we offer you the choice to keep certain Google services linked. You can learn more about your linked services and how to manage your choices atAbout DMA & Your Linked Services.",
    "About this policy",
    "When this policy applies",
    "This Privacy Policy applies to all of the services offered by Google LLC and itsaffiliates, including YouTube, Android, and services offered on third-party sites, such as advertising services. This Privacy Policy doesn’t apply to services that have separate privacy policies that do not incorporate this Privacy Policy.",
    "This Privacy Policy doesn’t apply to:",
    "Changes to this policy",
    "We change this Privacy Policy from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We always indicate the date the last changes were published and we offer access toarchived versionsfor your review. If changes are significant, we’ll provide a more prominent notice (including, for certain services, email notification of Privacy Policy changes).",
    "Related privacy practices",
    "Specific Google services",
    "The following privacy notices provide additional information about some Google services:",
    "If you’re a member of an organization that uses Google Workspace or Google Cloud Platform, learn how these services collect and use your personal information in theGoogle Cloud Privacy Notice.",
    "Other useful resources",
    "The following links highlight useful resources for you to learn more about our practices and privacy settings.",
    "Key terms",
    "Affiliates",
    "An affiliate is an entity that belongs to the Google group of companies, including the following companies that provide consumer services in the EU: Google Ireland Limited, Google Commerce Ltd, Google Payment Corp, and Google Dialer Inc. Learn more about thecompanies providing business services in the EU.",
    "Algorithm",
    "A process or set of rules followed by a computer in performing problem-solving operations.",
    "Application data cache",
    "An application data cache is a data repository on a device. It can, for example, enable a web application to run without an internet connection and improve the performance of the application by enabling faster loading of content.",
    "Browser web storage",
    "Browser web storage enables websites to store data in a browser on a device. When used in \"local storage\" mode, it enables data to be stored across sessions. This makes data retrievable even after a browser has been closed and reopened. One technology that facilitates web storage is HTML 5.",
    "Cookies",
    "A cookie is a small file containing a string of characters that is sent to your computer when you visit a website. When you visit the site again, the cookie allows that site to recognize your browser. Cookies may store user preferences and other information. You can configure your browser to refuse all cookies or to indicate when a cookie is being sent. However, some website features or services may not function properly without cookies. Learn more abouthow Google uses cookiesand how Google uses data, including cookies,when you use our partners' sites or apps.",
    "Device",
    "A device is a computer that can be used to access Google services. For example, desktop computers, tablets, smart speakers, and smartphones are all considered devices.",
    "Google Account",
    "You may access some of our services by signing up for aGoogle Accountand providing us with some personal information (typically your name, email address, and a password). This account information is used to authenticate you when you access Google services and protect your account from unauthorized access by others. You can edit or delete your account at any time through your Google Account settings.",
    "IP address",
    "Every device connected to the Internet is assigned a number known as an Internet protocol (IP) address. These numbers are usually assigned in geographic blocks. An IP address can often be used to identify the location from which a device is connecting to the Internet. Learn more abouthow we use location information.",
    "Non-personally identifiable information",
    "This is information that is recorded about users so that it no longer reflects or references an individually-identifiable user.",
    "Personal information",
    "This is information that you provide to us which personally identifies you, such as your name, email address, or billing information, or other data that can be reasonably linked to such information by Google, such as information we associate with your Google Account.",
    "Pixel tag",
    "A pixel tag is a type of technology placed on a website or within the body of an email for the purpose of tracking certain activity, such as views of a website or when an email is opened. Pixel tags are often used in combination with cookies.",
    "Referrer URL",
    "A Referrer URL (Uniform Resource Locator) is information transmitted to a destination webpage by a web browser, typically when you click a link to that page. The Referrer URL contains the URL of the last webpage the browser visited.",
    "Sensitive personal information",
    "This is a particular category of personal information relating to topics such as confidential medical facts, racial or ethnic origins, political or religious beliefs, or sexuality.",
    "Server logs",
    "Like most websites, our servers automatically record the page requests made when you visit our sites. These “server logs” typically include your web request, Internet Protocol address, browser type, browser language, the date and time of your request, and one or more cookies that may uniquely identify your browser.",
    "A typical log entry for a search for “cars” looks like this:",
    "Unique identifiers",
    "A unique identifier is a string of characters that can be used to uniquely identify a browser, app, or device. Different identifiers vary in how permanent they are, whether they can be reset by users, and how they can be accessed.",
    "Unique identifiers can be used for various purposes, including security and fraud detection, syncing services such as your email inbox, remembering your preferences, and providing personalized advertising. For example, unique identifiers stored in cookies help sites display content in your browser in your preferred language. You can configure your browser to refuse all cookies or to indicate when a cookie is being sent. Learn more abouthow Google uses cookies.",
    "On other platforms besides browsers, unique identifiers are used to recognize a specific device or app on that device. For example, a unique identifier such as the Advertising ID is used to provide relevant advertising on Android devices, and can bemanagedin your device’s settings. Unique identifiers may also be incorporated into a device by its manufacturer (sometimes called a universally unique ID or UUID), such as the IMEI-number of a mobile phone. For example, a device’s unique identifier can be used to customize our service to your device or analyze device issues related to our services.",
    "Additional Context",
    "Activity on Google Services",
    "If you’re signed in to your Google Account and have Web & App Activity turned on, your activity data on Google sites, apps, and services may be saved in your account’s Web & App Activity. Some activity may include information about the general area you were in when using the Google service. When you search for something using a general area, your search will use an area of at least 3 sq km, or expand until the area represents the locations of at least 1,000 people. This helps protect your privacy.",
    "In some cases, areas that you have searched from in the past may be used to estimate a relevant location for your search. For example, if you search for coffee shops while in Chelsea, Google might show results for Chelsea in future searches.",
    "You can view and control your Web & App Activity atMy Activity.",
    "activity on third-party sites and apps that use our services",
    "Websites and apps that integrate Google services like ads and analytics share information with us.",
    "This information is collected regardless of which browser or browser mode you use. For example, although Incognito mode in Chrome can help keep your browsing private from other people who use your device, third party sites and apps that integrate our services may still share information with Google when you visit them.",
    "You canlearn moreabout some of the ways you can control the information that is shared when you visit or interact with sites and apps that use Google services.",
    "ads you’ll find most useful",
    "For example, if you watch videos about baking on YouTube, you may see more ads that relate to baking as you browse the web. We also may use your IP address to determine your approximate location, so that we can serve you ads for a nearby pizza delivery service if you search for “pizza.” Learn moreabout Google adsandwhy you may see particular ads.",
    "advertising and research services on their behalf",
    "For example, merchants may upload data from their loyalty-card programs so that they can include loyalty information in search or shopping results, or better understand the performance of their ad campaigns. We only provide aggregated reports to advertisers that don’t reveal information about individual people.",
    "Android device with Google apps",
    "Android devices with Google apps include devices sold by Google or one of our partners and include phones, cameras, vehicles, wearables, and televisions. These devices use Google Play Services and other pre-installed apps that include services like Gmail, Maps, your phone’s camera and phone dialer, text-to-speech conversion, keyboard input, and security features. Learn more aboutGoogle Play Services.",
    "appropriate safeguards",
    "For example, we may anonymize data, or encrypt data to ensure it can’t be linked to other information about you.Learn more",
    "benefits the public",
    "For example, we process information aboutrequests to remove contentfrom our services to educate the public, facilitate research, and provide transparency about these requests.",
    "customized search results",
    "For example, when you’re signed in to your Google Account and have the Web & App Activity control enabled, you can get more relevant search results that are based on your previous searches and activity from other Google services. You canlearn more here. You may also get customized search results even when you’re signed out. If you don’t want this level of search customization, you cansearch and browse privatelyor turn offsigned-out search personalization.",
    "Customizing our services",
    "For example, we may display a Google Doodle on the Search homepage to celebrate an event specific to your country.",
    "data controller responsible for processing your information",
    "This means the Google affiliate that is responsible for processing your information and for complying with applicable privacy laws.",
    "deliver our services",
    "Examples of how we use your information to deliver our services include:",
    "detect abuse",
    "When we detect spam, malware, illegal content (includingchild sexual abuse and exploitation material), and other forms of abuse on our systems in violation of our policies, we may disable your account or take other appropriate action. In certain circumstances, we may also report the violation to appropriate authorities.",
    "devices",
    "For example, we can use information from your devices to help you decide which device you’d like to use to install an app or view a movie you buy from Google Play. We also use this information to help protect your account.",
    "ensure and improve",
    "For example, we analyze how people interact with advertising to improve the performance of our ads.",
    "ensure our services are working as intended",
    "For example, we continuously monitor our systems to look for problems. And if we find something wrong with a specific feature, reviewing activity information collected before the problem started allows us to fix things more quickly.",
    "Information about things near your device",
    "If you use Google’s Location services on Android, we can improve the performance of apps that rely on your location, like Google Maps. If you use Google’s Location services, your device sends information to Google about its location, sensors (like accelerometer), and nearby cell towers and Wi-Fi access points (like MAC address and signal strength). All these things help to determine your location. You can use your device settings to enable Google Location services.Learn more",
    "legal process, or enforceable governmental request",
    "Like other technology and communications companies, Google regularly receives requests from governments and courts around the world to disclose user data. Respect for the privacy and security of data you store with Google underpins our approach to complying with these legal requests. Our legal team reviews each and every request, regardless of type, and we frequently push back when a request appears to be overly broad or doesn’t follow the correct process. Learn more in ourTransparency Report.",
    "make improvements",
    "For example, we use cookies to analyze how people interact with our services. And that analysis can help us build better products. For example, it may help us discover that it’s taking people too long to complete a certain task or that they have trouble finishing steps at all. We can then redesign that feature and improve the product for everyone.",
    "may link information",
    "Google Analytics relies on first-party cookies, which means the cookies are set by the Google Analytics customer. Using our systems, data generated through Google Analytics can be linked by the Google Analytics customer and by Google to third-party cookies that are related to visits to other websites. For example, an advertiser may want to use its Google Analytics data to create more relevant ads, or to further analyze its traffic.Learn more",
    "our users",
    "For example, to prevent abuse and increase transparency and accountability over our online content moderation practices, Google shares data about requests for removal of content from our services with Lumen, which collects and analyzes these requests to facilitate research to help Internet users understand their rights.Learn more.",
    "partner with Google",
    "There are over 2 million non-Google websites and apps that partner with Google to show ads.Learn more",
    "payment information",
    "For example, if you add a credit card or other payment method to your Google Account, you can use it to buy things across our services, like apps in the Play Store. We may also ask for other information, like a business tax ID, to help process your payment. In some cases, we may also need to verify your identity and may ask you for information to do this.",
    "We may also use payment information to verify that you meet age requirements, if, for example, you enter an incorrect birthday indicating you’re not old enough to have a Google Account.Learn more",
    "personalized ads",
    "You may also see personalized ads based on information from the advertiser. If you shopped on an advertiser's website, for example, they can use that visit information to show you ads.Learn more",
    "phone number",
    "If you add your phone number to your account, it can be used for different purposes across Google services, depending on your settings. For example, your phone number can be used to help you access your account if you forget your password, help people find and connect with you, and make the ads you see more relevant to you.Learn more",
    "Places you label like home and work",
    "You might choose to save places to your Google Account that are important to you, such as your home or your work. If you set your home or work addresses, they can be used to help you do things more easily, such as getting directions or finding results closer to your home or work, and for more useful ads.",
    "You can edit or delete your home or work addresses anytime in yourGoogle Account.",
    "protect against abuse",
    "For example, information about security threats can help us notify you if we think your account has been compromised (at which point we can help you take steps to protect your account).",
    "publicly accessible sources",
    "For example, we may collect information that’s publicly available online or from other public sources to help train Google’s AI models and build products and features like Google Translate, Gemini Apps, and Cloud AI capabilities. Or, if your business’s information appears on a website, we may index and display it on Google services.",
    "rely on cookies to function properly",
    "For example, we use a cookie called ‘lbcs’ that makes it possible for you to open many Google Docs in one browser. Blocking this cookie would prevent Google Docs from working as expected.Learn more",
    "remove",
    "For example, as described above, you canrequest to remove content, including content that may contain your information, from specific Google services, based on applicable law (including data protection law) and our policies.",
    "safety and reliability",
    "Some examples of how we use your information to help keep our services safe and reliable include:",
    "sensitive categories",
    "When showing you personalized ads, we use topics that we think might be of interest to you based on your activity. For example, you may see ads for things like \"Cooking and Recipes\" or \"Air Travel.” We don’t use topics or show personalized ads based on sensitive categories like race, religion, sexual orientation, or health. And werequire the same from advertisersthat use our services.",
    "Sensor data from your device",
    "Your device may have sensors that can be used to better understand your location and movement. For example, an accelerometer can be used to determine your speed and a gyroscope to figure out your direction of travel. Learn more abouthow we use location information.",
    "servers around the world",
    "For example, we operate data centers locatedaround the worldto help keep our products continuously available for users.",
    "services to make and receive calls or send and receive messages",
    "Examples of these services include:",
    "show trends",
    "When lots of people start searching for something, it can provide useful information about particular trends at that time. Google Trends samples Google web searches to estimate the popularity of searches over a certain period of time and shares those results publicly in aggregated terms.Learn more",
    "similar information related to your physical or mental health",
    "specific Google services",
    "For example, you can deleteyour blogfrom Blogger ora Google Site you ownfrom Google Sites. You can also deletereviewsyou’ve left on apps, games, and other content in the Play Store.",
    "specific partners",
    "For example, we allow YouTube creators and advertisers to work with measurement companies to learn about the audience of their YouTube videos or ads, using cookies or similar technologies. Another example is merchants on our shopping pages, who use cookies to understand how many different people see their product listings.Learn moreabout these partners and how they use your information.",
    "synced with your Google Account",
    "Your Chrome browsing history is only saved to your account if you’ve enabled Chrome synchronization with your Google Account.Learn more",
    "the people who matter most to you online",
    "For example, when you type an address in the To, Cc, or Bcc field of an email you're composing, Gmail will suggest addresses based on the people youcontact most frequently.",
    "the public",
    "For example, we process information aboutrequests to remove contentfrom our services under Google's content removal policies or applicable law to assess the request, and to ensure transparency, improve accountability and prevent abuse and fraud in these practices.",
    "third parties",
    "For example, we process your information to report use statistics to rights holders about how their content was used in our services. We may also process your information if people search for your name and we display search results for sites containing publicly available information about you.",
    "use the information we collect across our services",
    "Depending on your available settings, some examples of how we use the information we collect across our services include:",
    "Views and interactions with content and ads",
    "For example, we collect information about views and interactions with ads so we can provide aggregated reports to advertisers, like telling them whether we served their ad on a page and whether the ad was likely seen by a viewer. We may also measure other interactions, such as how you move your mouse over an ad or if you interact with the page on which the ad appears.",
    "Voice and audio information",
    "For example, you can choose whether you want Google to save an audio recording to your Google Account when you interact with Google Search, Assistant, and Maps. When your device detects an audio activation command, like “Hey Google,” Google records your voice and audio plus a few seconds before the activation.Learn more",
    "your activity on other sites and apps",
    "This activity might come from your use of Google services, like from syncing your account with Chrome or your visits to sites and apps that partner with Google. Many websites and apps partner with Google to improve their content and services. For example, a website might use our advertising services (like AdSense) or analytics tools (like Google Analytics), or it might embed other content (such as videos from YouTube). These services may share information about your activity with Google and, depending on youraccount settingsand the products in use (for instance, when a partner uses Google Analytics in conjunction with our advertising services), this data may be associated with your personal information.",
    "Learn moreabout how Google uses data when you use our partners' sites or apps."
  ],
  "https://developers.google.com/youtube/youtube_subscribe_button": [
    "Configure a Button",
    "The tool below lets you configure an embedded subscription button. You can set the button's display options, preview the button, and copy the code needed to insert that button on your page.",
    "Except as otherwise noted, the content of this page is licensed under theCreative Commons Attribution 4.0 License, and code samples are licensed under theApache 2.0 License. For details, see theGoogle Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates.",
    "Last updated 2022-11-04 UTC.",
    "Tools",
    "Issue Tracker",
    "Product Info"
  ],
  "https://issuetracker.google.com/issues/new?component=186600&template=874803": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://research.youtube/": [
    "YouTube Researcher Program",
    "YouTube is equipping researchers from around the world with data,\n              tools, and support to advance the publicâ\u0080\u0099s understanding of our\n              platform and its impact.",
    "About the program",
    "Eligible researchers from diverse disciplines can apply to use\n              YouTube data to study a variety of topics. Weâ\u0080\u0099re starting this\n              program offering participants the following:",
    "Scaled access to YouTubeâ\u0080\u0099s public data corpus with as much quota\n                as required for their research",
    "Opportunity to derive insights from global YouTube data",
    "Support and technical guidance from YouTube",
    "We welcome feedback from participating researchers on the program\n              as we continue to build out more products and tools over time.",
    "How it works",
    "Learn more about the process, what data is available, and find\n              answers to your questions.",
    "Program policies",
    "Confirm your eligibility and learn more about the program policies\n              before you apply.",
    "Ready to join the program?",
    "For press inquiries, please contactpress@google.com"
  ],
  "https://developer.chrome.com/home": [
    "A Powerful Web.Made Easier.",
    "Thanks for tuning in to Google I/O 2024",
    "Participate in our built-in AI experiment",
    "What's New in DevTools (Chrome 129)",
    "Get Inspired",
    "Learn how modern web technology can help you succeed",
    "Features, tools and programs to make developers successful on the web.",
    "Powerful platform capabilities",
    "Solutions for quality experiences",
    "Productivity made easier",
    "Open by design",
    "Always updating",
    "Chrome 130 beta",
    "Chrome 129 stable",
    "Docs",
    "Chrome DevTools",
    "Extensions",
    "Chrome Web Store",
    "Web Platform",
    "Connect with the team",
    "Chrome for Developers on X",
    "Chrome for Developers on YouTube",
    "Chrome for Developers on LinkedIn",
    "Contribute",
    "Related content",
    "Follow"
  ],
  "https://developers.google.com/terms/site-terms": [
    "Google Developers Site Terms of Service",
    "Important:This Terms of Service applies to the developers.google.com website. Please click the \"Terms\" link found in the sidebar of each API or other product or service for its specific Terms of Service.",
    "Google Developers Additional Terms",
    "By using Google Developers (the \"Service\"), you agree to be bound by our Google Terms of Service located athttp://www.google.com/accounts/TOSas well as these additional terms. Google may change these terms from time to time and post any modified terms athttp://developers.google.com/site-terms. You understand and agree that if you use the Service after the date on which these terms have changed, Google will treat your use as acceptance of the updated terms.",
    "Your feedback and suggestions",
    "By submitting feedback and suggestions, you grant a non-exclusive, perpetual, irrevocable, and royalty-free license to any intellectual property rights you may have in your feedback and suggestions to Google to use to improve any Google products or services. You acknowledge that submission of feedback and suggestions is voluntarily and Google may consider or is developing technology that is the same or similar to your feedback or suggestions.",
    "Except as otherwise noted, the content of this page is licensed under theCreative Commons Attribution 4.0 License, and code samples are licensed under theApache 2.0 License. For details, see theGoogle Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates.",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://blog.youtube": [
    "Inside YouTube",
    "Meet Danielle Darby, a Product Manager for Dream Screen",
    "Inside YouTube",
    "Meet Michael Beckmann, the man finding more ways to get creators paid",
    "News and Events",
    "Made On YouTube: Photos and recaps",
    "News and Events",
    "A new YouTube Communities experience for fans, by fans",
    "Back to school with BookTube",
    "Kick off a year of learning with YouTube's literary community",
    "\"BOOOKS\" on the Road: How one creator made her bookstore dreams come true",
    "This summer, Ariel turned her passion for reading into a mobile bookstore.",
    "How to start a book club on YouTube",
    "The ultimate BookTube reading list",
    "Learning for the love of it: Taha Khan on Answer in Progress and the power of curiosity",
    "And now, a word from our creators",
    "Between Two Creators: Steven He x Jeenie Weenie",
    "Between Two Creators: Steven He x Jeenie Weenie",
    "Made On YouTube '23 Event Recap",
    "Made On YouTube '23 Event Recap",
    "YouTube presents.... In a Pickle: Haley Kalil",
    "YouTube presents.... In a Pickle: Haley Kalil",
    "How Sydney and Taty blew up on YouTube! — Between Two Creators",
    "How Sydney and Taty blew up on YouTube! — Between Two Creators",
    "When Ryan met… BEN — Between Two Creators",
    "When Ryan met… BEN — Between Two Creators",
    "15",
    "All the Latest",
    "Want more from The YouTube Blog? Join our newsletter!",
    "Explore the latest company news, creator and artist profiles, culture and trends analyses, and behind-the-scenes insights on the YouTube Official Blog.",
    "Our Channels",
    "X (Twitter)",
    "About YouTube",
    "YouTube Products",
    "For Business",
    "For Creators",
    "Our Commitments",
    "Join our newsletter to receive the latest news, trends, and features straight to your inbox!",
    "Your information will be used in accordance with Google's privacy policy. You may opt out at any time.",
    "Let's get contenting! You'll receive a confirmation soon."
  ],
  "https://developer.android.com": [
    "Build adaptive apps with new Compose APIs, now stable!",
    "Android 15 is released to AOSP",
    "Gemini in Android Studio",
    "Developer centers",
    "Social & messaging apps",
    "Camera & media apps",
    "Health & fitness apps",
    "Platform Updates",
    "Tools Updates",
    "Explore more",
    "Developer Guides",
    "Sample Code",
    "Quality guidelines",
    "Distribute Your App",
    "Latest news",
    "Latest videos",
    "More Android",
    "Discover",
    "Android Devices",
    "Releases",
    "Documentation and Downloads",
    "Support"
  ],
  "https://cloud.google.com": [
    "Get $300 in free creditsand free usage of 20+ products",
    "The new way to cloud starts here",
    "The new way to cloud starts here",
    "Build with generative AI, deploy apps fast, and analyze data in seconds—all with Google-grade security.",
    "What's new in AI",
    "Developers",
    "Business leaders",
    "DIGITAL EVENT",
    "Join us at Gemini at Work to learn about the latest AI advancements, happening Sept. 24",
    "NEW PRODUCT",
    "Try Gemini 1.5 modelsto build with up to a 2M token context window",
    "DIGITAL EVENT",
    "Register now for Google Cloud Startup Summit, happening Oct. 8",
    "INNOVATORS PLUS",
    "Go pro on Google Cloud AI with $1,500+ in developer benefits",
    "PRECONFIGURED SOLUTIONS",
    "Deploy interactive solutions recommended by Google Cloud experts",
    "Developer offer",
    "Earn a $1,000 credit for new Vertex AI Agent Builder customers",
    "REPORT",
    "Google Cloud named a leader in 2024 The Forrester Wave™ for AI foundation models for language",
    "BLOG",
    "Learn about the top AI courses from low-code to advanced use cases",
    "SMALL AND MEDIUM BUSINESSES",
    "Learn how SMBs drive growth, simplify operations, and mitigate risk with Google Cloud",
    "What's new in AI",
    "DIGITAL EVENT",
    "Join us at Gemini at Work to learn about the latest AI advancements, happening Sept. 24",
    "NEW PRODUCT",
    "Try Gemini 1.5 modelsto build with up to a 2M token context window",
    "DIGITAL EVENT",
    "Register now for Google Cloud Startup Summit, happening Oct. 8",
    "Developers",
    "INNOVATORS PLUS",
    "Go pro on Google Cloud AI with $1,500+ in developer benefits",
    "PRECONFIGURED SOLUTIONS",
    "Deploy interactive solutions recommended by Google Cloud experts",
    "Developer offer",
    "Earn a $1,000 credit for new Vertex AI Agent Builder customers",
    "Business leaders",
    "REPORT",
    "Google Cloud named a leader in 2024 The Forrester Wave™ for AI foundation models for language",
    "BLOG",
    "Learn about the top AI courses from low-code to advanced use cases",
    "SMALL AND MEDIUM BUSINESSES",
    "Learn how SMBs drive growth, simplify operations, and mitigate risk with Google Cloud",
    "Build with the cloud platformdesigned for developers and AI",
    "Build with the cloud platformdesigned for developers and AI",
    "Try Google Cloud with free usage of over 20 products, plus new customers get $300 in free credits on signup.",
    "Try Google Cloud with free usage of over 20 products, plus new customers get $300 in free credits on signup.",
    "AI and machine learning",
    "Build AI agents and generative AI applications with ourfully managed AI platform, Vertex AI—enhanced by Gemini, over 130 foundation models, andecosystem of AI partners",
    "Improve customer service with Contact Center AI’svirtual agentsand conversational AI products likeSpeech-to-Text",
    "GetAI-powered code generation, recommendations, and completionfrom Gemini Code Assist",
    "Explore our ecosystem ofGemini products for businesses and developersto help you get the most out of Google AI",
    "Compute",
    "Create and run customizable virtual machines withCompute Engine. For scale-out workloads,Tau VMsoffer 42% better price performance over comparable cloud offerings.",
    "Automatically deploy, scale, and manage containers withGoogle Kubernetes EngineorCloud Run",
    "Migrate your apps at your own pace bymoving directly to virtual machinesor automaticallymodernizing to containers—without rewriting code",
    "Storage",
    "Store any type of data, any amount of data, and retrieve it as often as you’d like withobject storage",
    "Transfer data with online and offline transfer solutions, includingStorage Transfer ServiceandTransfer Appliance",
    "Persistent Disk block storageis fully integrated with Google Cloud products like Compute Engine and GKE",
    "Databases",
    "Reduce MySQL, PostgreSQL, and SQL Server costs withCloud SQL, a fully-managed database service",
    "Scale your enterprise workloads and build generative AI apps withAlloyDB for PostgreSQL",
    "Get high performance, a 99.999% availability SLA, and virtually unlimited scale withSpanner",
    "Data analytics",
    "Runanalytics at scalewith 26%–34% lower three-year TCO on BigQuery compared to cloud data warehouse alternatives",
    "Ingest, process, andanalyze event streamsin real time to make data more useful",
    "Reveal the true power of your data and bring clarity to every situation withLookerand Google Cloud",
    "Networking",
    "Helpprotectyour applications and websites against denial of service and web attacks with Cloud Armor",
    "Quickly and securely scaleweb and video content deliverywith Cloud CDN",
    "Explorehybrid connectivity options, including VPN, peering, and enterprise support",
    "Developer tools",
    "Write, debug, and runcloud-native applications, locally or in the cloud—quickly and easily with Cloud Code",
    "WithCloud Build, continuously build, test, and deploy software across all languages and in multiple environments",
    "Deploypre-built solution templates—with an active Google Cloud account—includingdynamic websites,load balanced VMs, andthree tier web apps.",
    "Security",
    "Understand threat actors and potential attack vectors withGoogle Threat IntelligenceandMandiant Consulting Services",
    "Detect, investigate, and respond to threats faster withGoogle Security Operations",
    "Protect your workloads and meet digital sovereignty requirements with our full suite ofsecurity products and services",
    "Build and scale generative AI apps withVertex AI and Gemini Code Assist",
    "Build and scale generative AI apps withVertex AI and Gemini Code Assist",
    "UseVertex AIto deploy and manage AI applications andGemini Code Assistfor task and code assistance.",
    "UseVertex AIto deploy and manage AI applications andGemini Code Assistfor task and code assistance.",
    "Build, tune, and deploy foundation models with Vertex AI",
    "Build AI-powered apps in Vertex AI with LangChain",
    "Use Gemini to streamline software development lifecycle",
    "Develop an app with Gemini code assistance",
    "AI innovationhappens on Google Cloud",
    "AI innovationhappens on Google Cloud",
    "Best Buyhelps their customer service agents generate summaries for every customer interaction withContact Center AI",
    "MLBcompares live plays with its Statcast dataset in real time and shares fresh player insights usingVertex AIandBigQuery",
    "Estée LauderusesVertex AI and Geminito simplify internal processes, including language translations and writing ad copy",
    "Hackensack Meridian HealthusesVertex AIto build and train AI models to help with risk prediction and disease detection",
    "The Home Depotusescomputer visionto help store associates manage inventory and connect customers to products",
    "Wendy’sreimagined drive-thru takes and displays custom orders with help fromgenerative AI",
    "FOX SportsusesVertex AIto store, organize, and surface game highlights for sports broadcasts",
    "GE AppliancesusesGeminito help customers meal prep, save offline recipes, and keep their appliances in tip-top shape",
    "Ginkgo Bioworkspioneers new LLMs for biological engineering apps withVertex AI",
    "ZSLusesGoogle Cloud data and AIto process acoustic data rapidly and identify wildlife species along railway lines",
    "WayfairusesGemini Code Assistto help devs set up environments faster and increase code testing coverage",
    "Resistant AIusesDocument AIto help prevent fraud from infiltrating document automation workflows",
    "GitLabhelps customers ship software faster and accelerate dev productivity withgenerative AI",
    "Try Google Cloud with free usage of over 20 products, plus new customers get$300 in free creditson signup.",
    "Try Google Cloud with free usage of over 20 products, plus new customers get$300 in free creditson signup.",
    "Accelerate your startup’s AI journey with guidance from leading VCs, discussions on applying AI, and more at the Google Cloud Startup Summit, happening Oct. 8.",
    "Accelerate your startup’s AI journey with guidance from leading VCs, discussions on applying AI, and more at the Google Cloud Startup Summit, happening Oct. 8.",
    "Solve your business problems with ourindustry solutions",
    "Solve your business problems with ourindustry solutions",
    "From improving retailproduct discoveryto detectingbank fraud, our industry solutions tackle your biggest challenges.",
    "Best Buy uses Google Cloud generative AI to power its virtual assistants, freeing up their customer care agents to troubleshoot product issues, change order delivery and schedules, and manage subscriptions.Discover what you can do with our retail solutions.",
    "Cloud computing, ready for business",
    "Whether you’re migrating or already in the cloud, we’ll help you modernize and digitally transform your business.",
    "Whether you’re migrating or already in the cloud, we’ll help you modernize and digitally transform your business.",
    "Talk to us",
    "Avoid vendor lock-in and speed up development with Google Cloud’s commitment toopen source, hybrid, and multicloud.",
    "Give anyone on your team access to business insights withadvanced machine learning and analytics.",
    "Help defend your data and appsagainst threats and fraudulent activitywith the same security technology Google uses.",
    "Integrate video calling, email, chat, and documentcollaborationin one place.",
    "Let’s start buildingyour tomorrow, today",
    "Let’s start buildingyour tomorrow, today",
    "Why Google",
    "Products and pricing",
    "Solutions",
    "Resources",
    "Engage"
  ],
  "https://ai.google.dev/": [
    "AI for every developer",
    "Build with state-of-the-art generative AI models and tools to make AI helpful for everyone",
    "Build with theGeminiAPI",
    "Easily integrate Google’s largest and most capable AI model to your apps",
    "Develop withGeminiassistance",
    "Innovate with Gemma open models",
    "Accelerate responsible AI development with unprecedented flexibility and access to lightweight, customizable models",
    "Join the community",
    "Tap into the power of our community forum. Get answers, build together, and be part of the conversation."
  ],
  "https://github.com/youtube/api-samples": [
    "Navigation Menu",
    "Search code, repositories, users, issues, pull requests...",
    "Provide feedback",
    "We read every piece of feedback, and take your input very seriously.",
    "Saved searches",
    "Use saved searches to filter your results more quickly",
    "To see all available qualifiers, see ourdocumentation.",
    "Code samples for YouTube APIs, including the YouTube Data API, YouTube Analytics API, and YouTube Live Streaming API. The repo contains language-specific directories that contain the samples.",
    "youtube/api-samples",
    "Folders and files",
    "Latest commit",
    "History",
    "Repository files navigation",
    "api-samples",
    "Code samples for YouTube APIs, including the YouTube Data API, YouTube Analytics API, and YouTube Live Streaming API. The repo contains language-specific directories that contain the samples.",
    "About",
    "Code samples for YouTube APIs, including the YouTube Data API, YouTube Analytics API, and YouTube Live Streaming API. The repo contains language-specific directories that contain the samples.",
    "Resources",
    "Stars",
    "Watchers",
    "Forks",
    "Releases",
    "Packages0",
    "Contributors15",
    "Languages",
    "Footer",
    "Footer navigation"
  ],
  "https://www.drkoncerthuset.dk/kalender/2024/luisi-skrjabins-2-2/": [
    "DR's Kor og Orkestre",
    "Mad og drikke",
    "Rundvisninger",
    "Praktisk information",
    "Lej DR Koncerthuset",
    "Sal og Studier",
    "Kontakt",
    "Luisi & Skrjabins 2.",
    "Koncertsalen",
    "24. oktober 2024 KL. 19.30",
    "Luisi & Skrjabins 2.",
    "Koncertsalen",
    "24. oktober 2024 KL. 19.30",
    "flere datoer",
    "om eventen",
    "Mozarts formfuldendte elegance i ‘Eine kleine Nachtmusik’ åbner denne koncert sammen med to af hans virtuose og gribende arier. Så tager Skrjabins Symfoni nr. 2 over, med sin overjordiske ekstase og farverige orkesterkunst, hvor de kraftfulde højdepunkter bogstaveligt talt står i kø.",
    "View this event in English",
    "Efter en række prisvindende og anmelderroste indspilninger af Nielsens symfonier og koncerter har DR Symfoniorkestret og chefdirigent Fabio Luisi taget hul på et nyt indspilningsprojekt for det legendariske pladeselskab Deutsche Grammophon. Denne gang er turen kommet til den russiske komponist Alexander Skrjabins visionære orkesterværker fra begyndelsen af 1900-tallet.",
    "I sin musik søger Skrjabin konstant efter et musikalsk udtryk, der kan favne hele universet og opnå nye stadier af menneskelig erfaring og overjordisk indsigt. I hans symfoni nr. 2 kan man høre himmelstormende klimakser og en nærmest religiøs tilbedelse af kunst. Det er fantastisk musik i enhver forstand af ordet, og det lyder fantastisk godt.",
    "På programmet står også musik af Mozart. Eine kleine Nachtmusik er blandt Mozarts mest berømte og elskede værker, en mesterlig udstilling af wiener-elegance. Derudover kan man denne aften se frem til en anden og lige så funklende side af den østrigske mester – to arier sunget af den armensk-jødiske mezzosopran Maria Schellenberg.",
    "Program",
    "Program",
    "Mozart",
    "Eine kleine Nachtmusik\nOmbra felice\nParto inerme, e non pavento",
    "Skrjabin",
    "Symfoni nr. 2",
    "Kunstnere - Medvirkende",
    "Fabio Luisi",
    "Dirigent",
    "",
    "Maria Schellenberg",
    "Mezzosopran",
    "",
    "DR Symfoniorkestret",
    "Orkester",
    "",
    "Rabatmuligheder",
    "Koncertsalen",
    "24. oktober 2024 KL. 19.30",
    "flere datoer",
    "tilkøbsmuligheder",
    "Restaurant KLANG",
    "Lette anretninger",
    "Bag om Koncerten",
    "Rabatmuligheder",
    "Restaurant KLANG",
    "Lette anretninger",
    "Bag om Koncerten",
    "Restaurant KLANG",
    "Den gastronomiske profil for Restaurant KLANG i DR Koncerthuset tager afsæt i Meyers' velkendte univers, der med Claus Meyer i front gennem mere end 30 år har sat fokus på smag, kvalitet, lokale råvarer, økologi, dyrevelfærd og bæredygtighed. Vi tilpasser løbende vores menu for at sikre at den altid komplementerer stemningen i huset og den aktuelle koncert eller begivenhed.",
    "Vælg din forestilling",
    "DR Symfoniorkestret",
    "Luisi & Skrjabins 2.",
    "",
    "Koncertsalen",
    "tor. 24. oktober 2024 KL. 19.30",
    "Kl. 17.00: 3-retters menu",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "Kl. 17.00: For- & hovedret",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "Kl. 17.00: Vegetar, 3-retters menu",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.00: Vegetar, For- og Hovedret",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: 3-retters menu",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: For- & hovedret",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: Vegetar, 3-retters menu",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: Vegetar, For- og Hovedret",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "",
    "Kl. 18.00: 3-retters menu",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "kl. 18.00: For- & hovedret",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 18.00: Vegetar, 3-retters menu",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "",
    "",
    "Kl. 18.00: Vegetar, For- og Hovedret",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "DR Symfoniorkestret",
    "Luisi & Skrjabins 2.",
    "",
    "Koncertsalen",
    "fre. 25. oktober 2024 KL. 19.30",
    "Kl. 17.00: 3-retters menu",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "Kl. 17.00: For- & hovedret",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "Kl. 17.00: Vegetar, 3-retters menu",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.00: Vegetar, For- og Hovedret",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: 3-retters menu",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: For- & hovedret",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: Vegetar, 3-retters menu",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 17.30: Vegetar, For- og Hovedret",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "",
    "Kl. 18.00: 3-retters menu",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "kl. 18.00: For- & hovedret",
    "",
    "",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "Kl. 18.00: Vegetar, 3-retters menu",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "",
    "",
    "",
    "Kl. 18.00: Vegetar, For- og Hovedret",
    "",
    "",
    "Find vores menu her:www.drkoncerthuset.dk/restaurant",
    "Vegetarisk skal vælges på forhåndOBS! \r\n\r\nHar du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til \r\n\r\ndrkoncerthuset@dr.dk",
    "",
    "",
    "Lette anretninger",
    "I DR Koncerthusets foyer kan du nyde småretter og tilhørende vine i hyggelige omgivelser, der sætter scenen for en helstøbt aften. Vi tilbyder bl.a. 'Alt på ét bræt', fordi du får serveret småretterne samlet på et tapasbræt. Til udvalgte koncerter vil det være muligt at bestille Meyers sandwichs.",
    "Vælg din forestilling",
    "DR Symfoniorkestret",
    "Luisi & Skrjabins 2.",
    "",
    "Koncertsalen",
    "tor. 24. oktober 2024 KL. 19.30",
    "Alt på ét bræt",
    "",
    "",
    "Udlevering starter 2 timer før annonceret koncertstart, hvor du kan afhente din bestilling i vores bar.",
    "Bemærk!Din lette anretning skal være afhentet senest 30 minutter inden koncerten starter.",
    "Du bestemmer selv hvornår du ønsker at ankomme og spise indenfor dette tidsrum.",
    "Vegetarisk skal vælges på forhåndOBS! Har du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til drkoncerthuset@dr.dk",
    "",
    "",
    "Vegetar, Alt på ét bræt",
    "",
    "Udlevering starter 2 timer før annonceret koncertstart, hvor du kan afhente din bestilling i vores bar.",
    "Bemærk!Din lette anretning skal være afhentet senest 30 minutter inden koncerten starter.",
    "Du bestemmer selv hvornår du ønsker at ankomme og spise indenfor dette tidsrum.",
    "Vegetarisk skal vælges på forhåndOBS! Har du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til drkoncerthuset@dr.dk",
    "",
    "",
    "DR Symfoniorkestret",
    "Luisi & Skrjabins 2.",
    "",
    "Koncertsalen",
    "fre. 25. oktober 2024 KL. 19.30",
    "Alt på ét bræt",
    "",
    "",
    "Udlevering starter 2 timer før annonceret koncertstart, hvor du kan afhente din bestilling i vores bar.",
    "Bemærk!Din lette anretning skal være afhentet senest 30 minutter inden koncerten starter.",
    "Du bestemmer selv hvornår du ønsker at ankomme og spise indenfor dette tidsrum.",
    "Vegetarisk skal vælges på forhåndOBS! Har du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til drkoncerthuset@dr.dk",
    "",
    "",
    "Vegetar, Alt på ét bræt",
    "",
    "Udlevering starter 2 timer før annonceret koncertstart, hvor du kan afhente din bestilling i vores bar.",
    "Bemærk!Din lette anretning skal være afhentet senest 30 minutter inden koncerten starter.",
    "Du bestemmer selv hvornår du ønsker at ankomme og spise indenfor dette tidsrum.",
    "Vegetarisk skal vælges på forhåndOBS! Har du ændringer eller oplysninger om allergener til din bestilling skal dette meldes ind mandag-fredag inden for Billetkontorets åbningstid, senest 2 hverdage forud for dit besøg. Ring 35 20 62 62 eller skriv til drkoncerthuset@dr.dk",
    "",
    "",
    "Bag om Koncerten",
    "DR Koncerthuset afvikler omkring 300 forskellige arrangementer om året fordelt på alle aldersgrupper og genre, og nu kan du få lov til at få et unikt indblik i, hvad der foregår foran, på og bag scenen inden udvalgte koncerter med DR's Kor og Orkestre.",
    "Vælg din forestilling",
    "DR Symfoniorkestret",
    "Luisi & Skrjabins 2.",
    "",
    "Koncertsalen",
    "tor. 24. oktober 2024 KL. 19.30",
    "Bag om Koncerten (Starttid: 1½ time før koncert)",
    "",
    "DR Koncerthuset afvikler omkring 300 forskellige arrangementer om året fordelt på alle aldersgrupper og genre, og nu kan du få lov til at få et unikt indblik i, hvad der foregår foran, på og bag scenen inden udvalgte koncerter med DR's Kor og Orkestre.",
    "Rundvisningen starter 1½ time før koncerten og varer omkring 30 min. I slutter af med en drink i foyeren inden koncerten starter.",
    "OBS! \r\n\r\nDu skal have en gyldig billet til koncerten som er i forbindelse med rundvisningen for at kunne deltage på rundvisningen.",
    "",
    "DR Symfoniorkestret",
    "Luisi & Skrjabins 2.",
    "",
    "Koncertsalen",
    "fre. 25. oktober 2024 KL. 19.30",
    "Bag om Koncerten (Starttid: 1½ time før koncert)",
    "",
    "DR Koncerthuset afvikler omkring 300 forskellige arrangementer om året fordelt på alle aldersgrupper og genre, og nu kan du få lov til at få et unikt indblik i, hvad der foregår foran, på og bag scenen inden udvalgte koncerter med DR's Kor og Orkestre.",
    "Rundvisningen starter 1½ time før koncerten og varer omkring 30 min. I slutter af med en drink i foyeren inden koncerten starter.",
    "OBS! \r\n\r\nDu skal have en gyldig billet til koncerten som er i forbindelse med rundvisningen for at kunne deltage på rundvisningen.",
    "",
    "tilkøbsmuligheder",
    "Restaurant KLANG",
    "Lette anretninger",
    "Bag om Koncerten",
    "PRAKTISK INFORMATION",
    "Praktisk info før dit arrangement",
    "Vi har samlet de vigtigste informationer som er gode at vide før, under og efter dit besøg i DR Koncerthuset.",
    "Mød Musikken",
    "Mød Musikken varer ca. 25 minutter, er gratis og starter altid en time før koncerten.",
    "Parkering og transport",
    "Læs om transport til DR Koncerthuset, samt parkeringspladser- og takser.",
    "Tilgængelighed",
    "Information vedr. tilgængelighed i- og omkring DR Koncerthuset",
    "Rabat for unge under 30 år - 50%",
    "Børn og unge under 30 år får 50% rabat på de fleste koncerter med DRs kor og orkestre.",
    "Grupperabat",
    "Du kan få 10% rabat på de fleste koncerter med DRs kor og orkestre ved køb af minimum 25 billetter.",
    "Koncertsalen",
    "Koncertsalen er DR Koncerthusets mest imponerende sal – med 1.800 røde plyssæder.",
    "Nyheder fra DR Koncerthuset",
    "Hold dig opdateret om de seneste arrangementer.",
    "",
    "Praktisk info før dit arrangement",
    "Mød Musikken",
    "Parkering og transport",
    "Tilgængelighed",
    "Rabat for unge under 30 år - 50%",
    "Grupperabat",
    "Nyheder fra DR Koncerthuset",
    "Praktisk info før dit arrangement",
    "Undgå print af billetter",
    "Du kan fremvise din billet på din smartphone. For at vi let og hurtigt kan scanne din billet, bedes du skrue op for lysstyrken på displayet på din smartphone inden du stiller dig i kø.",
    "Garderobe/tasker",
    "Garderobe til både tasker og jakker i DR Koncerthuset er gratis. Der findes bemandet garderobe med begrænset kapacitet, samt en ubemandet garderobe. Overtøj og større tasker må af sikkerhedsmæssige hensyn ikke medbringes i Koncertsalen eller studierne og skal derfor afleveres i garderoben.",
    "Toiletter/Handicaptoiletter",
    "Toiletter findes i Koncerthusets foyer niveau 1 (hoved foyeren) og i niveau minus 1 (ved Studie 2, 3 og 4). Der er yderligere toiletter på niveau 3, ved indgangen til parterre, samt niveau 4 ved indgangen til orkester A-B.",
    "Tv-optagelser",
    "Der kan forekomme tv-optagelser/transmissioner af enkelte arrangementer. Vi bestræber os naturligvis på at minimere eventuelle gener for vores publikum i forbindelse med disse tv-optagelser. Såfremt et arrangement optages til tv, vil det fremgå af din billet eller ved information via e-mail eller SMS forud for arrangementet.",
    "Mad og drikke",
    "Det er ikke tilladt at  medbringe og indtage medbragt mad & drikke.",
    "Barerne i foyeren sælger drikkevarer og snacks. Hvis der er pause i dit arrangement vil barerne også være åbne.",
    "Det er også muligt at forudbestille tapas, eller booke middag i DR Koncerthusets restaurant.",
    "Læs mere om tapas i DR Koncerthuset",
    "Læs mere om Koncerthusets Restaurant",
    "Rygning",
    "Rygning er ikke tilladt indendørs i DR Koncerthuset.",
    "Hittegods - hvis du glemmer en ejendel efter et arrangement",
    "Alle glemte ejendele afleveres i receptionen i DR Byen efter Koncerthuset er lukket. Spørgsmål vedr. glemte ejendele, skal derfor ske ved direkte henvendelse til DR's hovedreception på tlf.: 35202640",
    "Mød Musikken",
    "Som gæst til DR Symfoniorkestrets Torsdags-, Fredags- og Lørdags koncerter i Koncertsalen kan du blive klædt godt på, inden musikken begynder.",
    "Før hver koncert vil en P2-vært guide publikum gennem aftenens program sammen med en aktuel musiker, solist, dirigent eller komponist.",
    "Mød Musikken varer ca. 25 minutter, er gratis og starter altid en time før koncerten.",
    "Parkering og transport",
    "DR Koncerthuset ligger på Ørestads Boulevard 13, København S, og der er gode transportmuligheder.",
    "DR har indgået et samarbejde med Q-Park, som står for opsynet med P-pladsen ved metroen.",
    "Du kanherse et kort over området.",
    "OBS! Parkering skal forudbetales.",
    "Det vil sige at du i billetautomaten køber parkering til et bestemt tidsrum.",
    "Parkering kan forudbetales i billetautomaterne på parkeringspladsen ved indtastning af bilens registreringsnummer. Alternativt kan parkering betales gennem EasyParks app.",
    "NB: Du kan parkere gratis i afmærkede båse i op til 15 minutter ved af- og pålæsning. Husk P-skiven.",
    "Priserne er:Op til 1 time 20 kr.Op til 2 timer 40 kr.Op til 13 timer 60 kr.",
    "EasyPark App",
    "Det er muligt at betale og forlænge din parkering med EasyParks app. Områdekoden til DR Koncerthusets parkering er 3491.Ved at benytte EasyParks app til betaling af parkering opkræves et tillæg på 15% af den samlede parkeringspris.",
    "Handicapparkering",
    "På parkeringsarealet findes ni gratis handicapparkeringspladser - husk synligt Handicapparkeringskort i forruden. Det er muligt at parkere bilen gratis på alle afmærkede parkeringspladser, hvis der ikke er flere ledige handicapparkeringspladser.",
    "Hybrid- og elbiler",
    "Der er et begrænset antal p-pladser med ladestandere. Du har mulighed for at lade din bil, mens du er til koncert i DR Koncerthuset. Vær dog opmærksom på, at der er begrænset ladetid på max fire timer og du skal derfor stille din P-skive. Al parkering med el-bil eller plugin-hybrid ved DR Koncerthuset, kræver betaling af P-afgift ved betalings-standerne på stedet.",
    "Metro og bus",
    "Der er metroafgange til og fra DR Byen-metrostation ca. hvert 5. min. Metroen kører hele døgnet alle ugens dage (den grønne linje M1 mod Vestamager).Buslinje 33, 35, 77 og 78 har alle stoppested ved DR Byen på Amager Fælledvej. Herfra tager det kun få minutter at gå til DR Koncerthuset.",
    "Cykler",
    "Cykler kan parkeres under Metrobanen. Det er ikke tilladt at parkere sin cykel op ad DR Koncerthuset, da det kan blokere for flugtveje.",
    "Tilgængelighed",
    "Ved DR Koncerthuset forefindes 9 almindelige handicapparkeringspladser, samt seks større afsætningspladser, der reelt er p-pladser. Disse er placeret under metrobanen, vest for DR Koncerthuset, ca. 75 m. fra indgangen til Koncerthuset. Der findes yderligere 5 p-pladser til kassebiler og 1 p-plads til en liftbus. Desuden er der handicapparkeringspladser ved DR Byens reception langs Emil Holms Kanal (modsat DR Koncerthuset).",
    "For synshæmmede er der etableret en ganglinje fra metrostationen til DR Byen.",
    "Der er 16 kørestolspladser i Koncertsalen. De befinder sig bagest på Parterre, 1. Balkon og Orkester A. I Studie 2 er der 4-6 kørestolspladser, afhængig af stoleopsætning. I Studie 3 og 4 er der 2-4 kørestolspladser, afhængig af stoleopsætning.",
    "Kørestolsbrugere, blinde eller andre med et ledsagerkort fra Danske Handicaporganisationer, skal bestille billet gennem DR Koncerthusets Kundecenter og har mulighed for at tage en ledsager med uden ekstrabetaling. Ledsagerkortet skal vises/fremsendes til DR Koncerthusets Kundecenter ved billetbestilling.",
    "DR Koncerthusets elevatorer kører til alle etager og der forefindes handicaptoiletter ved alle toiletgrupper.",
    "Der er etableret teleslynge i alle DR Koncerthusets sale samt i hovedfoyeren.",
    "Rabat for unge under 30 år - 50%",
    "Du kan se om en koncert har U30 rabat ved at vælge et sæde i salsplanen. Herefter kan du se hvilke billettyper/priser der kan vælges til den pågældende koncert. Husk at legitimation skal forevises på forlangende ved indgangen. Rabatter kan ikke kombineres med øvrige tilbud eller rabatter.",
    "Grupperabat",
    "Du kan få 10% rabat på de fleste koncerter med DRs kor og orkestre ved køb af minimum 25 billetter. Billetter bestilles via gruppesalg@dr.dk. Rabatter kan ikke kombineres med øvrige tilbud eller rabatter.",
    "Nyheder fra DR Koncerthuset",
    "Vil du gerne holde dig opdateret om, hvad der sker i DR Koncerthuset og med ensemblerne? Så kan du tilmelde dig vores nyhederher.",
    "Relaterede arrangementer",
    "Rabatmuligheder",
    "Pluk & Mix",
    "Grupperabat",
    "T3",
    "Pluk & Mix",
    "Grupperabat",
    "T3",
    "Nyhedsbrev",
    "Billetkontor",
    "DR Koncerthuset(Foyeren)\nØrestads Boulevard 13\n2300 København S.\nTlf.: 3520 6262drkoncerthuset@dr.dkSe Billetkontorets åbningstiderSe DR Koncerthusets smiley-rapporterLæs om persondata- og cookiepolitikLæs om salgs- og leveringsbetingelser",
    ""
  ],
  "https://www.findsmiley.dk/575074": [
    "Teknisk status",
    "23. september 2024",
    "",
    "DR Koncerthuset",
    "Ørestads Boulevard 13",
    "2300 København S",
    "11-04-24",
    "12-12-23",
    "13-11-23",
    "18-03-22",
    "Download Smileymærke",
    "Detail",
    "Restauranter, pizzeriaer, kantiner m.m.",
    "DD.56.10.99          Serveringsvirksomhed - Restauranter m.v.",
    "575074",
    "62786515",
    "1008875630",
    "Tilføj smiley til dit website",
    "Abonner på denne virksomhed",
    "Fødevarestyrelsen",
    "Adresse",
    "​Stationsparken 31-332600 GlostrupTlf.:72 27 69 00Mail:KontaktformularEAN: 5798000986008CVR: 62534516",
    "Åbningstider",
    "​Mandag-torsdag: 9.00-16.00Fredag: 9.00-15.00",
    "Ofte besøgte sider",
    "Startpakke til nye fødevarevirksomheder​Egenkontrol og risikoanalyseHygiejne og indretningKlag over virksomhed​Tilbagekaldte fødevarer",
    "Følg os",
    "FacebookTwitterNyhedsbrevRSS nyheder",
    "Ministeriet for Fødevarer, Landbrug og Fiskeri",
    "Adresse",
    "​Slotsholmsgade 121216 København KTlf.:33 92 33 01Fax:33 14 50 42Mail:fvm@fvm.dkEAN: 5798000876910",
    "Åbningstider",
    "​​Mandag-torsdag: 9.00-16.00Fredag: 9.00-15.00",
    "Følg os",
    "TwitterNyhedsbrevRSS nyheder",
    "Fødevarestyrelsen",
    "Fødevarestyrelsen tager sig af regler på veterinær- og fødevareområdet og sikrer, at reglerne bliver overholdt via vejledning og kontrol med fødevarer, foder, landets slagterier og veterinære forhold.Fødevarestyrelsens hovedkontor administrerer regler på veterinær- og fødevareområdet. Kontrollen med fødevarer, foder og dyrs forhold udføres af Fødevarestyrelsens fødevareenheder og veterinærenheder, mens Kødkontrollen tjekker slagterierne.​​Læs mere om Fødevarestyrelsen​",
    "Adresse",
    "​Stationsparken 31-332600 GlostrupTlf.:72 27 69 00Mail:KontaktformularEAN: 5798000986008CVR: 62534516",
    "Åbningstider",
    "​Mandag-torsdag: 9.00-16.00Fredag: 9.00-15.00",
    "Ofte besøgte sider",
    "Startpakke til nye fødevarevirksomheder​Egenkontrol og risikoanalyseHygiejne og indretningKlag over virksomhed​Tilbagekaldte fødevarer",
    "Følg os",
    "FacebookTwitterNyhedsbrevRSS nyheder",
    "Ministeriet for Fødevarer, Landbrug og Fiskeri",
    "Ministeriet arbejder for at skabe rammerne for:​et udviklings- og vækstorienteret fødevareerhverven ansvarlig forvaltning af naturressourcerfødevaresikkerhed, forbrugernes valgmuligheder og sunde kostvanerBesøg ministeriets hjemmeside",
    "Adresse",
    "​Slotsholmsgade 121216 København KTlf.:33 92 33 01Fax:33 14 50 42Mail:fvm@fvm.dkEAN: 5798000876910",
    "Åbningstider",
    "​​Mandag-torsdag: 9.00-16.00Fredag: 9.00-15.00",
    "Følg os",
    "TwitterNyhedsbrevRSS nyheder"
  ],
  "https://billetter.drkoncerthuset.dk/da/login/": [
    "Tix.dk",
    "Registrer ny profil"
  ],
  "https://www.pressenaevnet.dk/benedikte-kaalund/": [
    "Benedikte Kaalund | Pressenævnet",
    "Seneste nyt",
    "Benedikte Kaalund",
    "Benedikte Kaalund, stedfortræder for John Meinert Jacobsen",
    "Kontakt",
    "Pressenævnet | Landgreven 4, 4. | 1301 København K",
    "E-mail: sekr@pressenaevnet.dk",
    "Telefon: 3315 5564",
    "Telefontider: Mandag til fredag kl. 10.00 – 14.00.",
    "Elektroniske fakturaer: EAN.NR 5798000065987",
    "Hvad er Pressenævnet?",
    "Pressenævnet er et offentligt, uafhængigt nævn, der træffer afgørelser i klager over medier. Nævnets medlemmer er fra medier og offentligheden. Formandskabet består af dommere og advokater.",
    "Nyhedsbrev",
    "Modtag nyhedsbrev samme dag som vi publicerer nyt.",
    "Tilmeld dig nyhedsbrevet her",
    "Læs mere om vores persondatapolitik i forhold til nyhedsbrevtilmeldinger via e-mailher.",
    "Årsrapport",
    "Download seneste og tidligereher.",
    "Kommende møder",
    "Se mødekalenderher.",
    "Webtilgængelighed",
    "Tilgængelighedserklæring"
  ],
  "https://www.was.digst.dk/pressenaevnet-dk": [
    "Tilgængelighedserklæring",
    "Pressenævnet forpligter sig til at gøre webstedet https://www.pressenaevnet.dk/ tilgængeligt, jf. ”Lov om tilgængelighed af offentlige organers websteder og mobilapplikationer”.",
    "Oplever du, at der er ikke-tilgængeligt indhold på https://www.pressenaevnet.dk/?",
    "Her har du mulighed for at underrette det ansvarlige offentlige organ om webstedets manglende overholdelse af tilgængelighedskrav i webtilgængelighedsloven. Derudover har du også mulighed for at anmode om oplysninger, som det ansvarlige offentlige organ eventuelt har undtaget i medfør af lovens § 1, stk. 5 (undtagelse af indhold) og § 3, stk. 2 (uforholdsmæssig stor byrde).",
    "Du kan kontakte Pressenævnet, hvis du oplever, at der er ikke-tilgængeligt indhold på https://www.pressenaevnet.dk/",
    "Kontaktside:https://www.pressenaevnet.dk/E-mail:sekr@pressenaevnet.dkTelefon:33 15 55 64",
    "Du bør ikke angive fortrolige eller følsomme personoplysninger som fx personnummer og helbredsoplysninger, når du kontakter det offentlige organ.",
    "Overholdelsesstatus",
    "Som offentligt organ skal man angive, i hvilket omfang ens websted overholder kravene til webtilgængelighed, som de fremgår af den harmoniserede standard EN 301 549. Overholdelsesstatus kan være:",
    "Det offentlige organ oplyser at:Webstedet overholder standarden delvist (overholder de fleste krav).",
    "Det offentlige organ skal derudover beskrive, hvordan de har evalueret webstedet. Her er kategorierne:",
    "Det offentlige organ angiver metoden som:Vurdering er foretaget af ekstern part.",
    "Det offentlige organ beskriver vurderingsmetoden som:Automatiseret og brugertest",
    "Evalueringsrapporter",
    "Det offentlige organ har mulighed for at henvise til eventuelle evalueringsrapporter.",
    "Det offentlige organ oplyser:Ingen henvisning til evalueringsrapporter",
    "Ikke-tilgængeligt indhold",
    "Det offentlige organ har kategoriseret det ikke-tilgængelige indhold på dette websted. Under hver kategori kan der være en række emner, som vises med overskrifter samt en forklarende tekst. Et emne kan fx være manglende alternative tekster.",
    "Ikke-tilgængeligt indhold inddeles i tre kategorier, og omhandler funktion eller indhold, der:",
    "Overholder ikke webtilgængelighedsloven",
    "ÅrsrapporterVi har på websitet årsrapporter, der er udarbejdet i et ikke kompatibelt format",
    "Uforholdsmæssig stor byrde",
    "Intet at angive",
    "Ikke omfattet af loven",
    "Dokumenter og video lagt på websitet før 23. september 2018Dokumenter og video, som er publiseret før 23. september 2018 er ikke som udgangspunkt webtilgængelige, da de ikke er vurderet som værende væsentlige for administrative processer.ArkivmaterialeKendelser i pdf-format, som er delt som retsinformation, og som er publiseret før 23. september 2019 anses for arkivmateriale og er ikke som udgangspunkt webtilgængelige, da disse ikke er vurderet som værende væsentlige for administrative processer.",
    "Initiativer for at opnå en højere grad af webtilgængelighed",
    "Det offentlige organ har mulighed for at beskrive, hvad de gør for at opnå en højere grad af webtilgængelighed på webstedet.",
    "Det offentlige organs beskrivelse:",
    "Ingen beskrivelse",
    "Henvendelse til DigitaliseringsstyrelsenDigitaliseringsstyrelsen fører tilsyn med, om webtilgængelighedsloven overholdes.Før du kontakter Digitaliseringsstyrelsen, skal du kontakte den ansvarlige myndighed eller det offentligretlige organ med henblik på at løse webtilgængelighedsproblemet. Det gør du ved hjælp af kontaktinformationen, der fremgår øverst i denne tilgængelighedserklæring.Hvis du oplever, at myndigheden eller det offentligretlige organ, der har ansvaret for webstedet, ikke svarer tilfredsstillende på din henvendelse, kan du sende en henvendelse til Digitaliseringsstyrelsen på mailwebtilsyn@digst.dkeller indtale en besked på telefon 20 16 36 12.Digitaliseringsstyrelsen vurderer din henvendelse og vender tilbage inden 10 arbejdsdage.Digitaliseringsstyrelsen anvender henvendelserne som input til tilsynsindsatsen for overholdelse af webtilgængelighedsloven. For henvendelser, der ikke er relateret til webtilgængelighed, skal du kontakte den relevante myndighed direkte.",
    "Henvendelse til Digitaliseringsstyrelsen",
    "Digitaliseringsstyrelsen fører tilsyn med, om webtilgængelighedsloven overholdes.",
    "Før du kontakter Digitaliseringsstyrelsen, skal du kontakte den ansvarlige myndighed eller det offentligretlige organ med henblik på at løse webtilgængelighedsproblemet. Det gør du ved hjælp af kontaktinformationen, der fremgår øverst i denne tilgængelighedserklæring.",
    "Hvis du oplever, at myndigheden eller det offentligretlige organ, der har ansvaret for webstedet, ikke svarer tilfredsstillende på din henvendelse, kan du sende en henvendelse til Digitaliseringsstyrelsen på mailwebtilsyn@digst.dkeller indtale en besked på telefon 20 16 36 12.",
    "Digitaliseringsstyrelsen vurderer din henvendelse og vender tilbage inden 10 arbejdsdage.",
    "Digitaliseringsstyrelsen anvender henvendelserne som input til tilsynsindsatsen for overholdelse af webtilgængelighedsloven. For henvendelser, der ikke er relateret til webtilgængelighed, skal du kontakte den relevante myndighed direkte.",
    "Denne erklæring blev første gang offentliggjort den 09. april 2021",
    "Erklæringen blev senest revideret den 25. januar 2023"
  ],
  "https://www.dr.dk/om-dr/nyheder/konceptkoncerter-fra-dr-faar-nyt-liv-i-soenderborg-esbjerg-og-aalborg": [
    "Navigation",
    "DR's hovedindgange",
    "Sektionens indgange",
    "Nyhedssektioner",
    "Kontakt og privatliv",
    "Sektionens indgange",
    "Konceptkoncerter fra DR får nyt liv i Sønderborg, Esbjerg og Aalborg",
    "DR samarbejder med landsdelsorkestre om de såkaldte koncept-koncerter, som DR har haft stor succes med. I denne uge holder Sønderjyllands Symfoniorkester for eksempel to ’Fantasymphony’-koncerter med musik fra fantasy-universer.",
    "Jakob Stegelmann er atter konferencier, og musikken er igen soundtracks fra fantasy-film og -spil, når den står på såkaldt ’Fantasymphony’-koncert i koncertsalen Alsion i Sønderborg på fredag og i Musikhuset Esbjerg på lørdag.",
    "Men ikke alt er ved det gamle. For mens det er DR Symfoniorkestret, der har udviklet konceptkoncerten og hidtil har stået for musikken, når koncerterne har været holdt i DR Koncerthuset, er det i denne uge Sønderjyllands Symfoniorkester, der leverer tonerne og er arrangør, mens Filharmonisk Kor synger.",
    "Noget af det samme gentager sig senere på måneden – fredag den 27. september, hvor Aalborg Symfoniorkester har DR-koncertkonceptet ’Galaxymphony’ på programmet, hvor musikken er fra nogle af historiens største rumfilm - helt som det tidligere har lydt i DR Koncerthuset. Men DR Symfoniorkestret er altså skiftet ud med det nordjyske landsdelsorkester, der blandt andre har solisten Tuva Semmingsen med som solist, og hvor Jakob Stegelmann var vært i København, er Elias Eliot det nu.",
    "Alle gange foregår det hele som et venligt tilbud fra DR til orkesterkolleger over hele Danmark. DR og de respektive landsdelsorkestre laver en co-produktion ud af det hele, og DR sender for eksempel en indholdsproducent, som har erfaringen med opsætningerne af konceptkoncerterne i DR Koncerthuset, til det syd- og sønderjyske og det nordjyske.",
    "- Som udgangspunkt vil DR Symfoniorkestret gerne spille over hele landet og nå ud til endnu flere. Men i virkelighedens verden er det ikke enkelt at få så stort orkester på turné, ligesom vi heller ikke vil konkurrere med landsdelsorkestrene om deres publikum. I stedet har vi valgt at samarbejde om projekterne og stille koncepter til rådighed, så de får mulighed for at arbejde på samme måde, som vi har gjort, forklarer producent Nicolai Abrahamsen fra DR Koncerthuset.",
    "Vil gerne have fat i nye grupper",
    "Han har selv været med i udviklingen af koncept-koncerterne eller soundtrack-koncerterne i DR, som nogle kalder dem, siden 2016. Koncerterne indeholder typisk musik fra biograffilm, tv-serier og computerspil, og i mange tilfælde tiltrækker de et andet publikum til koncerterne, end for eksempel torsdagskoncerterne i DR gør.",
    "Alene i 2023 har omkring 25.000 været til en soundtrack-koncert i DR, og rundt omkring i landet har landsdelsorkestrene på samme måde som DR kigget efter, hvad der kan gøres for at få fat i befolkningsgrupper, som måske ellers ikke ville opleve et symfoniorkester live.",
    "Nicolai Abrahamsen forklarer, at DR’s indsats konkret består i at hjælpe med at skaffe rettigheder til musikken, forhandle kontrakter med de eksterne solister og værter, sparre om programmet, formidlingen og tekst-materialet samt at deltage i prøveforløb og her give indspark og gode ideer.",
    "- DR har også stillet en arrangør til rådighed, som tilpasser noderne til det enkelte orkesters besætning. I det hele taget har der siddet mennesker og omskaleret ’Fantasymphony’- og ’Galaxymphony’-koncerterne, så de passer til de lokale forhold og den koncertsal, der er, forklarer DR-producenten.",
    "Omvendt har de lokale orkestre i Sønderborg og Aalborg bedst viden om, hvor og hvordan de lige rammer deres publikum, og Sønderjyllands Symfoniorkester har på fredag for eksempel allieret sig med Sønderborgs brætspilscafé, Æ Bræt, der varmer op med brætspil og figurmaling for filmnørder og gamere, før musikken spiller klokken 19.00 i koncertsalen Alsion. I Esbjerg lørdag bliver koncerten holdt som en del af Esbjerg Fantasyfestival.",
    "Har ændret sig de seneste 10 år",
    "Sønderjyllands Symfoniorkesters musikchef Adam Stadnicki ser frem til weekendens ’Fantasymphony’ i Sønderborg og Esbjerg, og han er glad for, at Sønderjyllands Symfoniorkester og DR kan samarbejde om koncerterne.",
    "- Det er en koncertform, som vi ikke ville have haft et publikum til for 10 år siden, men som ikke mindst DR Symfoniorkestret har haft succes med at udvikle. Samtidig har vi i Sønderjyllands Symfoniorkester et opdrag om, at vi også skal udvikle tilbud til nye publikumsgrupper, og det er her, vi kan nyde godt af andres erfaringer, forklarer Adam Stadnicki. Samtidig er der også en økonomisk side af sagen. For skal Sønderjyllands Symfoniorkester for eksempel vende sig mod London, som man gjorde, da man i januar i år havde filmmusik fra ’Marvel’-filmene, ’Batman’ og ’Star Wars’ på nodestativerne ved to koncerter i Sønderborg og Esbjerg, er en af udfordringerne, at det koster en masse penge at skaffe rettighederne.",
    "Giver et løft",
    "- I dette tilfælde med ’Fantasymphony’ har vi kunnet sparre med DR’s producent, der har lavet koncerten før. Samtidig har vi også fået gode råd til, hvor der kan skæres hjørner og kanter af. For eksempel har Sønderjyllands Symfoniorkester 12 førstevioliner og ikke 16 som DR Symfoniorkestret, ligesom vores lyssætning ikke er den samme som DR Koncerthuset. Derimod har vi kunnet bruge grafik og logo fra de oprindelige ’Fantasymphony’-koncerter direkte, forklarer Adam Stadnicki.",
    "Han fortsætter:",
    "- I yderregionerne glæder vi os især over, at DR har lyst til at samarbejde med os. Det giver et løft, og vi har savnet sådan et samarbejde på tværs af landet.",
    "Selv om samarbejdet med DR Symfoniorkestret er en stor hjælp, har Sønderjyllands Symfoniorkester dog også stadig en udfordring, som samarbejdet med DR ikke løser. Nemlig hvordan man får publikum til også at komme anden gang og måske da løse billet til de ’mere traditionelle’ klassiske koncerter eller for eksempel til crossover-koncerterne med folkemusik og jazz eller bogkoncerterne, som Sønderjyllands Symfoniorkester også er på vej med.",
    "- Hvis der er efterspørgsel efter koncept-koncerterne, er vi helt åbne for at lave flere af dem. I så fald ville vi nok satse på et årligt samarbejde, som det, vi nu har med DR om ’Fantasymphony’, siger Adam Stadnicki. Tidligere har Malmö Symfoniorkester fået assistance af DR Symfoniorkestret til at opføre ’Duellen’ med noget af Ennio Morricones musik fra ikoniske mafia- og westernfilm, ligesom Aalborg Symfoniorkester for et år siden holdt ’Hollywood Galla’ efter DR-opskrift, efter at DR ved en tidligere lejlighed bød på filmmusikalske lækkerier fra de største Hollywood-film.",
    "DR’s direktør for Kultur, Børn og Unge Henrik Bo Nielsen glæder sig over samarbejdet mellem DR Symfoniorkestret og flere af landsdelsorkestrene.",
    "- Det er en fælles opgave for alle landets symfoniorkestre at give nye befolkningsgrupper appetit på at opleve den symfoniske musik live. Derfor giver det rigtig god mening, at vi fra DR’s side hjælper landets orkestre i at prøve kræfter med nye koncertformater, der henvender sig til et bredere publikum. På den måde kan vi medvirke til, at koncertsale i hele landet forhåbentlig også i fremtiden har et stort og nysgerrigt publikum, som kommer for at mærke den særlige lyd og energi fra et stort, levende symfoniorkester, siger han.",
    "Tysk forlag bringer koncert ud internationalt",
    "Producent Nicolai Abrahamsen forklarer, at DR Symfoniorkestret også har en aftale med et tysk forlag i Berlin, som repræsenterer DR’s konceptkoncerter internationalt, og som prøver at se, om udenlandske orkestre også kunne være interesserede i at lave dem efter DR’s opskrift.",
    "Alt imens har DR meldt ud, at der kommer en tredje og sidste runde med ’Galaxymphony’-koncerter til april 2025 med soundtracks fra film som ’Star Wars’, ’The Mandalorian’, ’Star Trek’, ’Dune’ og mange flere - ligesom nye koncepter er på vej, siger Nicolai Abrahamsen uden at kunne afsløre meget mere lige nu.",
    "Se 'Fantasymphony' fra koncerten i Koncertsalen på DRTV:",
    "Mere fra dr.dk"
  ],
  "https://policies.google.com/terms?hl=da&utm_source=ucb": [
    "",
    "Privatliv og vilkår",
    "",
    "Privatliv og vilkår",
    "Googles servicevilkår",
    "Gyldig fra 22. maj 2024|Arkiverede versioner|Download PDF",
    "Landeversion:Danmark",
    "Hvad dækker disse vilkår?",
    "Vi ved, at det kan være fristende at springe disse servicevilkår over, men det er vigtigt, at du ved, hvad du kan forvente af os, når du bruger Googlestjenester, og hvad vi forventer af dig.",
    "Disse Servicevilkår afspejler,hvordan Googles virksomhed fungerer, hvilke love der gælder for vores virksomhed, samtvisse ting, vi altid har anset som sande. Disse Servicevilkår er derfor med til at definere Googles forhold til dig, når du bruger vores tjenester. Disse vilkår omfatter f.eks. følgende emneoverskrifter:",
    "Det er vigtigt, at du kender disse vilkår, da du skal acceptere dem for at bruge vores tjenester. Vi opfordrer dig til at downloade disse vilkår, så du kan bruge dem senere. Vi stiller disse vilkår og alle tidligere versioner af dem til rådighedher.",
    "Foruden disse vilkår har vi også enprivatlivspolitik. Selvom denne ikke er en del af disse vilkår, opfordrer vi dig til at læse den for at få en bedre forståelse af, hvordan du kanopdatere, administrere, eksportere og slette dine oplysninger.",
    "Vilkår",
    "Tjenesteudbyder",
    "I Det Europæiske Økonomiske Samarbejdsområde (EØS) og Schweiz leveres Googlestjenesteraf, og du indgår kontrakt med:",
    "Google Ireland Limitedstiftet og drives i henhold til irsk lovgivning(registreringsnummer: 368047/VAT-nummer: IE6388047V)Gordon House, Barrow StreetDublin 4Irland",
    "Alderskrav",
    "Hvis du er under denalder, der kræves for at administrere din egen Google-konto, skal du have din forælders eller værges tilladelse til at bruge en Google-konto. Bed din forælder eller værge om at gennemgå disse vilkår sammen med dig.",
    "Hvis du er forælder eller værge, og du giver dit barn lov til at brugetjenesterne, gælder disse vilkår for dig, og du har ansvaret for dit barns aktivitet i tjenesterne.",
    "Nogle Google-tjenester stiller yderligere krav til alder som beskrevet i deresyderligere tjenestespecifikke vilkår og politikker.",
    "Indhold",
    "Dit forhold til Google",
    "Disse vilkår er med til at definere forholdet mellem dig og Google. Når vi omtaler \"Google\", \"vi\", \"os\" og \"vores\", refererer vi til Google Ireland Limited og dennestilknyttede virksomheder. I bred forstand giver vi dig tilladelse til at tilgå og bruge vorestjenester, hvis du accepterer at følge disse vilkår, som afspejler,hvordan Googles virksomhed fungerer, og hvordan vi tjener penge.",
    "Hvad du kan forvente af os",
    "Levering af et bredt udvalg af nyttige tjenester",
    "Mange af disse tjenester omfatter også indhold, som du kan streame eller interagere med.",
    "Vores tjenester er udviklet til at fungere sammen, så du nemt kan gå fra én aktivitet til en anden. Hvis din begivenhed i Kalender f.eks. indeholder en adresse, kan du klikke på adressen og få vist en rutevejledning i Maps.",
    "Udvikling, forbedring og opdatering af Google-tjenester",
    "Vi bruger en bred definition af \"tjenester\" i disse vilkår som beskrevet ovenfor, men den gældende lovgivning skelner mellem \"digitalt indhold\", \"tjenester\" og \"varer\" i visse situationer. Derfor bruger vi mere specifikke termer i dette afsnit og i afsnittetJuridisk garanti.",
    "Vi udvikler løbende nye teknologier og funktioner for at forbedre vores tjenester. Vi bruger f.eks. kunstig intelligens og maskinlæring for at give dig simultanoversættelser og for bedre at kunne registrere og blokere spam og malware.",
    "Som et led i den løbende udvikling af vores digitale indhold, tjenester og varer, foretager vi ændringer, hvor vi f.eks. kan tilføje eller fjerne funktioner, øge eller reducere forbrugsgrænser, tilbyde nyt digitalt indhold eller nye tjenester eller udfase gamle tjenester. Vi kan også ændre vores digitale indhold eller tjenester af følgende andre årsager:",
    "Specifikt foretager vi nogle gange juridisk påkrævede opdateringer, som sørger for, at digitalt indhold, tjenester eller varer er i overensstemmelse med lovgivningen. Vi foretager disse opdateringer af vores digitale indhold, tjenester og varer af hensyn til sikkerheden samt for at sikre, at de opfylder de kvalitetsstandarder, du forventer, såsom dem, der er beskrevet i afsnittetJuridisk garanti. Vi kan automatisk installere opdateringer, der imødegår væsentlige sikkerhedsrisici. Du kan vælge, om du vil have installeret andre opdateringer.",
    "Vi følger et effektivt produktundersøgelsesprogram, så før vi ændrer eller stopper med at tilbyde en tjeneste, overvejer vi nøje dine interesser som bruger, dine rimelige forventninger og den potentielle indvirkning på dig og andre brugere. Vi ændrer eller stopper kun med at tilbyde en tjeneste, når der er en god grund til at gøre det.",
    "Hvis en ændring har negativ indflydelse på din mulighed for at få adgang til eller bruge vores digitale indhold eller tjenester, eller hvis vi helt stopper med at tilbyde en tjeneste, giver vi dig et rimeligt forudgående varsel via mail – inklusive en beskrivelse af ændringerne, hvornår de træder i kraft, og din ret til at bringe din kontrakt med os til ophør, hvis vores ændringer har større negativ indvirkning – medmindre der er tale om hastesituationer, hvor det f.eks. er nødvendigt at forhindre misbrug eller skade, reagere på juridiske krav eller imødegå problemer med sikkerhed og drift. Vi giver dig også mulighed for at eksporteredit indholdfra din Google-konto ved hjælp afGoogle Takeoutunderlagt gældende lovgivning og politikker.",
    "Hvad vi forventer af dig",
    "Følg disse vilkår og yderligere tjenestespecifikke vilkår",
    "Vi stiller også forskellige politikker, Hjælp og andre ressourcer til rådighed for at besvare almindelige spørgsmål og afstemme forventningerne vedrørende brugen af vores tjenester. Disse ressourcer omfatter voresprivatlivspolitik,Hjælp til ophavsret,SikkerhedscenterCenter for gennemsigtighedsamt andre sider, der er tilgængelige via voreswebsite med politikker. Derudover kan vi give specifikke anvisninger og advarsler i vores tjenester – f.eks. dialogbokse, der underretter dig om vigtige oplysninger.",
    "Selvom vi giver dig tilladelse til at bruge vores tjenester, beholder vi alleimmaterielle rettigheder, vi har over tjenesterne.",
    "Respekter andre",
    "I deyderligere tjenestespecifikke vilkår og politikker, f.eks. vorespolitik vedrørende forbudt brug af generativ AI, kan du læse mere om passende adfærd, som alle, der bruger tjenesterne, skal efterleve. Hvis du mener, at andre ikke følger disse regler, giver mange af vores tjenester dig mulighed for atrapportere misbrug. Hvis vi reagerer på en rapportering om misbrug, sørger vi også for den behandling, der er beskrevet i afsnittetForanstaltninger i tilfælde af problemer.",
    "Du må ikke misbruge vores tjenester",
    "De fleste, der tilgår eller bruger vores tjenester, forstår de generelle regler, der er med til at gøre internettet sikkert og åbent. Desværre er der nogle få personer, der ikke overholder disse regler, så derfor beskriver vi reglerne her for at beskytte vores tjenester og brugere mod misbrug. Reglerne er som følger:",
    "Tilladelse til at anvende dit indhold",
    "Nogle af vores tjenester er designet med henblik på at give dig mulighed for at uploade, indsende, gemme, sende, modtage eller deledit indhold. Du er ikke forpligtet til at dele indhold med vores tjenester, og du vælger selv, hvilket indhold du vil dele. Hvis du vælger at uploade eller dele indhold, skal du sørge for, at du har de nødvendige rettigheder til at gøre det, og at indholdet er lovligt.",
    "Licens",
    "Dit indholdforbliver dit, hvilket betyder, at du bevarer alleimmaterielle rettigheder, som du har over dit indhold. Det kan f.eks. være, hvis du har immaterielle rettigheder til det kreative indhold, du laver, f.eks. anmeldelser, som du skriver. Eller du kan have ret til at dele en anden persons kreative indhold, hvis vedkommende har givet dig tilladelse.",
    "I tilfælde af at dine immaterielle rettigheder begrænser vores brug af dit indhold, skal du give din tilladelse, før vi kan anvende det. Du giver Google tilladelse via denne licens.",
    "Hvad er dækket?",
    "Denne licens dækkerdit indhold, hvis indholdet er beskyttet af immaterielle rettigheder.",
    "Hvad er ikke dækket?",
    "Omfang",
    "Rettigheder",
    "Denne licens giver Google tilladelse til følgende:",
    "Formål",
    "Denne licens har følgende begrænsede formål:",
    "Varighed",
    "Denne licens gælder, så længe dit indhold er beskyttet af immaterielle rettigheder.",
    "Hvis du fjerner indhold fra vores tjenester, og indholdet er dækket af denne licens, stopper vores systemer med at gøre det pågældende indhold offentligt tilgængeligt inden for et rimeligt tidsrum. Der er to undtagelser:",
    "Brug af Google-tjenester",
    "Din Google-konto",
    "Hvis du opfylder disse alderskrav, kan duoprette en Google-konto. Nogletjenesterfungerer kun, hvis du har en Google-konto. Hvis du f.eks. vil bruge Gmail, skal du have en Google-konto, så du har en adresse til at sende og modtage mail.",
    "Du er ansvarlig for det, du foretager dig med din Google-konto, og for at træffe rimelige foranstaltninger for at beskytte din Google-konto. Vi opfordrer dig til at gennemføre etSikkerhedstjekmed jævne mellemrum.",
    "Brug af Google-tjenester på vegne af en organisation eller virksomhed",
    "Tjenesterelateret kommunikation",
    "For at kunne levere vores tjenester til dig sender vi dig sommetider servicemeddelelser eller andre oplysninger. Du kan få flere oplysninger om, hvordan vi kommunikerer med dig i Googlesprivatlivspolitik.",
    "Hvis du vælger at give os feedback i form af f.eks. forslag til, hvordan vi kan forbedre vores tjenester, kan vi handle på din feedback uden nogen forpligtelser over for dig.",
    "Indhold i Google-tjenester",
    "Dit indhold",
    "Nogle af vorestjenestergiver dig mulighed for at generere originalt indhold. Google vil ikke gøre krav på ejerskabet af det pågældende indhold.",
    "Nogle af vorestjenestergiver dig mulighed for at gøre dit indhold offentligt tilgængeligt. Du kan f.eks. indsende en anmeldelse af et produkt eller en restaurant, som du har skrevet, eller du kan uploade et blogindlæg, du har forfattet.",
    "Hvis du mener, at nogen krænker dineimmaterielle rettigheder, kan dusende os en underretning om krænkelsen, hvorefter vi træffer de nødvendige foranstaltninger. Vi kan f.eks. suspendere eller lukke Google-konti, der gentagende gange har krænketophavsrettensom beskrevet iHjælp til ophavsret.",
    "Google-indhold",
    "Nogle af vorestjenesteromfatter indhold, der tilhører Google – f.eks. mange af de visuelle illustrationer, du ser i Google Maps. Du må bruge Googles indhold, som disse vilkår og eventuelleyderligere tjenestespecifikke vilkårtillader det, men vi bevarer alle immaterielle rettigheder, som vi har over vores indhold. Du må ikke fjerne, skjule eller ændre vores branding, logoer eller juridiske meddelelser. Gå til siden med Googles brand-tilladelserGoogle Brand Permissions, hvis du vil bruge vores branding eller logoer.",
    "Andet indhold",
    "Nogle af vorestjenestergiver dig adgang til indhold, der tilhører andre enkeltpersoner ellerorganisationer– det kan f.eks.være en butikejers beskrivelse af sin virksomhed eller en avisartikel, der vises i Google Nyheder. Du må kun bruge dette indhold, hvis den pågældende enkeltperson eller organisation giver tilladelse til det, eller hvis lovgivningen tillader det. De synspunkter, der udtrykkes i andre enkeltpersoners eller organisationers indhold, tilhører dem, og afspejler ikke nødvendigvis Googles synspunkter.",
    "Software i Google-tjenester",
    "Nogle af vorestjenesteromfatter software, der kan downloades, eller som forudindlæses. Vi giver dig tilladelse til at bruge den software som en del af tjenesterne.",
    "Nogle af vores tjenester omfatter software, der tilbydes i henhold til open source-licensvilkår, som vi stiller til rådighed for dig. Nogle gange er der bestemmelser i open source-licensen, som udtrykkeligt tilsidesætter dele af disse vilkår, så du skal sørge for at læse disse licenser.",
    "Du må ikke kopiere, ændre, distribuere, sælge eller udleje nogen dele af vores tjenester eller software.",
    "I tilfælde af problemer eller uoverensstemmelser",
    "Både lovgivningen og disse vilkår giver dig ret til (1) tjenester af en vis kvalitet og (2) måder at løse problemer på, hvis noget går galt. Hvis du erforbruger, har du alle juridiske rettigheder, der gives til forbrugere i henhold til gældende lovgivning, samt yderligere rettigheder, som gives i henhold til disse vilkår elleryderligere tjenestespecifikke vilkår.",
    "Juridisk garanti",
    "Hvis du erforbrugermed bopæl i EØS, og du har accepteret vores Servicevilkår, giver forbrugerlovgivningen i EØS dig enjuridisk garanti, som dækker det digitale indhold samt de tjenester eller de varer, vi leverer til dig. I henhold til denne garanti er viansvarligefor almanglende overensstemmelse, som du måtte opdage:",
    "Dine nationale love kan give en endnu længere garanti. Dine rettigheder i henhold til disse garantier fastsat ved lov er ikke begrænset af nogen andrekommercielle garantier, som vi giver.Kontakt os, hvis du vil indgive et garantikrav.",
    "Ansvar",
    "For alle brugere",
    "Disse vilkår begrænser ikkeansvaretfor:Bedrag eller svigagtig fremsættelse af urigtige oplysningerDød eller personskade forårsaget af uagtsomhedGrov uagtsomhedForsætlig ureglementeret adfærd",
    "Foruden det ansvar, der er beskrevet ovenfor, er Google kun ansvarlig for sin misligholdelse af disse vilkår eller gældendeyderligere tjenestespecifikke vilkåri overensstemmelse med gældende lovgivning.",
    "Kun for erhvervsbrugere og organisationer",
    "Hvis du ererhvervsbrugereller enorganisation:",
    "Foranstaltninger i tilfælde af problemer",
    "Inden vi træffer foranstaltninger som beskrevet nedenfor, giver vi dig forudgående varsel, hvor dette med rimelighed er muligt, beskriver årsagen til vores handling og giver dig mulighed for at forklare og løse problemet, medmindre vi med rimelighed antager, at dette vil:",
    "Fjernelse af dit indhold",
    "Hvis vi med rimelighed mener, at noget afdit indhold(1) misligholder disse vilkår,yderligere tjenestespecifikke vilkår eller politikker, (2) overtræder gældende lovgivning eller (3) kan være til skade for vores brugere, tredjeparter eller Google, forbeholder vi os retten til at fjerne noget af eller alt indholdet i overensstemmelse med gældende lovgivning. Eksempler herpå er børnepornografi, indhold, der fremmer menneskehandel eller chikane, terrorismerelateret indhold samt indhold, der krænker en anden personsimmaterielle rettigheder.",
    "Suspendering eller ophævning af din adgang til Google-tjenester",
    "Uden at begrænse vores øvrige rettigheder kan Google suspendere eller fjerne din adgang til tjenesterne eller slette din Google-konto, hvis følgende sker:",
    "Du kan få flere oplysninger om, hvorfor vi deaktiverer konti, og hvad der sker, når vi gør det, på denneside i Hjælp.Du kan klage, hvis du mener, at din Google-konto er blevet suspenderet eller bragt til ophør ved en fejl.",
    "Du kan naturligvis til enhver tid stoppe med at bruge vores tjenester. Hvis du erforbrugermed bopæl i EØS, kan du ogsåtrække dit samtykke til disse vilkår tilbageinden for 14 dage fra din accept af dem. I tilfælde af at du stopper med at bruge en tjeneste, vil visætte pris på, at du deler årsagen med os, så vi kan fortsætte med at forbedre vores tjenester.",
    "Håndtering af anmodninger om dine data",
    "Hensynet til beskyttelsen af dine data og deres sikkerhed danner grundlaget for, hvordan vi håndterer anmodninger om videregivelse af data. Når vi modtager anmodninger om videregivelse af data, gennemgår vores team dem for at sikre, at de opfylder juridiske krav og Googlespolitikker for videregivelse af data. Google Ireland Limited har adgang til og videregiver data, herunder kommunikation, i overensstemmelse med irsk lovgivning og EU-lovgivning, der finder anvendelse i Irland. Du kan få flere oplysninger om de anmodninger om videregivelse af data, Google modtager fra hele verden, og om, hvordan vi håndterer sådanne anmodninger, i voresgennemsigtighedsrapportogprivatlivspolitik.",
    "Bilæggelse af tvister, lovvalg og domstole",
    "Du kan få oplysninger om, hvordan du kan kontakte Google, påkontaktsiden.",
    "Hvis du er bosiddende i eller er enorganisationmed base i Det Europæiske Økonomiske Samarbejdsområde (EØS) eller Schweiz, er disse vilkår og dit forhold til Google i henhold til disse vilkår ogyderligere tjenestespecifikke vilkårunderlagt lovgivningen i dit bopælsland eller det land, din organisation har base i, og du kan indgive juridiske tvister til de lokale domstole. Hvis du erforbrugermed bopæl i EØS, bedes dukontakte os direktefor at løse problemer. Europa-Kommissionen stiller også enplatform til onlinetvistbilæggelsetil rådighed, men lovgivningen kræver ikke, at Google bruger denne eller andre alternative platforme til bilæggelse af tvister.",
    "Om disse vilkår",
    "I henhold til lovgivningen har du visse rettigheder, som ikke kan begrænses af en kontrakt som f.eks. disse servicevilkår. Disse vilkår har på ingen måde til hensigt at begrænse disse rettigheder.",
    "Disse vilkår beskriver forholdet mellem dig og Google. De giver ikke andre enkeltpersoner ellerorganisationernogen juridiske rettigheder – heller ikke hvis andre drager nytte af forholdet i henhold til disse vilkår.",
    "Disse vilkår skal være let forståelige, og vi har derfor brugt eksempler fra vorestjenester. Det er muligvis ikke alle nævnte tjenester, der er tilgængelige i dit land.",
    "Hvis det viser sig, at et specifikt vilkår ikke er gyldigt eller ikke kan håndhæves, påvirker dette ikke de andre vilkår.",
    "Hvis du ikke følger disse vilkår eller deyderligere tjenestespecifikke vilkår, og vi ikke tager de nødvendige foranstaltninger med det samme, betyder det ikke, at vi giver afkald på vores rettigheder, herunder til at tage de nødvendige foranstaltninger på et senere tidspunkt.",
    "Vi kan opdatere disse vilkår ogyderligere tjenestespecifikke vilkår(1) for at afspejle ændringer af vores tjenester eller ændringer af, hvordan vi driver forretning, f.eks. når vi tilføjer nye tjenester, funktioner, teknologier, priser eller fordele (eller fjerner gamle), (2) af juridiske, lovmæssige eller sikkerhedsmæssige årsager eller (3) for at forebygge misbrug eller skade.",
    "Hvis vi ændrer disse vilkår elleryderligere tjenestespecifikke vilkåri væsentligt omfang, vil vi give dig et rimeligt forudgående varsel og muligheden for at gennemgå ændringerne, medmindre (1) vi lancerer en ny tjeneste eller funktion, eller (2) ændringerne sker i forbindelse med hastesituationer, hvor det f.eks. er nødvendigt at forhindre igangværende misbrug eller reagere på juridiske krav. Hvis du ikke accepterer de nye vilkår,  skal du fjernedit indholdog stoppe med at bruge tjenesterne.  Du kan også til enhver tid afslutte dit forhold til os ved at lukke din Google-konto.",
    "EØS' standardvejledning om fortrydelsesret",
    "Hvis du erforbrugermed bopæl i EØS, giver forbrugerlovgivningen i EØS-lande dig ret til at ophæve denne kontrakt, som dette er beskrevet iEU's standardvejledning om ophævelsesret, du kan se nedenfor.",
    "Fortrydelsesret",
    "De har ret til at træde tilbage fra denne aftale uden begrundelse inden for 14 dage.",
    "Fortrydelsesfristen udløber 14 dage efter den dag, hvor aftalen blev indgået.",
    "For at udøve fortrydelsesretten skal De meddele os Deres beslutning om at fortryde denne aftale i en utvetydig erklæring (f.eks. ved postbesørget brev eller e-mail). De kan kontakte os via e-mail påaccount-withdrawal@google.com, på telefon+353 1 533 9837(setelefonnumre for de enkelte lande nedenfor) eller ved at skrive til os på adressen Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland. De kan benytte den vedhæftede standardfortrydelsesformular, men det er ikke obligatorisk. De har også mulighed for at udfylde og indsende fortrydelsesformularen eller en hvilken som helst anden utvetydig meddelelse via vores hjemmeside (g.co/EEAWithdrawalForm). Hvis De anvender denne mulighed, kvitterer vi omgående på et varigt medium (f.eks. pr. e-mail) for modtagelse af en sådan meddelelse om udøvelse af fortrydelsesretten.",
    "Fortrydelsesfristen er overholdt, hvis De sender Deres meddelelse om udøvelse af fortrydelsesretten, inden fortrydelsesfristen er udløbet.",
    "Følger af fortrydelse",
    "Hvis De udøver Deres fortrydelsesret i denne aftale, refunderer vi Dem alle betalinger modtaget fra Dem, herunder leveringsomkostninger (dog ikke ekstra omkostninger som følge af Deres eget valg af en anden leveringsform end den billigste form for standardlevering, som vi tilbyder) uden unødig forsinkelse og under alle omstændigheder senest 14 dage fra den dato, hvor vi har modtaget meddelelse om Deres beslutning om at fortryde denne aftale. Vi gennemfører en sådan tilbagebetaling med samme betalingsmiddel, som De benyttede ved den oprindelige transaktion, medmindre De udtrykkeligt har indvilget i noget andet. Under alle omstændigheder pålægges De ingen former for gebyrer som følge af tilbagebetalingen.",
    "Standardfortrydelsesformular",
    "(denne formular udfyldes og returneres kun, hvis fortrydelsesretten gøres gældende)",
    "— Til Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland,account-withdrawal@google.com:",
    "— Jeg meddeler herved, at jeg ønsker at gøre fortrydelsesretten gældende i forbindelse med min købsaftale om levering af følgende tjenesteydelser, _____________",
    "— Bestilt den, _____________",
    "— Forbrugerens navn, _____________",
    "— Forbrugerens adresse, _____________",
    "— Forbrugerens underskrift (kun hvis formularens indhold meddeles på papir), _____________",
    "— Dato _____________",
    "Kontakt Google for at trække dit samtykke til disse vilkår tilbage",
    "Definitioner",
    "ansvar",
    "Tab, der skyldes enhver form for juridisk krav, uanset om kravet er baseret på en kontrakt, erstatningsret (herunder uagtsomhed) eller andre årsager, og uanset om disse tab med rimelighed kunne være forventet eller forudset.",
    "ansvarsfraskrivelse",
    "En erklæring, der begrænser en persons juridiske ansvar.",
    "dit indhold",
    "Ting, som du opretter, uploader, indsender, gemmer, sender, modtager eller deler ved hjælp af vores tjenester, f.eks.:",
    "erhvervsbruger",
    "En enkeltperson eller en part, der ikke er en forbruger (se forbruger).",
    "EU's P2B-forordning",
    "Forordningen (EU) 2019/1150 om fremme af retfærdighed og gennemsigtighed for brugere af onlineformidlingstjenester.",
    "forbruger",
    "En enkeltperson, der bruger Google-tjenester til private, ikke kommercielle formål uden for deres erhverv, virksomhed, fag eller profession. Dette omfatter “forbrugere” som defineret iartikel 2.1 i EU's direktiv om forbrugerrettigheder. (Se erhvervsbruger)",
    "garanti",
    "En forsikring om, at et produkt eller en tjeneste lever op til en vis standard.",
    "holde skadesløs eller skadesløsholdelse",
    "En enkeltperson eller organisations kontraktlige forpligtelse til at kompensere de tab, en anden enkeltperson eller organisation har lidt som følge af juridiske processer, f.eks. retssager.",
    "immaterielle rettigheder",
    "Rettigheder over værker, der stammer fra en persons tankevirksomhed som f.eks. opfindelser (patentrettigheder), litterære værker og kunstværker (ophavsret), design (designrettigheder) samt symboler, navne og billeder anvendt inden for handel (varemærker). Immaterielle rettigheder kan tilhøre dig, en anden enkeltperson eller en organisation.",
    "juridisk garanti",
    "En juridisk garanti er et krav i henhold til lovgivningen om, at en sælger eller forhandler er ansvarlig, hvis sælgerens eller forhandlerens digitale indhold, tjenester eller varer er defekte (dvs. i tilfælde afmanglende overensstemmelse).",
    "kommerciel garanti",
    "En kommerciel garanti er en frivillig aftale, der fungerer som tillæg til denlovbestemte garantifor overensstemmelse. Den virksomhed, der tilbyder den kommercielle garanti, accepterer at (a) levere visse tjenester eller (b) udføre reparation, udskifte med en erstatningsenhed eller refundere forbrugeren i tilfælde af defekte varer.",
    "landeversion",
    "Hvis du har en Google-konto, knytter vi din konto til et land (eller område), så vi kan fastslå:",
    "Hvis du er logget ud, fastslås din landeversion ud fra det sted, hvor du bruger Google-tjenester. Hvis du har en konto, kan dulogge indog se disse vilkår for at finde ud af, hvilket land kontoen er tilknyttet.",
    "manglende overensstemmelse",
    "Et juridisk begreb, der definerer forskellen mellem den måde, noget burde fungere på, og hvordan det reelt fungerer. Hvordan noget burde fungere er i henhold til loven baseret på, hvordan sælgeren eller forhandleren beskriver det, om kvaliteten og ydeevnen er tilfredsstillende, samt dets egnethed til typiske formål for sådanne varer.",
    "ophavsret",
    "En juridisk rettighed, der giver skaberen af et originalt værk (f.eks. et blogindlæg, et billede eller en video) mulighed for at bestemme, om og hvordan det originale værk kan bruges af andre, underlagt visse begrænsninger og undtagelser.",
    "organisation",
    "En juridisk enhed (f.eks. en virksomhed, nonprofitorganisation eller skole) og ikke en enkeltperson.",
    "tilknyttet virksomhed",
    "En enhed, der tilhører Google-koncernen, hvilket betyder Google LLC og dets datterselskaber, herunder følgende virksomheder, der leverer forbrugertjenester i EU: Google Ireland Limited, Google Commerce Limited og Google Dialer Inc.",
    "tjenester",
    "De Google-tjenester, der er underlagt disse vilkår, omfatter de produkter og tjenester, der er angivet påhttps://policies.google.com/terms/service-specific, herunder:",
    "Mange af disse tjenester omfatter også indhold, som du kan streame eller interagere med.",
    "varemærke",
    "Symboler, navne og billeder anvendt inden for handel, der kan adskille de varer eller tjenester, der tilhører en enkeltperson eller organisation, fra de varer eller tjenester, der tilhører andre."
  ],
  "https://accounts.google.com/ServiceLogin?hl=da&cd=DK&continue=https://www.google.dk/maps/place/DR%2BByen/@55.6575405,12.5883767,17z/data%3D!3m1!4b1!4m5!3m4!1s0x46525344ff8006ab:0xbed637785cba1f24!8m2!3d55.6575405!4d12.5905654?shorturl%3D1%26shorturl%3D1&gae=cb-eomtm": [
    "Log ind",
    "Brug din Google-konto",
    "",
    "Har du glemt mailadressen?",
    "Er det ikke din computer? Log ind via et privat browservindue.Få flere oplysninger om, hvordan du bruger gæstetilstand"
  ],
  "https://consent.google.dk/dl?continue=https://www.google.dk/maps/place/DR%2BByen/@55.6575405,12.5883767,17z/data%3D!3m1!4b1!4m5!3m4!1s0x46525344ff8006ab:0xbed637785cba1f24!8m2!3d55.6575405!4d12.5905654?shorturl%3D1%26shorturl%3D1&gl=DK&hl=da&cm=2&pc=m&uxe=eomtm&src=1": [
    "Indstillinger for personlig tilpasning og cookies",
    "Vi brugercookiestil at levere og vedligeholde Google-tjenester, registrere tjenesteudfald og beskytte mod spam, svindel og misbrug samt måle målgruppeengagement og indsamle websitestatistik med henblik på at forstå, hvordan vores tjenester bruges, samt forbedre kvaliteten af de pågældende tjenester. Vi bruger cookies til at understøtte indstillinger for personlig tilpasning, der giver dig mulighed for at vælge, hvordan du bruger Google – også selvom du er logget ud.",
    "Søgetilpasning",
    "Få mere relevante resultater og anbefalinger ved at bruge tidligere Google-aktivitet fra denne browser.",
    "Personlig tilpasning af annoncer i Søgning",
    "Tillad, at Google viser personligt tilpassede annoncer i Søgning, som er baseret på tidligere aktivitet, f.eks. det, du har søgt efter på Google.",
    "Administration af cookies i din browser",
    "Cookies giver websites mulighed for at forbedre din internetoplevelse. For eksempel hjælper cookies websitet med at huske dit valg, når du angiver et standardsprog for et website.",
    "Du kan blokere nogle eller alle cookies, men dette kan medføre, at visse funktioner på nettet holder op med at fungere. For eksempel kræver mange websites, at cookies er slået til, når du vil logge ind. Sådan administrerer du cookies i Chrome:",
    "Gå til Hjælp for at få oplysninger om andre browsere.",
    "Administration af de data, Google Analytics indsamler om de websites, du besøger",
    "Websiteejere anvender de data, der indsamles af Google Analytics, til at optimere deres websites. Du kan fravælge denne dataindsamling ved atdownloade og installere en browsertilføjelse.",
    "Hvis du aktiverer dine indstillinger for personlig tilpasning, bruger Google cookies til at vise dig tilpasset indhold og personligt tilpassede annoncer (afhængigt af dine valg). Medmindre du vælger \"Afvis alle\", bruger Google også cookies til at levere og måle effektiviteten af annoncer samt udvikle og forbedre nye tjenester.",
    "Du kan til enhver tid ændre dine indstillinger ved at gå til g.co/privacytools/dk. Du kan også gennemgå voresprivatlivspolitikfor at se, hvordan Google bruger oplysninger, der genereres, mens du bruger Google-tjenester.Få flere oplysninger."
  ],
  "https://developer.chrome.com/docs/extensions": [
    "Welcome to Extensions!",
    "Migrate to Manifest V3",
    "What is Manifest V3?",
    "Rollout timeline",
    "Known issues when migrating to Manifest V3",
    "What's New",
    "Chrome 128: Response header matching in Declarative Net Request",
    "Chrome 127: New action.openPopup API",
    "Blog post: Manifest V2 phase-out begins",
    "Video: Trust & Safety team interview",
    "Extend the web",
    "Customize the user interface",
    "Modify and observe the browser",
    "Modify and observe the web",
    "Extensions on YouTube",
    "What are content scripts?",
    "What is a Remote Hosted Code?",
    "Behind the Chrome Web Store: Asking Trust & Safety your questions",
    "Extensions in action",
    "Action API demo",
    "UserScript API demo",
    "Scripting API demo",
    "SidePanel API demo",
    "Documentation",
    "Get started",
    "Develop",
    "How-to",
    "Reference",
    "Extensions posts",
    "Support and feedback",
    "Get help with Chrome Extensions",
    "File a bug",
    "Request a feature",
    "Find and follow a bug report",
    "Contribute",
    "Related content",
    "Follow"
  ],
  "https://developers.google.com/community/gdsc": [
    "Google Developer Student Clubs",
    "Connect",
    "Learn",
    "Grow",
    "“Showing more representation in tech with GDSC greatly increases our confidence, innovation, and performance. Especially in academic environments, having a sense of belonging and community for students can lead to success in tech together.”",
    "Chloe QuijanoGDSC Lead, University of Toronto",
    "Find a chapter",
    "Our community guidelines",
    "Stories from the community",
    "Meet the student leaders building apps using Google technology",
    "Creating a STEM culture on campus in Uganda",
    "Meet Rose Niousha, GDSC Waseda Founder & WTM Ambassador",
    "Google Developer Student Clubs Leads",
    "GDSC Spotlight: A conversation with GDSC lead, Evolone Layne",
    "FAQs",
    "Who should join Google Developer Student Clubs?",
    "College and university students are encouraged to join Google Developer Student Clubs.",
    "Can I join multiple chapters?",
    "You can participate in events organized by multiple chapters, however if you decide to dedicate yourself to become a GDSC Lead or Core Team Member, you will be officially assigned to one chapter.",
    "What does a GDSC lead do?",
    "In general, GDSC leaders are focused on the following areas:Start a club- Work with your university or college to start a student club. Select a core team and faculty advisor to support.Host workshops- Grow student knowledge on developer products and platforms through hands-on workshops and events.Build projects- Identify local partners to work with and lead project building activities.",
    "Who can lead a club?",
    "There are a few things we look for when selecting club leaders. If you fit this description, we welcome your application.Students who are at least 18 years old.A minimum of one year left until graduation.Enrollment in an undergraduate or graduate program at a college or university.Can commit to the program for one year.Passionate about creating impact in their community.Strong technical understanding of computer programming and/or software engineering.Experience with event planning or leading a team.Some connection to the local developer community.Available to host an event ideally once a month, and at least every 3 months.",
    "How do I apply to become a club leader?",
    "There are a few steps you need to take to apply to be an organizer.See if there’s a currentGoogle Developer Student Clubon your campus or near you. We encourage you to participate or even help organize an event to gain practical experience!Read thecommunity guidelines.Submit your GDSC Leadapplication.We'll review your submission and get back to you via email as soon as possible.",
    "What are the benefits of becoming a GDSC lead?",
    "There are a number of benefits to leading a GDSC chapter, but here are a few that stand out:Professional growth- Access to community management training and technical knowledge to help you be a stronger leader, and receive invitations to select Google events.Network growth- Access to a global network of student leaders, professional community organizers, industry experts, and Googlers to gain mentorship and share knowledge.Community learning- Dedicated support to help educate and expand your community online and in-person.",
    "What is the time commitment?",
    "GDSC Leads should be available to run an event ideally once a month, and at least every three months to remain an active GDSC chapter. Additionally, running a GDSC is a one year commitment.",
    "What is the timeline for applying for the GDSC Lead position?",
    "We accept applications once per year, between April and August. Please followthis pagefor the new deadlines and theGDSC events platformto check current chapters.",
    "Stay in touch",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://makersuite.google.com/": [
    "Get started with theGeminiAPI",
    "Google AI Studio is the fastest way to start building with Gemini, our next generation family of multimodal generative AI models.",
    "Try the 2 million token context window",
    "Explore what is possible with the 2 million token context window.",
    "Get a Gemini API Key",
    "Grab your API key and start integrating Gemini models into your apps.",
    "Prompt Gallery",
    "Visit our prompt gallery for examples of what's possible with Gemini models."
  ],
  "https://developer.android.com/studio": [
    "Android Studio",
    "Get the official Integrated Development Environment (IDE) for Android app development.",
    "Download Not AvailableYour current device is not supported.See the system requirements.",
    "Your current device is not supported.See the system requirements.",
    "Read release notes",
    "New features",
    "Try Gemini in Android Studio",
    "Gemini in Android Studio is an AI assistant that helps you generate code, fix code, and answer questions about Android app development. Available in Android Studio Jellyfish.",
    "",
    "Android Studio in your web browser",
    "Try Android Studio on IDX, a convenient way to open up samples, or an existing Android\n  app project on GitHub in your web browser. Join the early access preview program to try\n  it.",
    "",
    "Core features",
    "Compose design tools",
    "Intelligent code editor",
    "Flexible build system",
    "Powered by Gradle, Android Studio's build system lets you to customize your build to generate multiple build variants for different Android devices from a single project. Then analyze the performance of your builds and understand where potential build issues exist in your project with the Build Analyzer.",
    "",
    "Easily emulate any device",
    "The Android Emulator lets you to test your application on a variety of Android devices. Unlock the full potential of your apps by using responsive layouts that adapt to fit phones, tablets, foldables, Wear OS, TV and ChromeOS devices.",
    "Android App Bundle",
    "Get started with Android Studio",
    "Getting started",
    "Install Android Studio",
    "Build your first app",
    "Configure Android Studio",
    "Training for beginners and pros",
    "Android Studio downloads",
    "Download the latest version of Android Studio. For more information, see theAndroid Studio\n  release notes.",
    "More downloads are available in thedownload archives. For\n  Android Emulator downloads, see theEmulator download archives.",
    "Command line tools only",
    "Command-line tools are included in Android Studio. If you do not need Android Studio,\n  you can download the basic Android command-line tools above. You can use the includedsdkmanagerto download other SDK packages.",
    "Recent videos",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "android-studio-2024.1.2.13-linux.tar.gz",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "android-studio-2024.1.2.13-cros.deb",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "android-studio-2024.1.2.13-mac.dmg",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "android-studio-2024.1.2.13-mac_arm.dmg",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "Select the version of Android Studio that’s right for your Mac:",
    "Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "android-studio-2024.1.2.13-mac.dmg",
    "android-studio-2024.1.2.13-mac_arm.dmg",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "android-studio-2024.1.2.13-windows.zip",
    "Download Android Studio Koala Feature Drop | 2024.1.2 Patch 1",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "android-studio-2024.1.2.13-windows.exe",
    "Download Android Command Line Tools",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "commandlinetools-linux-11076708_latest.zip",
    "Download Android Command Line Tools",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "commandlinetools-mac-11076708_latest.zip",
    "Download Android Command Line Tools",
    "Before downloading, you must agree to the following terms and conditions.",
    "Terms and Conditions",
    "1. Introduction",
    "2. Accepting this License Agreement",
    "3. SDK License from Google",
    "4. Use of the SDK by You",
    "5. Your Developer Credentials",
    "6. Privacy and Information",
    "7. Third Party Applications",
    "8. Using Android APIs",
    "9. Terminating this License Agreement",
    "10. DISCLAIMER OF WARRANTIES",
    "11. LIMITATION OF LIABILITY",
    "12. Indemnification",
    "13. Changes to the License Agreement",
    "14. General Legal Terms",
    "commandlinetools-win-11076708_latest.zip",
    "More Android",
    "Discover",
    "Android Devices",
    "Releases",
    "Documentation and Downloads",
    "Support"
  ],
  "https://console.home.google.com": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://developers.google.com/google-ads": [
    "Google Ads",
    "Google Ads App Promotion",
    "Google Shopping",
    "Google Ads API and Google Ads scripts",
    "Webhook",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://console.developers.google.com": [
    "Sign in",
    "to continue to Google Cloud Platform",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://developer.chrome.com": [
    "A Powerful Web.Made Easier.",
    "Thanks for tuning in to Google I/O 2024",
    "Participate in our built-in AI experiment",
    "What's New in DevTools (Chrome 129)",
    "Get Inspired",
    "Learn how modern web technology can help you succeed",
    "Features, tools and programs to make developers successful on the web.",
    "Powerful platform capabilities",
    "Solutions for quality experiences",
    "Productivity made easier",
    "Open by design",
    "Always updating",
    "Chrome 130 beta",
    "Chrome 129 stable",
    "Docs",
    "Chrome DevTools",
    "Extensions",
    "Chrome Web Store",
    "Web Platform",
    "Connect with the team",
    "Chrome for Developers on X",
    "Chrome for Developers on YouTube",
    "Chrome for Developers on LinkedIn",
    "Contribute",
    "Related content",
    "Follow"
  ],
  "https://flutter.dev": [
    "Build for any screen",
    "Flutter transforms the development process. Build, test, and deploy beautiful mobile, web, desktop, and embedded experiences from a single codebase.",
    "Flutter is an open source framework for building beautiful, natively compiled, multi-platform applications from a single codebase.",
    "Fast",
    "Flutter code compiles to ARM or Intel machine code as well as JavaScript, for fast performance on any device.",
    "Productive",
    "Build and iterate quickly with Hot Reload. Update code and see changes almost instantly, without losing state.",
    "Flexible",
    "Control every pixel to create customized, adaptive designs that look and feel great on any screen.",
    "Multi-Platform",
    "Reach users on every screen",
    "Deploy to multiple devices from a single codebase: mobile, web, desktop, and embedded devices.",
    "Developer Experience",
    "Transform your workflow",
    "Take control of your codebase with automated testing, developer tooling, and everything else you need to build production-quality apps.",
    "Stable & Reliable",
    "Trusted by many",
    "Flutter is supported and used by Google, trusted by well-known brands around the world, and maintained by a community of global developers.",
    "Flutter and Google",
    "Seamless integration with Google services",
    "Connect to Google's app development ecosystem, allowing you to streamline development and reach a wider audience through seamless integration with Firebase, Google Ads, Google Play, Google Pay, Google Wallet, Google Maps, and more.",
    "Developer Story",
    "See how Google Pay uses Flutter to change the world of mobile payments",
    "A Global Open Source Community",
    "Supported by Google, open to everyone",
    "Collaborate on the open source framework, contribute to the package ecosystem on pub.dev, and find help when you need it.",
    "Dart",
    "Flutter is powered by Dart, a language optimized for fast apps on any platform",
    "Latest news",
    "Announcing Flutter 3.24 and Dart 3.5",
    "What’s new in Flutter 3.24",
    "Announcing Dart 3.5",
    "Getting started with Flutter GPU",
    "Sharing Flutter’s 2024 roadmap",
    "Join ournewsletter",
    "Keep up with the latest Flutter news, releases, and more:",
    "You're in!",
    "You have successfully signed up for the latest Flutter updates and announcements.",
    "Get started",
    "Instant access to the power of the Flutter framework",
    "NOTICE: Flutter hopes this directory is useful for customers seeking consultants with Flutter experience; however, Flutter makes no representation to you or anyone else that the listed consultants are Flutter or Google partners, and Flutter does not represent or warrant their qualifications or the quality of services you may receive.  Your relationship is strictly between you and the consultants."
  ],
  "https://developers.googleblog.com": [
    "Featured articles",
    "Use the Gemma language model to gauge customer sentiment, summarize conversations, and assist with crafting responses in near real-time with minimal latency.",
    "Purrfect Code is a sokoban style box pushing puzzler Purrfect based on Google tech (Flutter, IDX, FLAME, Firebase) and designed to be playable on web browsers. Open the game in Project IDX, earn badges for each level, and showcase your badges on your Developer Profile.",
    "Gemini 1.5 Flash is now available to developers at more than 70% lower prices. Set up billing for Gemini API in Google AI Studio and access other new features like 1.5 Flash tuning.",
    "ShieldGemma is a suite of safety content classifiers models built upon Gemma2 designed to keep users safe. GemmaScope is a new model interpretability tool that offers unparalleled insight into our models' inner workings.",
    "Latest blogs",
    "The new Picker API enables secure photo selection, while the Library API will focus on managing photos and videos uploaded by your application.",
    "PaliGemma, a lightweight open vision-language model (VLM), is able to take both image and text inputs and produce a text response, adding an additional vision model to the BaseGemma model.",
    "TensorFlow Lite, now named LiteRT, is still the same high-performance runtime for on-device AI, but with an expanded vision to support models authored in PyTorch, JAX, and Keras.",
    "AI",
    "Gemma explained: PaliGemma architecture",
    "TensorFlow Lite is now LiteRT",
    "Gemma explained: RecurrentGemma architecture",
    "Gemma explained: What’s new in Gemma 2",
    "Gemma for Streaming ML with Dataflow",
    "Gemma explained: An overview of Gemma model family architectures",
    "Gemini 1.5 Flash price drop with tuning rollout complete, and more",
    "Smaller, Safer, More Transparent: Advancing Responsible AI with Gemma",
    "Introducing Genkit for Go: Build scalable AI-powered apps in Go",
    "Mobile",
    "Indie Games Fund: Google Play’s $2m fund in Latin America is back",
    "Streamlining LLM Inference at the Edge with TFLite",
    "Model Explorer: Simplifying ML models for Edge devices",
    "AI Edge Torch Generative API for Custom LLMs on Device",
    "Everything you need to know about Google Wallet",
    "Welcome India to the Google Wallet API",
    "AI Edge Torch: High Performance Inference of PyTorch Models on Mobile Devices",
    "Project Gameface launches on Android",
    "What's new in Firebase at  I/O '24",
    "Web",
    "Updates to the Google Photos APIs: Picker API launch and Library API changes",
    "How We Built Purrfect Code: A Puzzle Game for Developers",
    "The power of Checks is now available to all Android and iOS Developers",
    "Making development across platforms easier for developers",
    "Achieving privacy compliance with your CI/CD: A guide for compliance teams",
    "Federated Credential Management (FedCM) Migration for Google Identity Services",
    "Bazel 7 Release",
    "Updates to Google Identity Services (GIS) and migration to the Credential Manager A…",
    "Password manager Dashlane sees 70% increase in conversion rate for signing-in with …",
    "Cloud",
    "Mastering Controlled Generation with Gemini 1.5: Schema Adherence for Developers",
    "Build a text-based adventure game with Gemma 2",
    "Enabling more private generative AI",
    "Get started with Gemma on Ray on Vertex AI",
    "Google AR at I/O 2024: New Geospatial AR features and more",
    "Home APIs: Enabling all developers to build for the home",
    "Build with Google AI video series, Season 2: more AI patterns",
    "Google Cloud Next '24 session library is now available",
    "Create smart chips for link previewing in Google Docs",
    "Subscribe to join a community of creative developers and learn the latest in Google technology.",
    "Follow and discover developer resources, community events, and inspirational stories.",
    "Join a community of creative developers and learn how to use the latest in technology.",
    "Subscribe to Google for Developers news. Your information will be used in accordance with Google’s privacy policy."
  ],
  "https://checks.google.com/": [
    "Simplifycompliancewith Google",
    "Discover anâ\u0080¨easier path to compliancewith AI",
    "Checks takes the guesswork out of building safer products by bringing privacy \nand engineering teams together through automated analysis.",
    "Trusted by leading app developers",
    "Automated analysis and",
    "end-to-end monitoring",
    "Monitor your appâ\u0080\u0099s compliance with ease",
    "Monitor your appâ\u0080\u0099s compliance with ease",
    "Use Checks to keep tabs on how your app and your SDKs share data and comply with regulations.",
    "Compliance across the development lifecycle",
    "Compliance across the development lifecycle",
    "Checks meets you where you work, weaving privacy expertise into your existing CI/CD pipelines, repositories, and more.",
    "Get instant visibility into code",
    "Get instant visibility into code",
    "Understand how changes to your code and SDKs impact privacy in your product.",
    "Launch generative AI models confidently",
    "Launch generative AI models confidently",
    "Develop and monitor apps with generative AI that align with your custom policies, responsible AI principles and future regulations.",
    "What customers are saying",
    "A safer digitalecosystemfor all",
    "Helping developers balance the demands of creating delightful app experiences and honoring end usersâ\u0080\u0099 privacy rights forms the foundation of a safer digital ecosystem.",
    "Startsimplifyingcompliancetoday",
    "Join the growing list of app developers who rely on Checksâ\u0080¨and get your first report in minutes"
  ],
  "https://www.youtube.com/user/GoogleDevelopers": [],
  "https://cloud.google.com/developers": [
    "Innovate faster with enterprise-ready AI, enhanced by Gemini modelsTry Gemini in Vertex AI.",
    "Google Cloud Developer Center",
    "Access resources, learn in-demand skills, build solutions with real sample code, and\n                connect with a global community of developers",
    "Experience the new way to cloud",
    "What's new in Google Cloud and Google Workspace",
    "Google Cloud: The new way to cloud",
    "Build AI-powered Gemini + Google Workspace solutions",
    "Start building with Google Cloud",
    "Build intelligent apps using your favorite programming languages leveraging\n                    Google Cloud APIs/SDKs and code samples",
    "Compute APIs",
    "Quickly build and deploy applications using compute APIs such as Cloud Run Admin, Compute Engine, Kubernetes Engine, App Engine Admin APIs, and more",
    "Database and storage APIs",
    "Discover APIs for Bigtable, Datastore, Spanner, Cloud SQL, Cloud Storage, and Storage transfer to automatically manage your workflows",
    "Data analytics APIs",
    "Access your favorite data analytics APIs for BigQuery, Dataflow, Dataproc, Pub/Sub, and more",
    "Machine learning APIs",
    "Use machine learning APIs including AutoML, Vision, Speech-to-Text, Natural Language APIs, and more to accelerate application development",
    "Operations APIs",
    "Quickly access operations APIs for integrated monitoring, logging, and trace services",
    "Security APIs",
    "Manage security and identity to meet your policy, regulatory, and business needs",
    "Vertex AI",
    "Access Vertex AI code samples to build and deploy ML models faster",
    "BigQuery",
    "Access BigQuery code samples to unlock insights with petabyte-scale analysis and built-in ML",
    "Cloud Run",
    "Access Cloud Run code samples for containerized apps written in Go, Python, Java,Node.js, .NET, and Ruby",
    "GKE",
    "Access GKE code samples to get to market faster with the lowest TCO on the most scalable and automated Kubernetes platform",
    "Cloud SQL",
    "Access Cloud SQL code samples to set up, manage, and administer relational databases such as PostgreSQL, MySQL, and SQL Server",
    "Cloud IAM",
    "Access Cloud IAM code samples for fine-grained access control and visibility across all your Google Cloud resources",
    "Personalize your experience",
    "Get the best of Google Cloud. Google Developer Profile is a way to learn\n                    about Google technologies and unlock achievements. Your profile captures your\n                    achievements with badges and saves your progress as you complete pathways,\n                    which include codelabs and videos.",
    "Access your Google Cloud toolkit",
    "Jump Start Solutions",
    "Access click-to-deploy sample applications and infrastructure best practices\n                    right in the Google Cloud Console.",
    "Deploy a dynamic website",
    "Build a dynamic website leveraging responsive web frameworks and\n                            familiar languages",
    "Deploy load-balanced managed virtual machines (VM)",
    "Create a VM with a load balancer, scale automatically, and efficiently\n                            manage traffic",
    "Create a log analytics pipeline",
    "Build a data pipeline that analyzes various data and logs of\n                            applications running across different environments",
    "Deploy a secure CI/CD pipeline",
    "Set up a secure CI/CD pipeline that follows building, scanning, storing,\n                            and deploying containers best practices",
    "Cloud architectures",
    "Discover reference architectures and best practices for your Google Cloud\n                    projects",
    "Application development",
    "Quickly build apps that scale no matter the load with Google Cloud\n                            application development reference architectures, tutorials, and more",
    "AI and Machine Learning",
    "Use these AI and machine learning reference architectures, tutorials,\n                            and more to deploy high quality AI solutions",
    "Security and IAM",
    "Browse featured IAM and security resources including reference\n                            architectures, tutorials, and more",
    "Grow your skills",
    "Gain new cloud skills and demonstrate your expertise",
    "Google Cloud tutorials",
    "Try out Google Cloud products with step-by-step product quickstarts,\n                            tutorials, or interactive walkthroughs",
    "Google Cloud Skills Boost",
    "Get hands-on experience through interactive labs and accelerate your\n                            cloud learning with Google Cloud Skills Boost",
    "Google Cloud Certification",
    "Show off your cloud expertise and skills with Google Cloud\n                            certifications and advance your career at the same time",
    "Get with the program",
    "Join the community of Google Cloud developers and get exclusive access to learning\n                  opportunities, get help from experts, and connect globally with developers like\n                  yourself.",
    "Innovators program",
    "Join Innovators to get access to exclusive offers to help you learn, grow,\n                        and build with Google Cloud including roadmap presentations, access to\n                        experts, exclusive content, and more.",
    "Innovators Plus",
    "Accelerate your cloud career with the developer benefits included in\n                        Innovators Plus. Get access to over $1,500 worth of benefits for just $299\n                        USD through Innovators Plus.",
    "Connect with Google Cloud experts",
    "Developer Advocates",
    "Get to know the Googlers here to support you on your cloud journey.",
    "Champion Innovators",
    "Connect with a community of technical and thought leaders from the Google Cloud\n                  Innovators program.",
    "Stay in the know",
    "Event",
    "GopherCon Israel 2023Learn more",
    "Event",
    "Google Cloud NextWatch now",
    "Event",
    "PyCon Ghana 2022Learn more",
    "Worldwide events",
    "Explore upcoming developer and community events and don't miss out on the\n                opportunity to learnabout Google Cloud and connect developers like you.",
    "September 24, 2024 09:00 am PDT",
    "Gemini at Work",
    "September 24, 2024 10:00 am - 12:45 pm PDT",
    "Gen AI for Angular Developers",
    "September 24, 2024  10:00 am - 5:00 pm PDT",
    "Google Cloud Live: LA",
    "September 25, 2024 11:00 am - 12:00 pm PDT",
    "RAG Revolution: Make Context Simple with Vertex AI",
    "October 1, 2024 12:30 pm - 4:30 pm PDT",
    "LLMs, APIs, and Connectors: Making GenAI Come to Life",
    "October 3, 2024  10:00 am - 5:00 pm PDT",
    "Google Cloud Live: Bay Area",
    "October 8, 2024 9:00 AM  - 11:00 AM  PDT",
    "Global Google Cloud Startup Summit",
    "October 8, 2024  10:00 am - 5:30 pm EDT",
    "Google Cloud Live: New York",
    "October 10, 2024 9:00 AM  - 11:00 AM  GMT +1",
    "EMEA Google Cloud Startup Summit",
    "October 16, 2024 11:00 am - 12:00 pm PDT",
    "Mastering Google SecOps Detections",
    "October 23, 2024 11:00 am - 12:00 pm PDT",
    "Countdown to KubeCon + CloudNativeCon North America 2024 with Google",
    "Google Cloud Weeklies | Big ideas in byte-sized sessions",
    "Community",
    "Get to know the Google Cloud community by meeting, networking, and hearing from\n              inspiring community members around the world.",
    "Choosing the right VM: a quick guide",
    "This blog explores VM selection in detail by following 4 easy steps to get up and running on Compute Engine in no time.",
    "Additional resources",
    "Google Cloud Cheat Sheet",
    "Google Cloud products, features, and services in four words or less. Use our\n                      dynamic cheat sheet to quickly navigate to product pages, documentation and\n                      learning resources.",
    "Get started with Google Cloud",
    "#Cloudbytes - product videos in a minute",
    "Build your startup on Google Cloud",
    "Google Cloud for Students",
    "90 day, $300 free trial to Google Cloud",
    "Dive into Google Cloud Documentation",
    "Explore the Cloud Architecture Center",
    "Go to Cloud console",
    "Why Google",
    "Products and pricing",
    "Solutions",
    "Resources",
    "Engage"
  ],
  "https://developers.google.com/events": [
    "Featured events",
    "Join DevFest 2024",
    "",
    "The global distributed developer conference hosted by Google Developer Groups returns with\n  a focus on responsible AI. Join a local DevFest event for expert talks, hands-on workshops,\n  and networking.",
    "Upcoming events",
    "AI Gatherings - GenAI for Your Product",
    "September 26 (Mountain View) | In-person",
    "Connect with Google experts, top founders, and developers building AI startups and projects.\n  Learn about Google AI, try AI tools, and network.",
    "Google for Startups Founder Fridays",
    "September 27 (Mountain View) | October 25 (Montreal, Quebec) | In-person & online",
    "Join us and learn how AI revolutionizes product development. Join Founder Fridays in\n  Mountain View, Montreal, and online.",
    "Google Cloud Startup Summit",
    "October 8 | Online",
    "Ready to scale your startup’s AI capabilities? Join us to put the latest AI and cloud\n  technologies into action and find guidance from leading VCs that can help you accelerate your\n  startup’s journey.",
    "Tech Equity Collective Innovate",
    "October 28 - 29 (New York City) | In-person",
    "Join us at TEC Innovate, a two-day event at Google NYC, designed to equip aspiring\n  technologists with the skills, connections, and confidence to launch fulfilling tech careers.",
    "Recent events",
    "Google Workspace Developer Summit",
    "September 12 (Boston) / September 17 (Berlin) | In-person",
    "Join Google's Workspace Developer Relations team for a comprehensive day of learning and\n  development on September 12th (Boston) or September 17th (Berlin). Discover emerging\n  technologies within the Google Workspace platform and acquire the skills to build unique\n  solutions.",
    "Google for Startups Founder Fridays",
    "August 29 (Chicago) In-person & online",
    "Join us and learn how AI revolutionizes product development. Launch your startup faster using\n  pre-built AI APIs, integrate AI across your product, and navigate complexities of building AI\n  products.",
    "AI Gatherings in Chicago",
    "August 28 (Chicago) In-person",
    "Connect with top founders and developers building AI startups and projects. Learn about\n  Google AI, try AI tools, and network.",
    "Google Cloud Security Summit",
    "August 20 | Virtual",
    "Strengthen your cybersecurity with Google Cloud & Mandiant. Learn how to protect your\n  business from threats, leverage AI, and build secure cloud foundations. Additional events for\n  APAC & EMEA.",
    "Gemini API Developer Competition",
    "May 14 - August 11 | Virtual",
    "Build groundbreaking applications using Gemini models and compete for a chance to win an electric DeLorean and other exceptional prizes.",
    "Kaggle competitions",
    "Ongoing | Virtual",
    "Grow your skills like data science, machine learning, and large language models through Kaggle's exciting competitions. Explore both timely and ongoing options now.",
    "Directory of past events",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://developer.android.com/jetpack": [
    "Android Jetpack",
    "Develop UI with Compose",
    "Learn to use Jetpack",
    "Fundamentals Training",
    "Hands-on Tutorial",
    "Now in Android sample app",
    "Jetpack librariesExplore all libraries",
    "* Popular and often-used libraries are listed first",
    "What's new",
    "Why use Android Jetpack?",
    "Follow best practices",
    "Eliminate boilerplate code",
    "Reduce fragmentation",
    "News and videos",
    "Get involved with the Android Jetpack community",
    "Stack Overflow",
    "Issue tracker",
    "Android Developers Blog",
    "More Android",
    "Discover",
    "Android Devices",
    "Releases",
    "Documentation and Downloads",
    "Support"
  ],
  "https://chrome.google.com/webstore/developer/dashboard": [
    "Sign in",
    "to continue to Chrome Web Store",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://developers.google.com/community/gdg": [
    "Google Developer Groups",
    "Connect",
    "Learn",
    "Grow",
    "“GDG is made up of a very diverse group of people, countries, companies, and expertise. I think it adds value for anyone who is involved in these communities.”",
    "Cecilia CastilloGDG Organizer, Guatemala",
    "Find a chapter",
    "Stories from the community",
    "A conversation with Android developer and community builder, Ceren Tunay",
    "From developer to teacher: how a computer science professor found career support with Google Developer Groups",
    "South African developers build web application to help local athletes",
    "Google Developer Groups’ Organizers",
    "Google Developer Group Spotlight: A conversation with software developer Aditi Soni",
    "FAQs",
    "Who should join Google Developer Groups?",
    "Anyone who is interested in learning about Google's technologies, connecting with\n      other developers, and growing their skillset is encouraged to join Google Developer\n      Groups.",
    "Can I join multiple chapters?",
    "Yes, developers are able to join multiple chapters. To join a chapter, visit the\n      members site athttps://gdg.community.dev/.",
    "I don’t see a chapter near me, but I am still interested in\n      joining GDG. What can I do?",
    "If a nearby chapter doesn’t exist, you can apply to create new GDG chapter in your\n      city.Submit an application\n      todayto lead one in your area. See what it takes to be an organizer atGoogle Developer Groups Organizers.",
    "How can I sign up for a chapter event?",
    "Search the GDG event platform (https://gdg.community.dev/) for an event that\n      looks right for you.",
    "Is there a cost to join or start a new GDG Chapter?",
    "No, there is no cost to join a chapter or apply for a new GDG Chapter.",
    "Who can become an organizer?",
    "There are a few things we look for when selecting organizers. If you fit this\n      description, we welcome your application.",
    "How do I apply to become an organizer?",
    "There are a few steps you need to take to apply to be an organizer.",
    "What are the benefits of becoming a GDG organizer?",
    "There are a number of benefits to leading a GDG chapter, but here are a few that\n      stand out:",
    "What is the time commitment?",
    "To be an organizer, you should be available to host a meetup event ideally once a\n      month, and at least every 3 months to remain an active GDG chapter.",
    "Our community guidelines",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://www.techequitycollective.com": [
    "About",
    "Explore",
    "Partner",
    "Connect",
    "COLLECTIVELYACCELERATINGblackACCESS,Ambition ANDADVANCEMENTINTECH",
    "COLLECTIVELYACCELERATINGblackACCESS,AmbitionANDADVANCEMENTINTECH",
    "Weinitiateenergizing pathways into tech for Black people.",
    "Uncover Your Path",
    "PROGRAMS",
    "Tech Equity Collective Innovate",
    "TEC Innovate is an immersive event experience that equips aspiring technologists with the skills, connections, and confidence to enter into the tech industry. TEC Innovate leverages the expertise of Management Leadership for Tomorrow (MLT) to empower diverse talent to excel in their careers.",
    "PROGRAMS",
    "Tech Equity Collective Impact Fund",
    "The Tech Equity Collective Impact Fund provides financial and strategic support for organizations re-skilling and upskilling Black technical talent for opportunities in tech. Through $50,000 grants, expert-led workshops, and a robust network of industry partners, the Impact Fund unlocks resources for organizations to elevate Black technical talent. Learn more about the 2024 grantees today.",
    "PROGRAMS",
    "Tech Equity Collective Tech Prep",
    "Tech Equity Collective Tech Prep is a holistic career development program designed to support Black professionals looking to transition into technical roles. Through live and on-demand coaching sessions, playbooks, and workshops; participants will be equipped with the know-how to successfully navigate their career transition.",
    "EXPERIENCES",
    "10/08/22",
    "CultureCon NYC",
    "In Tech Equity Collectiveâ\u0080\u0099s CultureCon NYC panel, â\u0080\u008bâ\u0080\u008bâ\u0080\u009dBreaking into Tech as a Creative Talent\", the team spotlighted three Black trailblazers making impact at the intersection of technology and creativity. Check back soon to watch the recap and learn about their experiences as they navigated tech while making their mark on culture.",
    "PROGRAMS",
    "Black Women Techmakers",
    "Black Women Techmakers is a partnership with Women Techmakers and Tech Equity Collective that seeks to provide visibility, community, and resources for Black women in tech in order to build a world where all women can thrive in tech.",
    "RESOURCES",
    "Google Developer Student Clubs",
    "Community groups for college and university students interested in Google developer technologies. Students grow their knowledge in a peer-to-peer learning environment and build solutions for local businesses and their community.",
    "RESOURCES",
    "Google Cloud Certification",
    "Get hands-on experience and validate your ability to transform businesses with Google Cloud technology. Choose the certification thatâ\u0080\u0099s right for you with three different options based on your level of experience managing cloud enterprise solutions.",
    "RESOURCES",
    "Code with Google",
    "Get access to several programs aimed at building coding and technical skills that can unlock opportunities. Grow your practical computer science skills, build Android apps using Android Studio, take a machine learning crash course, learn to code on your phone, and so much more.",
    "We Âcreateexperiences that center Blackness and transform perspectives.",
    "Discover Tech Possibilities",
    "RESOURCES",
    "Google Developer Group",
    "Join a Google Developer Group to learn a range of technical topics and meet local like-minded developers from over 1,000 chapters across 140 countries. All are welcome, including those with unique backgrounds from various companies and industries.",
    "RESOURCES",
    "Google for Startups: Black Founders Fund",
    "The Google for Startups Black Founders Fund provides non-dilutive cash awards to Black led startups that have participated in our programs or have been nominated by our partner community or a previous recipient. Selected founders receive $100,000 in capital along with Google Cloud credits and hands-on support to help their startup grow.",
    "PROGRAMS",
    "Tech Exchange",
    "Tech Exchange is a  semester-long virtual academic program that teaches students applied computer science skills, offers 1:1 mentorship sessions, and builds social capital among Black+, Latinx+ and Native+ students at partner schools.",
    "EXPERIENCES",
    "06/17/22",
    "Something In The Water",
    "A weekend-long music festival and innovation summit where thought-leaders and creators come together to celebrate and accelerate Black+ innovation. Check out the video to see how we showed up to share the wealth of knowledge about the tech industry with the Black community. Spoiler alert â\u0080\u0094 we spoke on a panel, hosted a block party, and even launched an apparel pop-up.",
    "RESOURCES",
    "Code Next",
    "A free, computer science education program that meets Black+, Latinx+ and Native+ high school students in their own communities, helping to build skills needed for rewarding careers in computer science-related fields.",
    "RESOURCES",
    "Grow with Google",
    "Get access to training, tools, and resources to help you grow your skills, career, or business. Join nine million Americans who have already learned applied digital skills and earned certificates in topics like IT, data analytics, project management, UX design, and more.",
    "Weconvenecompanies and organizations to increase capacity for change at scale.",
    "Partner With Us",
    "Collective action inspires breakthroughsâ\u0080\u0094letâ\u0080\u0099s work together. We invite passionate tech companies and organizations to join us as TEC Advocates.",
    "Tap In With The Collective",
    "Stay connected to Tech Equity Collective (TEC) to learn more about upcoming programs, experiences and resources in tech.",
    "Follow us for the latest updates:",
    "",
    "Thank you for connecting!",
    "You've submitted the form successfully."
  ],
  "https://console.actions.google.com": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://aistudio.google.com/app/prompts/new_chat/?utm_source=gfd&utm_medium=referral&utm_campaign=top_bar&utm_content=": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://console.firebase.google.com": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://ai.google.dev/gemini-api/docs": [
    "Get started with the Gemini API",
    "Gemini 1.5 Flash",
    "2 million token context",
    "Natively multimodal",
    "Explore the Gemini API's capabilities",
    "Solve tasks with fine-tuning",
    "Call code with function calling",
    "Search and answer with embeddings",
    "Build apps with the Gemini API",
    "Build a code generator",
    "Build a data exploration agent",
    "Build a content search agent",
    "Start building with the Gemini API",
    "Except as otherwise noted, the content of this page is licensed under theCreative Commons Attribution 4.0 License, and code samples are licensed under theApache 2.0 License. For details, see theGoogle Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates.",
    "Last updated 2024-09-17 UTC."
  ],
  "https://www.womentechmakers.com": [
    "We’re building a world whereall womencan thrive in tech.",
    "Become anAmbassador.",
    "Become amember.",
    "2,674Ambassadors",
    "1,264Events",
    "1,353Speaking engagements",
    "82,500Members",
    "Stories from our community",
    "Meet Nhasala, Women Techmakers Ambassador in Kathmandu",
    "Black Women in Tech: A.M. Darke builds better\n        representation in gaming",
    "Learn UX writing with Google’s mortgage\n        calculator",
    "Meet Hanane Ait Dabel, Women Techmakers\n        Ambassador",
    "Conversational AI in 60 seconds!",
    "Getting a job in tech | WTM Spotlight",
    "Tanya Sam | Season 1 Founded Atlanta",
    "Women's Online Safety Hackathon - Dubai",
    "Stay connected",
    "Get your official Women Techmakers merchandise",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://console.cloud.google.com": [
    "Sign in",
    "to continue to Google Cloud Platform",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://idx.dev/": [
    "What if your dev experience was",
    "Welcome to Project IDX",
    "",
    "Project IDX is an AI-assisted workspace for full-stack, multiplatform app development in the cloud. With support for a broad range of frameworks, languages, and services, alongside integrations with your favorite Google products, IDX streamlines your development workflow so you can build and ship apps across platforms with speed, ease, and quality.",
    "Get to work quickly, wherever you are",
    "Project IDX gets you into your dev workflow in no time, backed by the security and scalability of Google Cloud. Go from opening your browser to building an application in a matter of seconds, not days.",
    "Develop with Gemini in IDX",
    "Work quickly and efficiently with built-in AI assistance from Gemini, Google’s largest and most capable AI model. Generate code, access inline coding suggestions, and get help understanding complex code in real time.",
    "Instantly access popular frameworks and languages",
    "Project IDX makes it easy to get started with a variety of templates for frameworks such as Angular, Astro, Flutter, Go, Next.js, Python/Flask, React, Svelte and more. You can alsocustomize your environment with Nixor import your existing applications from GitHub, with support for most tech stacks.And, with one-click integrations, you can effortlessly add popular Google APIs and services to your app for every stage of development.",
    "Optimize your apps across platforms",
    "Project IDX lets you preview your full-stack, multiplatform apps as your users would see them, with built-in web previews and Android emulators. And, with access to thousands of extensions, you can test and optimize your API endpoints and backend services.",
    "Let’s make the development workflow better, together",
    "While software development today is more accessible than ever before, it’s also more complicated.",
    "We’re constantly exploring additional ways to simplify and speed up your entire workflow, like richer collaboration tools, across environment sync, pair debugging, code review and more, all powered by Google’s latest AI technology.",
    "But we can't do this alone — we want to hear from you as we continue to update IDX and reimagine a better workflow to build, ship and manage apps. To try out Project IDX and give feedback, sign in with your Google Account below."
  ],
  "https://developers.google.com/womentechmakers": [
    "We’re building a world whereall womencan thrive in tech.",
    "Become anAmbassador.",
    "Become amember.",
    "2,674Ambassadors",
    "1,264Events",
    "1,353Speaking engagements",
    "82,500Members",
    "Stories from our community",
    "Meet Nhasala, Women Techmakers Ambassador in Kathmandu",
    "Black Women in Tech: A.M. Darke builds better\n        representation in gaming",
    "Learn UX writing with Google’s mortgage\n        calculator",
    "Meet Hanane Ait Dabel, Women Techmakers\n        Ambassador",
    "Conversational AI in 60 seconds!",
    "Getting a job in tech | WTM Spotlight",
    "Tanya Sam | Season 1 Founded Atlanta",
    "Women's Online Safety Hackathon - Dubai",
    "Stay connected",
    "Get your official Women Techmakers merchandise",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://googledevelopers.blogspot.com": [
    "Featured articles",
    "Use the Gemma language model to gauge customer sentiment, summarize conversations, and assist with crafting responses in near real-time with minimal latency.",
    "Purrfect Code is a sokoban style box pushing puzzler Purrfect based on Google tech (Flutter, IDX, FLAME, Firebase) and designed to be playable on web browsers. Open the game in Project IDX, earn badges for each level, and showcase your badges on your Developer Profile.",
    "Gemini 1.5 Flash is now available to developers at more than 70% lower prices. Set up billing for Gemini API in Google AI Studio and access other new features like 1.5 Flash tuning.",
    "ShieldGemma is a suite of safety content classifiers models built upon Gemma2 designed to keep users safe. GemmaScope is a new model interpretability tool that offers unparalleled insight into our models' inner workings.",
    "Latest blogs",
    "The new Picker API enables secure photo selection, while the Library API will focus on managing photos and videos uploaded by your application.",
    "PaliGemma, a lightweight open vision-language model (VLM), is able to take both image and text inputs and produce a text response, adding an additional vision model to the BaseGemma model.",
    "TensorFlow Lite, now named LiteRT, is still the same high-performance runtime for on-device AI, but with an expanded vision to support models authored in PyTorch, JAX, and Keras.",
    "AI",
    "Gemma explained: PaliGemma architecture",
    "TensorFlow Lite is now LiteRT",
    "Gemma explained: RecurrentGemma architecture",
    "Gemma explained: What’s new in Gemma 2",
    "Gemma for Streaming ML with Dataflow",
    "Gemma explained: An overview of Gemma model family architectures",
    "Gemini 1.5 Flash price drop with tuning rollout complete, and more",
    "Smaller, Safer, More Transparent: Advancing Responsible AI with Gemma",
    "Introducing Genkit for Go: Build scalable AI-powered apps in Go",
    "Mobile",
    "Indie Games Fund: Google Play’s $2m fund in Latin America is back",
    "Streamlining LLM Inference at the Edge with TFLite",
    "Model Explorer: Simplifying ML models for Edge devices",
    "AI Edge Torch Generative API for Custom LLMs on Device",
    "Everything you need to know about Google Wallet",
    "Welcome India to the Google Wallet API",
    "AI Edge Torch: High Performance Inference of PyTorch Models on Mobile Devices",
    "Project Gameface launches on Android",
    "What's new in Firebase at  I/O '24",
    "Web",
    "Updates to the Google Photos APIs: Picker API launch and Library API changes",
    "How We Built Purrfect Code: A Puzzle Game for Developers",
    "The power of Checks is now available to all Android and iOS Developers",
    "Making development across platforms easier for developers",
    "Achieving privacy compliance with your CI/CD: A guide for compliance teams",
    "Federated Credential Management (FedCM) Migration for Google Identity Services",
    "Bazel 7 Release",
    "Updates to Google Identity Services (GIS) and migration to the Credential Manager A…",
    "Password manager Dashlane sees 70% increase in conversion rate for signing-in with …",
    "Cloud",
    "Mastering Controlled Generation with Gemini 1.5: Schema Adherence for Developers",
    "Build a text-based adventure game with Gemma 2",
    "Enabling more private generative AI",
    "Get started with Gemma on Ray on Vertex AI",
    "Google AR at I/O 2024: New Geospatial AR features and more",
    "Home APIs: Enabling all developers to build for the home",
    "Build with Google AI video series, Season 2: more AI patterns",
    "Google Cloud Next '24 session library is now available",
    "Create smart chips for link previewing in Google Docs",
    "Subscribe to join a community of creative developers and learn the latest in Google technology.",
    "Follow and discover developer resources, community events, and inspirational stories.",
    "Join a community of creative developers and learn how to use the latest in technology.",
    "Subscribe to Google for Developers news. Your information will be used in accordance with Google’s privacy policy."
  ],
  "https://developers.google.com/solutions/catalog": [
    "Innovate faster",
    "Experimenting with Gemini?",
    "Getting started with the Gemini API and Dart and Flutter",
    "Learn how to use the Gemini API and the Google AI Dart SDK to prototype\ngenerative AI in Dart and Flutter applications.",
    "Leveraging the Gemini Pro Vision model for image understanding, multimodal\nprompts and accessibility",
    "Learn how to use the multimodal features of the Gemini model to\nanalyze HTML documents and image files for the purpose of adding accessible descriptions to a webpage in a NodeJS script.",
    "Getting started with the Gemini API and Android",
    "Learn how to use the Gemini API and the Google AI SDK to prototype generative\n          AI in Android applications.",
    "Getting started with the Gemini API and Swift",
    "Learn how to use the Gemini API and the Google AI Swift SDK to prototype\n          generative AI with Swift.",
    "Getting started with the Gemini API and Web Apps",
    "Learn how to use the Gemini API and the Google AI JavaScript SDK\nto prototype generative AI for web apps.",
    "Build with Google AI",
    "Example prompts and code for the Google AI Gemini API and the Vertex AI Gemini\n          API.",
    "Have a specific challenge?",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://accounts.google.com/ServiceLogin?continue=https://developers.google.com/_d/return%3Fcontinue%3Dhttps%253A%252F%252Fdevelopers.google.com%252Fnewsletter%252Fsubscribe": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://developer.android.com/distribute/": [
    "Google Play",
    "Reach",
    "Security",
    "Monetization",
    "Quality",
    "Find tools to help with trust, safety, and more",
    "Play Integrity API",
    "Develop Android Games",
    "Reporting API",
    "SDK Index",
    "Play Billing APIs",
    "Google Play Services",
    "Google Play Console",
    "Distribution",
    "Acquisition",
    "Monetization",
    "Engagement",
    "Latest news",
    "More Android",
    "Discover",
    "Android Devices",
    "Releases",
    "Documentation and Downloads",
    "Support"
  ],
  "https://developers.google.com/": [
    "Build smarter,ship faster",
    "Gemma 2 is now available globally",
    "Start building today",
    "Android",
    "Modern tools to help you build experiences that people love across every Android device.",
    "Google Cloud",
    "New customers get $300 in free credits to deploy a\n            dynamic website, launch a VM, build a three-tier web app, and more.",
    "Google AI Studio",
    "Build generative AI applications quickly with Gemini in Google AI Studio.",
    "Gemini API",
    "Build and deploy production ready generative AI experiences, enhanced by\n              Gemini models. Get started for free!",
    "Chrome",
    "Modern tools and features that help you build high-quality\n            web experiences.",
    "Google Play",
    "Grow your business, improve app quality, engage your audience, and earn\n              revenue.",
    "Firebase",
    "An app development platform that helps you build and grow\n            apps and games users love.",
    "TensorFlow",
    "An end-to-end platform that makes it easy to build and\n            deploy ML models in any environment.",
    "Flutter",
    "Build, test, and deploy beautiful web, mobile, desktop and\n            embedded apps from one codebase.",
    "Google Ads",
    "Promote your website, products, and app to the right users\n            with Google Ads.",
    "Kaggle",
    "A platform to share machine learning data sets, explore and\n            build models, and compete in competitions.",
    "Angular",
    "The web development framework for building the future.",
    "What are you developing for?",
    "Mobile",
    "Web",
    "AI",
    "Cloud",
    "Trending news",
    "#TheAndroidShow: summer episode",
    "Announcing Flutter 3.24 and Dart 3.5",
    "Gemini 1.5 Flash price drop, tuning, and more",
    "Android Studio Koala feature drop is stable",
    "Find an event",
    "Improve technical skills",
    "Join a community",
    "Follow Google for Developers",
    "YouTube",
    "Subscribe to join a community of creative developers and learn the latest in Google technology.",
    "Instagram",
    "Follow and discover developer resources, community events, and inspirational stories.",
    "LinkedIn",
    "Join a community of creative developers and learn how to use the latest in technology.",
    "X",
    "Join the conversation to discover the latest developer tools, resources, events, and announcements.",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://support.google.com/firebase/answer/6392038": [
    "Link Google Play to Firebase",
    "Linking your Firebase Android App to a Google Play developer account enables the following:",
    "Link to Google Play",
    "Prerequisites",
    "Make sure that your app meets the following requirements:",
    "How to link",
    "Note that your Google Play developer account can be linked to multiple Firebase Android Apps (even in separate Firebase projects), but each Firebase Android App can only be linked to a single Google Play developer account.",
    "To see which Firebase projects and Firebase Android Apps are linked to your developer account, go to theLinked servicessection of your account in the Google Play Console.",
    "Here's how to link a Firebase Android App to a Google Play developer account via the Firebase console:",
    "Unlink from Google Play",
    "You have three options for unlinking Google Play: unlinking Google Play entirely from all apps in your Firebase project, unlinkingallapps for a specific product integration, or unlinkingspecificapps for a specific product integration.",
    "The following will happen for an app that's unlinked:",
    "Here's how to unlink from Google Play via the Firebase console:",
    "Required permissions and suggested roles",
    "To view or manage links to Google Play, you must have the required level of access.",
    "If you don't have the necessary Firebase access, you can ask a Firebase project Owner to assign you the applicable role via theFirebase console IAM settings. If you have questions about accessing your Firebase project, including finding or assigning an Owner, review the\"Permissions and access to Firebase projects\" FAQs.",
    "Project-level",
    "The following table applies to the top-level unlinking and viewing of a Firebase project's integrations with Google Play.",
    "firebase.playLinks.update",
    "Google Analytics",
    "The following table applies specifically to the Google Analytics integration with Google Play.",
    "firebase.playLinks.update",
    "See note below",
    "",
    "Note:To give you more control over your data flow, the access required tounlinkis based on where you perform the action:",
    "Firebase products",
    "The following table applies to any of the Firebase products for which you can enable an integration with Google Play (for example, App Distribution or Crashlytics).",
    "firebase.playLinks.update",
    "Google Play: account Admin",
    "Google Play: account Admin",
    "See note below",
    "",
    "Note:To give you more control over your data flow, the access required tounlinkis based on where you perform the action:",
    "",
    "Was this helpful?",
    "Link Firebase to other Google products"
  ],
  "https://firebase.google.com/products/data-connect": [
    "Build secure, scalable apps on PostgreSQL",
    "Rapidly build mobile, web and AI-powered applications with Cloud SQL for PostgreSQL. Simple and secure query management, type safe SDKs and local development tools that make it easy to build and iterate on new features.",
    "Leverage the power of SQL to structure app data",
    "Connect your app to a fully managed, scalable database using Cloud SQL for PostgreSQL. Data Connect simplifies query management by letting you define schema and data operations through GraphQL interfaces. Or you can bring your own SQL queries into Data Connect. You can even take advantage of Cloud SQL for PostgreSQL's expansive extension marketplace to enable broader functionality.",
    "Build new gen AI experiences with your app data",
    "Data Connect makes it easy to integrate your app's data with gen AI through vector search and LLM-ready APIs. Data Connect offers vector search and integrated embeddings generation, so you can store and search vector embeddings in your AI workflows.\nThis means you can build gen AI workflows with less code and hassle.",
    "Data Connect integrates with Authentication, allowing you to control who is authorized to manage data operations and protect your APIs from abuse.",
    "Query monitoring for performance optimization. With the built in monitoring and tooling to detect errors and latency, you can now optimize your queries and make improvements.",
    "A suite of tools including local emulators and a Visual Studio Code extension create a local environment to rapidly prototype and iterate on new features before rolling them out to production.",
    "Queries supercharge your development",
    "The data model you created automatically generates a Postgres Database Schema, a secure API endpoint for each of your queries, and strongly typed SDKs for web, mobile and servers. In other words, you write the query and Data Connect takes care of the rest.",
    "Documentation",
    "Learn more about Data Connect through our documentation.",
    "Pricing",
    "Understand your charges and estimate your invoice on the pricing page.",
    "Integrating it into your app is easy.",
    "All Firebase products",
    "Build",
    "Run",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://extensions.dev/extensions/firebase/firestore-bigquery-export": [
    "Stream Firestore to BigQuery",
    "Made byFirebase",
    "Sends realtime, incremental updates from a specified Cloud Firestore collection to BigQuery.",
    "How this extension works",
    "Use this extension to export the documents in a Cloud Firestore collection to BigQuery. Exports are realtime and incremental, so the data in BigQuery is a mirror of your content in Cloud Firestore.",
    "The extension creates and updates adatasetcontaining the following two BigQuery resources:",
    "Warning: A BigQuery table corresponding to your configuration will be automatically generated upon installing or updating this extension. Manual table creation may result in discrepancies with your configured settings.",
    "If you create, update, or delete a document in the specified collection, this extension sends that update to BigQuery. You can then run queries on this mirrored dataset.",
    "Note that this extension only listens fordocumentchanges in the collection, but not changes in anysubcollection. You can, though, install additional instances of this extension to specifically listen to a subcollection or other collections in your database. Or if you have the same subcollection across documents in a given collection, you can use{wildcard}notation to listen to all those subcollections (for example:chats/{chatid}/posts).",
    "Enabling wildcard references will provide an additional STRING based column. The resulting JSON field value references any wildcards that are included in ${param:COLLECTION_PATH}. You can extract them usingJSON_EXTRACT_SCALAR.",
    "Partitionsettings cannot be updated on a pre-existing table, if these options are required then a new table must be created.",
    "Note: To enable partitioning for a Big Query database, the following fields are required:",
    "Clusteringwill not need to create or modify a table when adding clustering options, this will be updated automatically.",
    "Additional setup",
    "Before installing this extension, you’ll need to:",
    "Import existing documents",
    "There are two ways to import existing Firestore documents into BigQuery - the backfill feature and the import script.",
    "To import documents that already exist at installation time into BigQuery, answerYeswhen the installer asks “Import existing Firestore documents into BigQuery?” The extension will export existing documents as part of the installation and update processes.",
    "Alternatively, you can run the externalimport scriptto backfill existing documents. If you plan to use this script, answerNowhen prompted to import existing documents.",
    "Important:Run the external import script over the entire collectionafterinstalling this extension, otherwise all writes to your database during the import might be lost.",
    "If you don’t either enable automatic import or run the import script, the extension only exports the content of documents that are created or changed after installation.",
    "Transform function",
    "Prior to sending the document change to BigQuery, you have an opportunity to transform the data with an HTTP function. The payload will contain the following:",
    "The response should be indentical in structure.",
    "Using Customer Managed Encryption Keys",
    "By default, BigQuery encrypts your content stored at rest. BigQuery handles and manages this default encryption for you without any additional actions on your part.",
    "If you want to control encryption yourself, you can use customer-managed encryption keys (CMEK) for BigQuery. Instead of Google managing the key encryption keys that protect your data, you control and manage key encryption keys in Cloud KMS.",
    "For more general information on this, seethe docs.",
    "To use CMEK and the Key Management Service (KMS) with this extension",
    "If you follow these steps, your changelog table should be created using your customer-managed encryption.",
    "Generate schema views",
    "After your data is in BigQuery, you can run theschema-views script(provided by this extension) to create views that make it easier to query relevant data. You only need to provide a JSON schema file that describes your data structure, and the schema-views script will create the views.",
    "Billing",
    "To install an extension, your project must be on theBlaze (pay as you go) plan",
    "Dec 9, 2023 by Firebase",
    "Google",
    "Stay connected",
    "Learn",
    "Support"
  ],
  "https://github.com/firebase/": [
    "Navigation Menu",
    "Search code, repositories, users, issues, pull requests...",
    "Provide feedback",
    "We read every piece of feedback, and take your input very seriously.",
    "Saved searches",
    "Use saved searches to filter your results more quickly",
    "To see all available qualifiers, see ourdocumentation.",
    "Firebase",
    "PinnedLoading",
    "Firebase Quickstart Samples for Android",
    "Kotlin8.8k7.3k",
    "Firebase Quickstart Samples for iOS",
    "Swift2.8k1.5k",
    "Firebase Quickstart Samples for Web",
    "TypeScript5.1k3.7k",
    "Collection of sample apps showcasing popular use cases using Cloud Functions for Firebase",
    "JavaScript12k3.8k",
    "Firebase Quickstart Samples for Unity",
    "C#826428",
    "Firebase Quickstart Samples for C++",
    "C++211123",
    "Repositories",
    "The Firebase Command Line Tools",
    "🔥 A collection of Firebase plugins for Flutter apps.",
    "Firebase Admin Python SDK",
    "Android snippets for firebase.google.com",
    "An open source framework for building AI-powered apps with familiar code-centric patterns. Genkit makes it easy to integrate, test, and deploy sophisticated AI features to Firebase or Google Cloud.",
    "Cloud Firestore Android codelab",
    "Web snippets for firebase.google.com",
    "Collection of sample apps showcasing popular use cases using Cloud Functions for Firebase",
    "Samples demonstrating how to test your Firebase app",
    "People",
    "Top languages",
    "Most used topics",
    "Footer",
    "Footer navigation"
  ],
  "https://console.firebase.google.com/?dlAction=PrepDemoProject&_gl=1*1u01ahp*_ga*OTA3NzM0MzcwLjE3MTE1OTcxNDA.*_ga_CW55HF8NVT*MTcxMzE5NjI0Ny4xOS4xLjE3MTMxOTYyNTYuNTEuMC4w": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://firebase.google.com/support/": [
    "Get help quickly",
    "What can we helpyou with?",
    "Firebase status",
    "Visit theFirebase Status Dashboardfor detailed Firebase service status information.",
    "Ask the Firebase community",
    "Example: \"How do I cancel a file upload?\"StackOverflowis the best place to get help with using Firebase APIs in your code. Make sure you knowhow to ask a good questionto help get a quick response.",
    "Example: \"Will this database structure work?\"OurGoogle Groupis the best place to have a longer conversation with our team via email.",
    "Example: \"Is anyone using Firebase with PHP?\"TheFirebase Slackis the best place to reach out to the Firebase community for a quick chat.",
    "Can't find your issue?",
    "Click to submit a support case.",
    "Integrating it into your app is easy.",
    "All Firebase products",
    "Build",
    "Run",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://firebase.google.com/products/ab-testing": [
    "Firebase A/B TestingBETA",
    "Optimize your app experience",
    "Streamline the way you run, analyze, and scale product and marketing experiments with the power to test changes to your app's UI, features, or engagement campaigns.",
    "Intelligently grow your app with experiments",
    "Firebase A/B Testing helps you improve your app by making it easy to run, analyze, and scale product and marketing experiments. It gives you the power to test changes to your app's UI, features, AI systems, or engagement campaigns to see how they impact your key metrics before you implement them widely.",
    "Achieve your business goals",
    "Firebase A/B Testing shows you the impact app changes have on your most important business metrics. Out-of-the-box, it tracks retention, revenue, and engagement. In conjunction with Google Analytics for Firebase, you can also track how user actions change in each experiment.",
    "Customize experiments to test a variety of updates",
    "Firebase A/B Testing gives you the flexibility to customize your experiment to suit your unique app needs. You determine what elements you want to test, which users to target, what parameters to put in place, and how many variants to include. Want to revamp your onboarding flow? Tweak the copy of your notifications? Or even change the frequency of your ad intermissions? Anything that can be defined in a variable can be tested with Firebase A/B Testing because it works seamlessly with both Cloud Messaging and Remote Config",
    "Roll out changes with confidence",
    "Using sophisticated analysis on the backend, Firebase A/B Testing will help you determine not only which variation performed best, but also if these results are statistically significant. Stop worrying about potential repercussions of app updates; use Firebase A/B Testing to test, modify and roll out changes to your app with confidence.",
    "Empower your team without eating up engineering time",
    "A/B testing is important, but it requires a significant amount of engineering effort to create the infrastructure needed to run an A/B test. With Firebase A/B Testing, set-up is quick and easy. Once A/B testing is configured, anyone in your organization can run and analyze experiments because Firebase A/B Testing fits naturally with your experimentation process. It doesn't change the way you work; it allows you to iterate faster, and at larger scale",
    "Learn how A/B Testing helps teams across the world improve app quality",
    "STAGE uses Firebase and Flutter to cut release time in half",
    "STAGE paired Flutter's front-end tools with Firebase's back-end services to build a multi-platform app, with infrastructure that securely stores and delivers content to almost 2 million users in real time for a smooth viewing experience - helping them stand out in India's competitive streaming market.",
    "Pomelo Games used Firebase to increase revenue by up to 35% without losing players",
    "Pomelo Games, one of the top game studios in Uruguay, used Remote Config, A/B Testing, Google Analytics, and Crashlytics to test interstitial ads in their game. This led to an increase in both ad revenue and in-app purchases with no decline in retention or stability.",
    "Le Figaro leverages Firebase to increase paid subscriptions across mobile and web apps",
    "Le Figaro used a number of Firebase products to retain existing users, increase paid subscriptions and decrease development time.",
    "Hotstar scales with Firebase and increases engagement by 38%",
    "Hotstar, India's largest entertainment app with millions of users around the world, provides live-streaming of TV shows, movies, sports, and news on the go. By using a combination of Firebase products together, Hotstar safely rolled out new features to its watch screen during a major live-streaming event without disrupting users, sacrificing stability, or releasing a new build.",
    "Tapple uses Firebase to increase subscriptions by 8%",
    "Japanese developer Tapple, used Remote Config and A/B Testing to test different subscription prompts to see which one was most effective in driving registrations. This helped them systematically maximize the lifetime value of their 5 million users.",
    "GameNexa Studios uses Firebase to increase revenue",
    "GameNexa Studios, an app developer and consultancy based in India, used a variety of Firebase products to double in-app purchase revenue and diversify monetization strategy.",
    "Mobills increases subscriptions by 15% with Firebase",
    "Mobills, an easy-to-use personal finance app with more than 8 million downloads, used Remote Config and A/B Testing to confidently make improvements to their user interface and test different calls-to-action. The insights they gained helped them boost subscriptions by a whopping 15%.",
    "Vinwap uses Firebase to increase ad revenue by 30% in only 6 days",
    "Vinwap, maker of \"live\" wallpapers for Android devices, wanted to increase ad revenue without decreasing user engagement. See how they used Remote Config and A/B testing to increase revenue by almost a third in less than a week.",
    "Documentation",
    "Learn how to get started with A/B Testing by reviewing our technical documentation.",
    "Pricing",
    "A/B Testing is a no cost tool within the Firebase platform.",
    "Integrating it into your app is easy.",
    "All Firebase products",
    "Build",
    "Run",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://console.firebase.google.com/": [
    "Sign in",
    "Use your Google Account",
    "",
    "Forgot email?",
    "Not your computer? Use a private browsing window to sign in.Learn more about using Guest mode"
  ],
  "https://firebase.blog": [
    "The Firebase Blog",
    "Firebase App Hosting: Environments & deployment settings",
    "The Firebase Blog",
    "Firebase App Hosting: Environments & deployment settings",
    "Firebase App Hosting: July Update",
    "Understanding FCM Message Delivery on Android",
    "Firebase Just Got Smarter: Meet Your New AI Development Assistant",
    "Building an AI-powered crossword puzzle with Genkit and Gemini",
    "App Hosting vs. the original Hosting: Which one do I use?",
    "Query-Defined Infrastructure with Firebase Data Connect",
    "Introducing Gemini in Firebase",
    "Streamline SSR app development with FirebaseServerApp",
    "What’s New in the Flutter SDK for Firebase",
    "Categories"
  ],
  "https://support.google.com/firebase/answer/7392275": [
    "Link Display & Video 360 and Campaign Manager 360 to Firebase",
    "If you or the advertising agency you're working with would like to use Display & Video 360 or Campaign Manager 360 to track in-app events measured in Firebase as conversions (e.g.,app_updateorin_app_purchase), you can send an account-link request from one of these accounts to your Firebase project. Once linked, these Firebase events are treated as any other conversions for ads run on Google Marketing Platform display advertising products, and you can use them in attribution and/or bid optimization. For conversions attributed to Display & Video 360 or Campaign Manager 360, some campaign-specific information is returned back to Firebase for use in Analytics reporting.",
    "The link between these products and Firebase can be initiated by users of either Display & Video 360 or Campaign Manager 360.",
    "At a high level, the linking process consists of the following steps:",
    "Step 1:An advertiser initiates the linking in Display & Video 360 or in Campaign Manager 360 which results in a notification email being sent to the project owners in Firebase.",
    "Step 2:The developer reviews the link request in the Firebase console and approves the request.",
    "Once the link is approved, advertisers can attribute conversions back to ads run on Google Marketing Platform display advertising products.",
    "You can remove a linked account at any time. If a linked account is removed, Google Marketing Platform tracking for apps from the linked Firebase project is disabled.",
    "Enable events as conversions in Firebase",
    "All app events that you want to track in Display & Video 360 and Campaign Manager 360 must be enabled as conversions. Learn more aboutevents in Firebase.",
    "Request a link to a Firebase project from Display & Video 360 or Campaign Manager 360",
    "Accept a link request in the Firebase console",
    "After an administrator requests to link an account to your Firebase project, you'll receive an email notification. Note that only the Firebase project owners are invited to accept the link request.",
    "As a Firebase project owner, you can also review requests on the Firebase console Project Settings page.",
    "The completed link in Display & Video 360 and Campaign Manager 360",
    "After the link request is accepted in the Firebase console, app events enabled as conversions in Firebase will populate automatically in Display & Video 360 or Campaign Manager 360. App Store ID must be added to your app in Firebase'sgeneral settingsfor iOS events to populate.",
    "Unlink accounts from Firebase",
    "Any Firebase project owner can unlink account from Firebase. To unlink:",
    "Was this helpful?",
    "Link Firebase to other Google products"
  ],
  "https://firebase.google.com/products/realtime-database": [
    "Firebase Realtime Database",
    "Store and sync data in real time",
    "Data is synced across all clients in realtime, and remains available when your app goes offline.",
    "Real time syncing for JSON data",
    "Cloud Firestore enables you to store, sync and query app data at global scale.",
    "Collaborate across devices with ease",
    "Realtime syncing makes it easy for your users to access their data from any device: web or mobile, and it helps your users collaborate with one another.",
    "Build serverless apps",
    "Realtime Database ships with mobile and web SDKs so you can build apps without the need of servers. You can also execute backend code that responds to events triggered by your database usingCloud Functions for Firebase.",
    "Optimized for offline use",
    "When your users go offline, the Realtime Database SDKs use local cache on the device to serve and store changes. When the device comes online, the local data is automatically synchronized.",
    "Strong user-based security",
    "The Realtime Database integrates with Firebase Authentication to provide simple and intuitive authentication for developers. You can use our declarative security model to allow access based on user identity or with pattern matching on your data.",
    "Learn how Realtime Database helps teams across the world improve app quality",
    "STAGE uses Firebase and Flutter to cut release time in half",
    "STAGE paired Flutter's front-end tools with Firebase's back-end services to build a multi-platform app, with infrastructure that securely stores and delivers content to almost 2 million users in real time for a smooth viewing experience - helping them stand out in India's competitive streaming market.",
    "Acintyo uses Firebase to streamline and speed up app development by 25%",
    "With millions of users across 175 countries, the Galarm team used Firebase's fully-managed, scalable infrastructure to accelerate app development, automate tasks, and free up engineering time so they could focus on bringing their ideas to life.",
    "Documentation",
    "Learn more about Cloud Firebase through our documentation.",
    "Pricing",
    "Learn more about our No-Cost quotas and usage pricing.",
    "Integrating it into your app is easy.",
    "All Firebase products",
    "Build",
    "Run",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://support.google.com/datastudio/answer/7259176": [
    "This article is about Looker Studio. For Looker documentation, visithttps://cloud.google.com/looker/docs/intro.",
    "Connect to Firebase (via BigQuery)",
    "Firebase is Google's web and mobile app analytics platform. Firebase lets you share users, data, and analytics across platforms, meaning your users have the same experience whatever device they’re on and you can manage performance all in one place.",
    "Learn more about Firebase.",
    "You can use Looker Studio to turn your raw Firebase Analytics data into informative reports that are easy to read, easy to share, and fully customizable. It does this by leveraging its BigQuery connector: after youlink your Firebase app to BigQuery, your BigQuery dataset can be visualized beautifully in Looker Studio.",
    "To create BigQuery data sources in Looker Studio, please refer to theBigQuery connectorarticle.",
    "Was this helpful?",
    "Need more help?",
    "Try these next steps:",
    "Connect to Google Analytics",
    "Learn about new features and recent changes. Looker Studio release notes live on Google Cloud."
  ],
  "https://developers.google.com/products/": [
    "Developer products",
    "Android",
    "Modern tools to help you build experiences that people love across every Android device.",
    "Google Cloud",
    "New customers get $300 in free credits to deploy a dynamic\n            website, launch a VM, build a three-tier web app, and more.",
    "Google AI Studio",
    "Build generative AI applications quickly with Gemini in Google AI Studio.",
    "Chrome",
    "Modern tools and features that help you build high-quality\n            web experiences.",
    "All products",
    "Or explore by development focus",
    "Mobile",
    "Web",
    "AI",
    "Cloud",
    "Connect",
    "Programs",
    "Developer consoles"
  ],
  "https://extensions.dev": [
    "Find extensions to build an app quickly and easily",
    "AI",
    "Marketing",
    "Messaging",
    "Payments",
    "Search",
    "Shipping",
    "Social",
    "Utilities",
    "Latest Extensions",
    "Cloudflare Turnstile App Check Provider",
    "Made byCloudflare",
    "The Cloudflare Turnstile App Check Provider for Firebase.",
    "<10installs",
    "Auto Stop Services",
    "Made byKurt Weston",
    "Stops cost overruns by disabling Firebase services when a billing threshold has been reached.",
    "80+installs",
    "Auto Stop Services",
    "Made byKurt Weston",
    "Stops cost overruns by disabling Firebase services when a billing threshold has been reached.",
    "80+installs",
    "Save Forms to Google Sheets",
    "Made bydjawadi",
    "Easily save the data from landing pages or contact forms directly into a Google Spreadsheet.",
    "20+installs",
    "Additional Content |View all additional content",
    "Chatbot with Gemini",
    "Written by Firebase",
    "The Chatbot with Gemini extension provides an easy way to integrate a chatbot into your app with Googles Gemini",
    "Dec 18, 2023Read more",
    "Multimodal Tasks with Gemini",
    "Written by Firebase",
    "The Multimodal Tasks with Gemini extension provides an easy way to integrate multimodal tasks into your app with Googles Gemini",
    "Dec 18, 2023Read more",
    "Trigger Email from Firestore",
    "Written by Firebase",
    "The Trigger Email Firestore extension provides an easy way to trigger emails from Firestore",
    "Dec 10, 2023Read more",
    "Stream Firestore to BigQuery",
    "Written by Firebase",
    "The Stream Firestore to BigQuery extension provides an easy way to stream your Firestore data to BigQuery",
    "Dec 9, 2023Read more",
    "Popular Extensions |View all extensions",
    "Stream Firestore to BigQuery",
    "Made byFirebase",
    "Sends realtime, incremental updates from a specified Cloud Firestore collection to BigQuery.",
    "65.7K+installs",
    "Search Firestore with Algolia",
    "Made byAlgolia",
    "Enables full text search of your Cloud Firestore data with Algolia.",
    "27.7K+installs",
    "Resize Images",
    "Made byFirebase",
    "Resizes images uploaded to Cloud Storage to a specified size, and optionally keeps or deletes the original image.",
    "21.1K+installs",
    "Trigger Email from Firestore",
    "Made byFirebase",
    "Composes and sends an email based on the contents of a document written to a specified Cloud Firestore collection.",
    "25.5K+installs",
    "AI Extensions |View all extensions",
    "Search Firestore with Algolia",
    "Made byAlgolia",
    "Enables full text search of your Cloud Firestore data with Algolia.",
    "27.7K+installs",
    "Translate Text in Firestore",
    "Made byFirebase",
    "Translates strings written to a Cloud Firestore collection into multiple languages (uses Cloud Translation API).",
    "3.9K+installs",
    "Build Chatbot with the Gemini API",
    "Made byGoogle Cloud",
    "Deploys customizable chatbots using Gemini models and Firestore.",
    "1.3K+installs",
    "Multimodal Tasks with the Gemini API",
    "Made byGoogle Cloud",
    "Performs multimodel generative tasks on text and images, customizable with prompt engineering, using Gemini models and Firestore.",
    "500+installs",
    "Messaging Extensions |View all extensions",
    "Trigger Email from Firestore",
    "Made byFirebase",
    "Composes and sends an email based on the contents of a document written to a specified Cloud Firestore collection.",
    "25.5K+installs",
    "Send Messages with Twilio",
    "Made byTwilio",
    "Sends a message using the Twilio API based on the contents of a document written to a specified Cloud Firestore collection.",
    "1.7K+installs",
    "Send Messages with MessageBird",
    "Made byMessageBird",
    "Sends messages and notifications using the MessageBird Conversations API.",
    "400+installs",
    "Send email with MailerSend",
    "Made byMailerSend",
    "Send transactional emails using MailerSend.",
    "300+installs",
    "Search Extensions |View all extensions",
    "Search Firestore with Algolia",
    "Made byAlgolia",
    "Enables full text search of your Cloud Firestore data with Algolia.",
    "27.7K+installs",
    "Search Firestore with Typesense",
    "Made byTypesense",
    "Indexes data from Firestore into Typesense for full-text search",
    "2.8K+installs",
    "Search with Elastic App Search",
    "Made byElastic",
    "Syncs documents from a Firestore collection to Elastic App Search to enable full-text search.",
    "1K+installs",
    "Search with Meilisearch",
    "Made byMeilisearch",
    "Full-text Search on Firebase with Meilisearch",
    "600+installs",
    "Why extensions",
    "Build your own extension",
    "Register as a publisher and join our dynamic community of builders to build, publish, and share with the Firebase Community",
    "Ready to build?",
    "Build your first extension with step-by-step documentation",
    "Ready to publish?",
    "Then let’s get you registered, so that you can publish it next",
    "Try Firebase today",
    "Integrating it into your app is easy.",
    "Google",
    "Stay connected",
    "Learn",
    "Support"
  ],
  "https://firebase.google.com/docs/run": [
    "Learn about Run products",
    "Test your app and collect user feedback before release",
    "Test Lab",
    "App Distribution",
    "Improve app stability and performance",
    "Crashlytics",
    "Performance Monitoring",
    "Iterate and dynamically update your app",
    "Remote Config",
    "A/B Testing",
    "Understand and engage with users",
    "Boost Analytics",
    "Cloud Messaging",
    "In-App Messaging",
    "Except as otherwise noted, the content of this page is licensed under theCreative Commons Attribution 4.0 License, and code samples are licensed under theApache 2.0 License. For details, see theGoogle Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates.",
    "Last updated 2024-05-15 UTC.",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://firebase.community/": [
    "- OR -",
    "TheFirebase CommunityonSlackis a place to talk about all things Firebase! This is run by the community and isnot the official Firebase product support channel.",
    "Code of Conduct"
  ],
  "https://flutter.dev/": [
    "Build for any screen",
    "Flutter transforms the development process. Build, test, and deploy beautiful mobile, web, desktop, and embedded experiences from a single codebase.",
    "Flutter is an open source framework for building beautiful, natively compiled, multi-platform applications from a single codebase.",
    "Fast",
    "Flutter code compiles to ARM or Intel machine code as well as JavaScript, for fast performance on any device.",
    "Productive",
    "Build and iterate quickly with Hot Reload. Update code and see changes almost instantly, without losing state.",
    "Flexible",
    "Control every pixel to create customized, adaptive designs that look and feel great on any screen.",
    "Multi-Platform",
    "Reach users on every screen",
    "Deploy to multiple devices from a single codebase: mobile, web, desktop, and embedded devices.",
    "Developer Experience",
    "Transform your workflow",
    "Take control of your codebase with automated testing, developer tooling, and everything else you need to build production-quality apps.",
    "Stable & Reliable",
    "Trusted by many",
    "Flutter is supported and used by Google, trusted by well-known brands around the world, and maintained by a community of global developers.",
    "Flutter and Google",
    "Seamless integration with Google services",
    "Connect to Google's app development ecosystem, allowing you to streamline development and reach a wider audience through seamless integration with Firebase, Google Ads, Google Play, Google Pay, Google Wallet, Google Maps, and more.",
    "Developer Story",
    "See how Google Pay uses Flutter to change the world of mobile payments",
    "A Global Open Source Community",
    "Supported by Google, open to everyone",
    "Collaborate on the open source framework, contribute to the package ecosystem on pub.dev, and find help when you need it.",
    "Dart",
    "Flutter is powered by Dart, a language optimized for fast apps on any platform",
    "Latest news",
    "Announcing Flutter 3.24 and Dart 3.5",
    "What’s new in Flutter 3.24",
    "Announcing Dart 3.5",
    "Getting started with Flutter GPU",
    "Sharing Flutter’s 2024 roadmap",
    "Join ournewsletter",
    "Keep up with the latest Flutter news, releases, and more:",
    "You're in!",
    "You have successfully signed up for the latest Flutter updates and announcements.",
    "Get started",
    "Instant access to the power of the Flutter framework",
    "NOTICE: Flutter hopes this directory is useful for customers seeking consultants with Flutter experience; however, Flutter makes no representation to you or anyone else that the listed consultants are Flutter or Google partners, and Flutter does not represent or warrant their qualifications or the quality of services you may receive.  Your relationship is strictly between you and the consultants."
  ],
  "https://support.google.com/firebase/answer/6318765": [
    "Link BigQuery to Firebase",
    "Linking Firebase to BigQuery lets you do the following:",
    "When you link Firebase to BigQuery, you can choose to export Google Analytics (including some A/B Testing data), Crashlytics, Cloud Messaging, and/or Performance Monitoring data to corresponding BigQuery datasets on a daily basis.",
    "Note: Firebase Dynamic Links is currently deprecated.Learn more about these changes.",
    "You can query, export, or join your datasets with data from external sources to perform custom analysis.",
    "About BigQuery export",
    "When you export data to BigQuery, you own that data, and you can use BigQuery ACLs to manage permissions on projects and datasets.",
    "You can exportGoogle Analytics,Crashlytics,Cloud Messaging, andPerformance Monitoringdata to theBigQuery sandboxat no cost (Sandbox limitsapply).",
    "With the BigQuery sandbox integration, you have access to:",
    "Learn more aboutupgrading from the SandboxandBigQuery pricing.",
    "Link a Firebase project to BigQuery",
    "Note the following about export of Google Analytics data to BigQuery:",
    "Manage which apps send data to BigQuery",
    "Unlinking your app(s) stops the corresponding dataset(s) in BigQuery from being populated. However, the dataset(s) will persist and storage and query charges may still apply. You candelete your datasetto prevent further billing.",
    "To manage which apps in a linked project send data to BigQuery:",
    "Note: For export of Google Analytics data, use the Streams in this projectswitch to control the export of web streams from the associated Firebase project and the associated Google Analytics 4 property.",
    "Unlink a Firebase project from BigQuery",
    "Unlinking your project stops the corresponding dataset(s) in BigQuery from being populated. However, the dataset(s) will persist and storage and query charges may still apply. You candelete your datasetto prevent further billing.",
    "To unlink your project from BigQuery:",
    "Was this helpful?",
    "Link Firebase to other Google products"
  ],
  "https://firebase.google.com/docs/samples/": [
    "Samples",
    "Multi-Feature Samples",
    "Codelabs",
    "Firebase and Cloud Integration Samples",
    "Learn",
    "Stay connected",
    "Support"
  ],
  "https://firebase.blog/": [
    "The Firebase Blog",
    "Firebase App Hosting: Environments & deployment settings",
    "The Firebase Blog",
    "Firebase App Hosting: Environments & deployment settings",
    "Firebase App Hosting: July Update",
    "Understanding FCM Message Delivery on Android",
    "Firebase Just Got Smarter: Meet Your New AI Development Assistant",
    "Building an AI-powered crossword puzzle with Genkit and Gemini",
    "App Hosting vs. the original Hosting: Which one do I use?",
    "Query-Defined Infrastructure with Firebase Data Connect",
    "Introducing Gemini in Firebase",
    "Streamline SSR app development with FirebaseServerApp",
    "What’s New in the Flutter SDK for Firebase",
    "Categories"
  ],
  "https://www.youtube.com/user/Firebase": [],
  "https://developer.android.com/studio/debug/app-quality-insights": [
    "Analyze issues from Firebase Crashlytics and Android Vitals with App Quality Insights",
    "You can see and act on app crash data fromFirebase CrashlyticsandAndroid Vitalsdirectly in Android Studio. This integration pulls stack trace data and crash\nstatistics from Crashlytics and Google Play into theApp Quality Insightstool window in the Studio IDE, so you don't have to jump back and forth between\nyour browser and the IDE. Development teams can benefit from key capabilities\nincluding the following:",
    "Android Vitals reports are available to all apps published to Google Play. If\nyou're not using Crashlytics yet and would like to learn more about its\nofferings, seeFirebase Crashlytics.",
    "Get started",
    "To see Crashlytics data in Android Studio, you need to set up Firebase and\nCrashlytics in your app project. Here's how: open the Firebase Assistant in\nAndroid Studio by going toTools > Firebase, clickCrashlytics, and then\nfollow the tutorial to add Firebase and Crashlytics to your project. You can\nread more about the Firebase Assistant workflow inFirebase's getting started guide for Android.",
    "If you've already added Firebase and Crashlytics to your app, sign in to your\nDeveloper account in the IDE by clicking on the avatar icon.\nAfter you sign in, click theApp Quality Insightstool window. You should\nsee the panels populate with reports from Crashlytics.",
    "Analyze Android vitals",
    "App Quality InsightsincludesAndroid vitalsdata. This lets you more easily access core metrics collected by Google Play and\nimprove your user experience. Use Android vitals to address issues related to\napp stability to help improve the quality of your app on Google Play.",
    "",
    "You can view Android vitals issues, filter them, and jump from stack trace to\ncode all from theApp Quality Insightstool window. To get started, follow\nthese steps:",
    "Optional: To use version control integration for a debuggable build, add the\nlatestFirebase Crashlytics SDK(or Firebase Android Bill of Materials) to your app. Then add the following\ncode to the module-levelbuild.gradle.ktsorbuild.gradlefile. Release\n(non-debuggable) builds have the flag enabled by default.",
    "Kotlinandroid{buildTypes{getByName(\"debug\"){vcsInfo{include=true}}}}Groovyandroid{buildTypes{debug{vcsInfo{includetrue}}}}",
    "Kotlin",
    "Groovy",
    "Analyze Crashlytics data in Android Studio",
    "TheApp Quality Insightstool window has rich data that gives you insight\ninto the events your users are encountering, and links to help you quickly\nnavigate to the sources of those events.",
    "",
    "TheStack tracetab shows details about the latest\n  occurrence of the event you click in theIssuespanel. You can see the\n  event's stack trace and click the stack trace to jump to the relevant lines in\n  your codebase. If your code has changed since the crash occurred, clickshow diffnext to the error in the stack trace to view a diff between\n  your current code and the version of your codebase that generated the crash.",
    "There is also information about the device type affected, its Android\n  version, and the time the event occurred, as well a link to the event in the\n  Firebase Crashlytics dashboard. To browse info for multiple events in a group,\n  use the left and right arrows. ClickClose issueto close an issue\n  directly from the panel.",
    "In addition to being able to navigate from stack trace to code, you can also\njump from code to stack trace: Android Studio now annotates lines of code that\nare related to crashes with a crash gutter iconso you\ncan easily spot and debug them.",
    "When you hover over the crash icon, a pop-up appears that shows how many events\ninvolve that line of code, and the event frequencies.",
    "",
    "Click on the crash icon for a more detailed list of events, including the\nfrequency of and number of users affected by a given event. Click on a specific\nevent to jump to the event details in theApp Quality Insightstool window.",
    "",
    "Different numbers between Android vitals and Crashlytics",
    "Note that Android vitals and Crashlytics might report different values for the\nnumbers of users and events associated with the same crash. These discrepancies\nhappen because Play and Crashlytics can catch crashes at different times and for\ndifferent users. Here are a couple reasons for why the Play and Crashlytics\ncounts might differ:",
    "Investigate with limited functionality when offline",
    "If you make a new request, for example by clickingRefresh, and Android\nStudio is unable to communicate with Crashlytics, theApp Quality Insightswindow lets you to enterOffline Mode.",
    "",
    "While in this mode, you can continue to investigate issues and the latest events\nfrom cached data. Certain functionality, such as changing some filter options or\nclosing issues, isn't available. To retry your connection to Crashlytics\nand return to an online state, clickReconnect.",
    "Content and code samples on this page are subject to the licenses described in theContent License. Java and OpenJDK are trademarks or registered trademarks of Oracle and/or its affiliates.",
    "Last updated 2024-04-30 UTC.",
    "More Android",
    "Discover",
    "Android Devices",
    "Releases",
    "Documentation and Downloads",
    "Support"
  ]
}